[Killed] ConditionalExpression
src/ui/Toast.js:6:9
 export class Toast {
   constructor (container, message, type = 'info') {
     this.element = Utils.createElement('div', 'tulweb-toast', container)
-    if (type === 'error') this.element.classList.add('error')
+    if (false) this.element.classList.add('error')
 
     const icon = type === 'error'
killedBy: Toast Component Tests Toast adds error class and specific icon for error type
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/ui/Toast.js:6:9
 export class Toast {
   constructor (container, message, type = 'info') {
     this.element = Utils.createElement('div', 'tulweb-toast', container)
-    if (type === 'error') this.element.classList.add('error')
+    if (type !== 'error') this.element.classList.add('error')
 
     const icon = type === 'error'
killedBy: Toast Component Tests Toast initializes with correct message and type
statusReason: Error: expect(received).toBeNull()

Received: <div class="tulweb-toast error"><svg fill="none" height="18" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" width="18"><path d="M22 11.08V12a10 10 0 1 1-5.93-9.14" /><polyline points="22 4 12 14.01 9 11.01" /></svg><span>Hello World</span></div>

[Killed] ConditionalExpression
src/ui/Toast.js:8:18
     this.element = Utils.createElement('div', 'tulweb-toast', container)
     if (type === 'error') this.element.classList.add('error')
 
-    const icon = type === 'error'
+    const icon = false
killedBy: Toast Component Tests Toast adds error class and specific icon for error type
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "circle"
Received string:    "<svg width=\"18\" height=\"18\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\"><path d=\"M22 11.08V12a10 10 0 1 1-5.93-9.14\"></path><polyline points=\"22 4 12 14.01 9 11.01\"></polyline></svg><span>Error Occurred</span>"

[Killed] EqualityOperator
src/ui/Toast.js:8:18
     this.element = Utils.createElement('div', 'tulweb-toast', container)
     if (type === 'error') this.element.classList.add('error')
 
-    const icon = type === 'error'
+    const icon = type !== 'error'
killedBy: Toast Component Tests Toast adds error class and specific icon for error type
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "circle"
Received string:    "<svg width=\"18\" height=\"18\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\"><path d=\"M22 11.08V12a10 10 0 1 1-5.93-9.14\"></path><polyline points=\"22 4 12 14.01 9 11.01\"></polyline></svg><span>Error Occurred</span>"

[Survived] StringLiteral
src/ui/Toast.js:12:37
 
-    this.element.innerHTML = icon + '<span>' + message + '</span>'
+    this.element.innerHTML = icon + "" + message + '</span>'
 
     setTimeout(() => {

[Killed] BlockStatement
src/ui/Toast.js:14:22
 
     this.element.innerHTML = icon + '<span>' + message + '</span>'
 
-    setTimeout(() => {
-      this.element.classList.add('hiding')
-      setTimeout(() => this.destroy(), 300)
-    }, 3000)
+    setTimeout(() => {}, 3000)
   }
 
killedBy: Toast Component Tests Toast auto-destroys after timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/ui/Toast.js:16:18
 
     setTimeout(() => {
       this.element.classList.add('hiding')
-      setTimeout(() => this.destroy(), 300)
+      setTimeout(() => undefined, 300)
     }, 3000)
   }
killedBy: Toast Component Tests Toast auto-destroys after timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/ui/Toast.js:20:14
     }, 3000)
   }
 
-  destroy () {
-    if (this.element && this.element.parentElement) {
-      this.element.parentElement.removeChild(this.element)
-    }
-  }
+  destroy () {}
 }
 
killedBy: Toast Component Tests Toast auto-destroys after timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/ui/Toast.js:21:53
   }
 
   destroy () {
-    if (this.element && this.element.parentElement) {
-      this.element.parentElement.removeChild(this.element)
-    }
+    if (this.element && this.element.parentElement) {}
   }
 }
killedBy: Toast Component Tests Toast auto-destroys after timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/ui/Toast.js:21:9
   }
 
   destroy () {
-    if (this.element && this.element.parentElement) {
+    if (this.element || this.element.parentElement) {
       this.element.parentElement.removeChild(this.element)
     }
killedBy: Toast Component Tests destroy() safely removes element
statusReason: TypeError: Cannot read properties of null (reading 'removeChild')
