[Killed] StringLiteral
src/ui/ContextMenu.js:6:47
 export class ContextMenu {
   constructor (layoutManager, evt, stack, child, index) {
     this.layoutManager = layoutManager
-    this.element = Utils.createElement('div', 'tulweb-context-menu', document.body)
+    this.element = Utils.createElement('div', "", document.body)
     this.element.style.left = evt.clientX + 'px'
     this.element.style.top = evt.clientY + 'px'
killedBy: ContextMenu Component Tests clicking outside the menu closes it
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Survived] StringLiteral
src/ui/ContextMenu.js:8:44
     this.layoutManager = layoutManager
     this.element = Utils.createElement('div', 'tulweb-context-menu', document.body)
     this.element.style.left = evt.clientX + 'px'
-    this.element.style.top = evt.clientY + 'px'
+    this.element.style.top = evt.clientY + ""
 
     this._closeHandler = this._closeHandler.bind(this)

[Killed] EqualityOperator
src/ui/ContextMenu.js:12:9
 
     this._closeHandler = this._closeHandler.bind(this)
 
-    if (child.config.closeable !== false) {
+    if (child.config.closeable === false) {
       this.addOption('Close Tab', () => child.destroy())
     }
killedBy: ContextMenu Component Tests ContextMenu displays correct options based on configuration
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Close Tab"

[Killed] ConditionalExpression
src/ui/ContextMenu.js:12:9
 
     this._closeHandler = this._closeHandler.bind(this)
 
-    if (child.config.closeable !== false) {
+    if (false) {
       this.addOption('Close Tab', () => child.destroy())
     }
killedBy: ContextMenu Component Tests ContextMenu displays correct options based on configuration
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Close Tab"

[Killed] ArrowFunction
src/ui/ContextMenu.js:13:35
     this._closeHandler = this._closeHandler.bind(this)
 
     if (child.config.closeable !== false) {
-      this.addOption('Close Tab', () => child.destroy())
+      this.addOption('Close Tab', () => undefined)
     }
     this.addOption('Close Other Tabs', () => {
killedBy: ContextMenu Component Tests clicking an option triggers action and destroys menu
statusReason: Error: expect(received).toBeNull()

[Killed] StringLiteral
src/ui/ContextMenu.js:13:22
     this._closeHandler = this._closeHandler.bind(this)
 
     if (child.config.closeable !== false) {
-      this.addOption('Close Tab', () => child.destroy())
+      this.addOption("", () => child.destroy())
     }
     this.addOption('Close Other Tabs', () => {
killedBy: ContextMenu Component Tests ContextMenu displays correct options based on configuration
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Close Tab"

[NoCoverage] BlockStatement
src/ui/ContextMenu.js:15:46
     if (child.config.closeable !== false) {
       this.addOption('Close Tab', () => child.destroy())
     }
-    this.addOption('Close Other Tabs', () => {
-      const toClose = stack.children.filter(c => c.id !== child.id && c.config.closeable !== false)
-      toClose.forEach(c => c.destroy())
-    })
+    this.addOption('Close Other Tabs', () => {})
     this.addOption('Close All Tabs', () => {
       const toClose = stack.children.filter(c => c.config.closeable !== false)

[NoCoverage] LogicalOperator
src/ui/ContextMenu.js:16:50
       this.addOption('Close Tab', () => child.destroy())
     }
     this.addOption('Close Other Tabs', () => {
-      const toClose = stack.children.filter(c => c.id !== child.id && c.config.closeable !== false)
+      const toClose = stack.children.filter(c => c.id !== child.id || c.config.closeable !== false)
       toClose.forEach(c => c.destroy())
     })

[NoCoverage] ConditionalExpression
src/ui/ContextMenu.js:16:50
       this.addOption('Close Tab', () => child.destroy())
     }
     this.addOption('Close Other Tabs', () => {
-      const toClose = stack.children.filter(c => c.id !== child.id && c.config.closeable !== false)
+      const toClose = stack.children.filter(c => true)
       toClose.forEach(c => c.destroy())
     })

[NoCoverage] ArrowFunction
src/ui/ContextMenu.js:17:23
     }
     this.addOption('Close Other Tabs', () => {
       const toClose = stack.children.filter(c => c.id !== child.id && c.config.closeable !== false)
-      toClose.forEach(c => c.destroy())
+      toClose.forEach(() => undefined)
     })
     this.addOption('Close All Tabs', () => {

[Killed] BlockStatement
src/ui/ContextMenu.js:19:44
       const toClose = stack.children.filter(c => c.id !== child.id && c.config.closeable !== false)
       toClose.forEach(c => c.destroy())
     })
-    this.addOption('Close All Tabs', () => {
-      const toClose = stack.children.filter(c => c.config.closeable !== false)
-      toClose.forEach(c => c.destroy())
-      if (stack.children.length === 0) {
-        stack.layoutManager._cleanupEmptyStack(stack)
-      }
-    })
+    this.addOption('Close All Tabs', () => {})
 
     // Popout option (only when enabled)
killedBy: ContextMenu Component Tests Close All Tabs option cleans up the stack if empty
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
src/ui/ContextMenu.js:20:50
       toClose.forEach(c => c.destroy())
     })
     this.addOption('Close All Tabs', () => {
-      const toClose = stack.children.filter(c => c.config.closeable !== false)
+      const toClose = stack.children.filter(c => false)
       toClose.forEach(c => c.destroy())
       if (stack.children.length === 0) {
killedBy: ContextMenu Component Tests Close All Tabs option cleans up the stack if empty
statusReason: Error: expect(received).toBeNull()

[Killed] EqualityOperator
src/ui/ContextMenu.js:20:50
       toClose.forEach(c => c.destroy())
     })
     this.addOption('Close All Tabs', () => {
-      const toClose = stack.children.filter(c => c.config.closeable !== false)
+      const toClose = stack.children.filter(c => c.config.closeable === false)
       toClose.forEach(c => c.destroy())
       if (stack.children.length === 0) {
killedBy: ContextMenu Component Tests Close All Tabs option cleans up the stack if empty
statusReason: Error: expect(received).toBeNull()

[Killed] ArrowFunction
src/ui/ContextMenu.js:21:23
     })
     this.addOption('Close All Tabs', () => {
       const toClose = stack.children.filter(c => c.config.closeable !== false)
-      toClose.forEach(c => c.destroy())
+      toClose.forEach(() => undefined)
       if (stack.children.length === 0) {
         stack.layoutManager._cleanupEmptyStack(stack)
killedBy: ContextMenu Component Tests Close All Tabs option cleans up the stack if empty
statusReason: Error: expect(received).toBeNull()

[Killed] EqualityOperator
src/ui/ContextMenu.js:22:11
     this.addOption('Close All Tabs', () => {
       const toClose = stack.children.filter(c => c.config.closeable !== false)
       toClose.forEach(c => c.destroy())
-      if (stack.children.length === 0) {
+      if (stack.children.length !== 0) {
         stack.layoutManager._cleanupEmptyStack(stack)
       }
killedBy: ContextMenu Component Tests Close All Tabs option cleans up the stack if empty
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
src/ui/ContextMenu.js:22:11
     this.addOption('Close All Tabs', () => {
       const toClose = stack.children.filter(c => c.config.closeable !== false)
       toClose.forEach(c => c.destroy())
-      if (stack.children.length === 0) {
+      if (false) {
         stack.layoutManager._cleanupEmptyStack(stack)
       }
killedBy: ContextMenu Component Tests Close All Tabs option cleans up the stack if empty
statusReason: Error: expect(received).toBeNull()

[Killed] EqualityOperator
src/ui/ContextMenu.js:28:48
     })
 
     // Popout option (only when enabled)
-    if (layoutManager.settings.enablePopout && stack.displayPopoutButton !== false) {
+    if (layoutManager.settings.enablePopout && stack.displayPopoutButton === false) {
       this.addOption('Popout Stack', () => {
         layoutManager.popoutStack(stack)
killedBy: ContextMenu Component Tests ContextMenu displays correct options based on configuration
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Popout Stack"

[Killed] BooleanLiteral
src/ui/ContextMenu.js:28:78
     })
 
     // Popout option (only when enabled)
-    if (layoutManager.settings.enablePopout && stack.displayPopoutButton !== false) {
+    if (layoutManager.settings.enablePopout && stack.displayPopoutButton !== true) {
       this.addOption('Popout Stack', () => {
         layoutManager.popoutStack(stack)
killedBy: ContextMenu Component Tests ContextMenu displays correct options based on configuration
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Popout Stack"

[NoCoverage] BlockStatement
src/ui/ContextMenu.js:29:44
 
     // Popout option (only when enabled)
     if (layoutManager.settings.enablePopout && stack.displayPopoutButton !== false) {
-      this.addOption('Popout Stack', () => {
-        layoutManager.popoutStack(stack)
-      })
+      this.addOption('Popout Stack', () => {})
     }
 

[Killed] BlockStatement
src/ui/ContextMenu.js:37:29
     document.addEventListener('mousedown', this._closeHandler)
   }
 
-  addOption (text, onClick) {
-    const item = Utils.createElement('div', 'tulweb-context-item', this.element)
-    item.textContent = text
-    item.addEventListener('mousedown', (e) => e.stopPropagation())
-    item.addEventListener('click', (e) => {
-      e.stopPropagation()
-      onClick()
-      this.destroy()
-    })
-  }
+  addOption (text, onClick) {}
 
   _closeHandler (e) {
killedBy: ContextMenu Component Tests ContextMenu displays correct options based on configuration
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Close Tab"

[Killed] StringLiteral
src/ui/ContextMenu.js:38:45
   }
 
   addOption (text, onClick) {
-    const item = Utils.createElement('div', 'tulweb-context-item', this.element)
+    const item = Utils.createElement('div', "", this.element)
     item.textContent = text
     item.addEventListener('mousedown', (e) => e.stopPropagation())
killedBy: ContextMenu Component Tests clicking an option triggers action and destroys menu
statusReason: TypeError: Cannot read properties of undefined (reading 'click')

[Survived] ArrowFunction
src/ui/ContextMenu.js:40:40
   addOption (text, onClick) {
     const item = Utils.createElement('div', 'tulweb-context-item', this.element)
     item.textContent = text
-    item.addEventListener('mousedown', (e) => e.stopPropagation())
+    item.addEventListener('mousedown', () => undefined)
     item.addEventListener('click', (e) => {
       e.stopPropagation()

[Killed] BlockStatement
src/ui/ContextMenu.js:41:43
     const item = Utils.createElement('div', 'tulweb-context-item', this.element)
     item.textContent = text
     item.addEventListener('mousedown', (e) => e.stopPropagation())
-    item.addEventListener('click', (e) => {
-      e.stopPropagation()
-      onClick()
-      this.destroy()
-    })
+    item.addEventListener('click', (e) => {})
   }
 
killedBy: ContextMenu Component Tests clicking an option triggers action and destroys menu
statusReason: Error: expect(received).toBeNull()

[Killed] BlockStatement
src/ui/ContextMenu.js:48:21
     })
   }
 
-  _closeHandler (e) {
-    if (this.element && !this.element.contains(e.target)) {
-      this.destroy()
-    }
-  }
+  _closeHandler (e) {}
 
   destroy () {
killedBy: ContextMenu Component Tests clicking outside the menu closes it
statusReason: Error: expect(received).toBeNull()

Received: <div class="tulweb-context-menu" style="left: 0px; top: 0px;"><div class="tulweb-context-item">Close Tab</div><div class="tulweb-context-item">Close Other Tabs</div><div class="tulweb-context-item">Close All Tabs</div><div class="tulweb-context-item">Popout Stack</div></div>

[Killed] BlockStatement
src/ui/ContextMenu.js:49:59
   }
 
   _closeHandler (e) {
-    if (this.element && !this.element.contains(e.target)) {
-      this.destroy()
-    }
+    if (this.element && !this.element.contains(e.target)) {}
   }
 
killedBy: ContextMenu Component Tests clicking outside the menu closes it
statusReason: Error: expect(received).toBeNull()

Received: <div class="tulweb-context-menu" style="left: 0px; top: 0px;"><div class="tulweb-context-item">Close Tab</div><div class="tulweb-context-item">Close Other Tabs</div><div class="tulweb-context-item">Close All Tabs</div><div class="tulweb-context-item">Popout Stack</div></div>

[Killed] BooleanLiteral
src/ui/ContextMenu.js:49:25
   }
 
   _closeHandler (e) {
-    if (this.element && !this.element.contains(e.target)) {
+    if (this.element && this.element.contains(e.target)) {
       this.destroy()
     }
killedBy: ContextMenu Component Tests clicking outside the menu closes it
statusReason: Error: expect(received).toBeNull()

Received: <div class="tulweb-context-menu" style="left: 0px; top: 0px;"><div class="tulweb-context-item">Close Tab</div><div class="tulweb-context-item">Close Other Tabs</div><div class="tulweb-context-item">Close All Tabs</div><div class="tulweb-context-item">Popout Stack</div></div>

[Killed] BlockStatement
src/ui/ContextMenu.js:54:14
     }
   }
 
-  destroy () {
-    if (this._pendingListener) {
-      clearTimeout(this._pendingListener)
-    }
-    document.removeEventListener('mousedown', this._closeHandler)
-    if (this.element && this.element.parentElement) {
-      this.element.parentElement.removeChild(this.element)
-    }
-    if (this.layoutManager.contextMenu === this) {
-      this.layoutManager.contextMenu = null
-    }
-  }
+  destroy () {}
 }
 
killedBy: ContextMenu Component Tests ContextMenu displays correct options based on configuration
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "Close Tab"

[Survived] ConditionalExpression
src/ui/ContextMenu.js:55:9
   }
 
   destroy () {
-    if (this._pendingListener) {
+    if (true) {
       clearTimeout(this._pendingListener)
     }

[NoCoverage] BlockStatement
src/ui/ContextMenu.js:55:32
   }
 
   destroy () {
-    if (this._pendingListener) {
-      clearTimeout(this._pendingListener)
-    }
+    if (this._pendingListener) {}
     document.removeEventListener('mousedown', this._closeHandler)
     if (this.element && this.element.parentElement) {

[Killed] ConditionalExpression
src/ui/ContextMenu.js:59:9
       clearTimeout(this._pendingListener)
     }
     document.removeEventListener('mousedown', this._closeHandler)
-    if (this.element && this.element.parentElement) {
+    if (true) {
       this.element.parentElement.removeChild(this.element)
     }
killedBy: ContextMenu Component Tests clicking an option triggers action and destroys menu
statusReason: TypeError: Cannot read properties of null (reading 'removeChild')

[Killed] ConditionalExpression
src/ui/ContextMenu.js:59:9
       clearTimeout(this._pendingListener)
     }
     document.removeEventListener('mousedown', this._closeHandler)
-    if (this.element && this.element.parentElement) {
+    if (false) {
       this.element.parentElement.removeChild(this.element)
     }
killedBy: ContextMenu Component Tests ContextMenu displays correct options based on configuration
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "Close Tab"

[NoCoverage] BlockStatement
src/ui/ContextMenu.js:62:50
     if (this.element && this.element.parentElement) {
       this.element.parentElement.removeChild(this.element)
     }
-    if (this.layoutManager.contextMenu === this) {
-      this.layoutManager.contextMenu = null
-    }
+    if (this.layoutManager.contextMenu === this) {}
   }
 }

[Survived] ConditionalExpression
src/ui/ContextMenu.js:62:9
     if (this.element && this.element.parentElement) {
       this.element.parentElement.removeChild(this.element)
     }
-    if (this.layoutManager.contextMenu === this) {
+    if (true) {
       this.layoutManager.contextMenu = null
     }
