[Survived] BooleanLiteral
src/ui/Splitter.js:12:23
 
     this.element = Utils.createElement('div', 'tulweb-splitter', parentContainer)
 
-    this.isDragging = false
+    this.isDragging = true
     this._onMouseDown = this._onMouseDown.bind(this)
     this._onMouseMove = this._onMouseMove.bind(this)

[Survived] BooleanLiteral
src/ui/Splitter.js:19:79
     this._onDblClick = this._onDblClick.bind(this)
 
     this.element.addEventListener('mousedown', this._onMouseDown)
-    this.element.addEventListener('touchstart', this._onMouseDown, { passive: false })
+    this.element.addEventListener('touchstart', this._onMouseDown, { passive: true })
     this.element.addEventListener('dblclick', this._onDblClick)
 

[Survived] ObjectLiteral
src/ui/Splitter.js:19:68
     this._onDblClick = this._onDblClick.bind(this)
 
     this.element.addEventListener('mousedown', this._onMouseDown)
-    this.element.addEventListener('touchstart', this._onMouseDown, { passive: false })
+    this.element.addEventListener('touchstart', this._onMouseDown, {})
     this.element.addEventListener('dblclick', this._onDblClick)
 

[Killed] BlockStatement
src/ui/Splitter.js:26:53
     this.element.setAttribute('role', 'separator')
     this.element.setAttribute('tabindex', '0')
     this.element.setAttribute('aria-orientation', isVertical ? 'vertical' : 'horizontal')
-    this.element.addEventListener('keydown', (e) => {
-      if (e.altKey || e.ctrlKey || e.metaKey) return
-      const step = e.shiftKey ? 5 : 1
-      let diff = 0
-      if (isVertical) {
-        if (e.key === 'ArrowLeft') diff = -step
-        if (e.key === 'ArrowRight') diff = step
-      } else {
-        if (e.key === 'ArrowUp') diff = -step
-        if (e.key === 'ArrowDown') diff = step
-      }
-
-      if (diff !== 0) {
-        e.preventDefault()
-        this._moveSplitter(diff)
-      }
-    })
+    this.element.addEventListener('keydown', (e) => {})
   }
 
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.10000000000000142

[Killed] ConditionalExpression
src/ui/Splitter.js:27:11
     this.element.setAttribute('tabindex', '0')
     this.element.setAttribute('aria-orientation', isVertical ? 'vertical' : 'horizontal')
     this.element.addEventListener('keydown', (e) => {
-      if (e.altKey || e.ctrlKey || e.metaKey) return
+      if (true) return
       const step = e.shiftKey ? 5 : 1
       let diff = 0
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.10000000000000142

[Survived] ConditionalExpression
src/ui/Splitter.js:27:11
     this.element.setAttribute('tabindex', '0')
     this.element.setAttribute('aria-orientation', isVertical ? 'vertical' : 'horizontal')
     this.element.addEventListener('keydown', (e) => {
-      if (e.altKey || e.ctrlKey || e.metaKey) return
+      if (false) return
       const step = e.shiftKey ? 5 : 1
       let diff = 0

[Killed] ConditionalExpression
src/ui/Splitter.js:30:11
       if (e.altKey || e.ctrlKey || e.metaKey) return
       const step = e.shiftKey ? 5 : 1
       let diff = 0
-      if (isVertical) {
+      if (false) {
         if (e.key === 'ArrowLeft') diff = -step
         if (e.key === 'ArrowRight') diff = step
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.10000000000000142

[Killed] BlockStatement
src/ui/Splitter.js:30:23
       if (e.altKey || e.ctrlKey || e.metaKey) return
       const step = e.shiftKey ? 5 : 1
       let diff = 0
-      if (isVertical) {
-        if (e.key === 'ArrowLeft') diff = -step
-        if (e.key === 'ArrowRight') diff = step
-      } else {
+      if (isVertical) {} else {
         if (e.key === 'ArrowUp') diff = -step
         if (e.key === 'ArrowDown') diff = step
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.10000000000000142

[Survived] EqualityOperator
src/ui/Splitter.js:31:13
       const step = e.shiftKey ? 5 : 1
       let diff = 0
       if (isVertical) {
-        if (e.key === 'ArrowLeft') diff = -step
+        if (e.key !== 'ArrowLeft') diff = -step
         if (e.key === 'ArrowRight') diff = step
       } else {

[Survived] ConditionalExpression
src/ui/Splitter.js:31:13
       const step = e.shiftKey ? 5 : 1
       let diff = 0
       if (isVertical) {
-        if (e.key === 'ArrowLeft') diff = -step
+        if (true) diff = -step
         if (e.key === 'ArrowRight') diff = step
       } else {

[Killed] EqualityOperator
src/ui/Splitter.js:32:13
       let diff = 0
       if (isVertical) {
         if (e.key === 'ArrowLeft') diff = -step
-        if (e.key === 'ArrowRight') diff = step
+        if (e.key !== 'ArrowRight') diff = step
       } else {
         if (e.key === 'ArrowUp') diff = -step
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.10000000000000142

[Killed] ConditionalExpression
src/ui/Splitter.js:32:13
       let diff = 0
       if (isVertical) {
         if (e.key === 'ArrowLeft') diff = -step
-        if (e.key === 'ArrowRight') diff = step
+        if (false) diff = step
       } else {
         if (e.key === 'ArrowUp') diff = -step
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.10000000000000142

[NoCoverage] BlockStatement
src/ui/Splitter.js:33:14
       if (isVertical) {
         if (e.key === 'ArrowLeft') diff = -step
         if (e.key === 'ArrowRight') diff = step
-      } else {
-        if (e.key === 'ArrowUp') diff = -step
-        if (e.key === 'ArrowDown') diff = step
-      }
+      } else {}
 
       if (diff !== 0) {

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:34:13
         if (e.key === 'ArrowLeft') diff = -step
         if (e.key === 'ArrowRight') diff = step
       } else {
-        if (e.key === 'ArrowUp') diff = -step
+        if (false) diff = -step
         if (e.key === 'ArrowDown') diff = step
       }

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:34:13
         if (e.key === 'ArrowLeft') diff = -step
         if (e.key === 'ArrowRight') diff = step
       } else {
-        if (e.key === 'ArrowUp') diff = -step
+        if (true) diff = -step
         if (e.key === 'ArrowDown') diff = step
       }

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:35:13
         if (e.key === 'ArrowRight') diff = step
       } else {
         if (e.key === 'ArrowUp') diff = -step
-        if (e.key === 'ArrowDown') diff = step
+        if (true) diff = step
       }
 

[NoCoverage] EqualityOperator
src/ui/Splitter.js:35:13
         if (e.key === 'ArrowRight') diff = step
       } else {
         if (e.key === 'ArrowUp') diff = -step
-        if (e.key === 'ArrowDown') diff = step
+        if (e.key !== 'ArrowDown') diff = step
       }
 

[Killed] EqualityOperator
src/ui/Splitter.js:38:11
         if (e.key === 'ArrowDown') diff = step
       }
 
-      if (diff !== 0) {
+      if (diff === 0) {
         e.preventDefault()
         this._moveSplitter(diff)
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.10000000000000142

[Killed] ConditionalExpression
src/ui/Splitter.js:38:11
         if (e.key === 'ArrowDown') diff = step
       }
 
-      if (diff !== 0) {
+      if (false) {
         e.preventDefault()
         this._moveSplitter(diff)
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.10000000000000142

[Killed] BlockStatement
src/ui/Splitter.js:53:30
     let fixedSpace = 0
     let totalWeight = 0
 
-    siblings.forEach(item => {
-      if (typeof item.size === 'number') {
-        totalWeight += item.size
-      } else {
-        fixedSpace += this.isVertical ? item.element.offsetWidth : item.element.offsetHeight
-      }
-    })
+    siblings.forEach(item => {})
 
     const availableSpace = Math.max(0, totalSize - fixedSpace)
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 51

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.8999999999999986

[Killed] EqualityOperator
src/ui/Splitter.js:54:11
     let totalWeight = 0
 
     siblings.forEach(item => {
-      if (typeof item.size === 'number') {
+      if (typeof item.size !== 'number') {
         totalWeight += item.size
       } else {
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 51

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.8999999999999986

[Killed] BlockStatement
src/ui/Splitter.js:54:42
     let totalWeight = 0
 
     siblings.forEach(item => {
-      if (typeof item.size === 'number') {
-        totalWeight += item.size
-      } else {
+      if (typeof item.size === 'number') {} else {
         fixedSpace += this.isVertical ? item.element.offsetWidth : item.element.offsetHeight
       }
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 51

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.8999999999999986

[Killed] AssignmentOperator
src/ui/Splitter.js:55:9
 
     siblings.forEach(item => {
       if (typeof item.size === 'number') {
-        totalWeight += item.size
+        totalWeight -= item.size
       } else {
         fixedSpace += this.isVertical ? item.element.offsetWidth : item.element.offsetHeight
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 51

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.8999999999999986

[NoCoverage] BlockStatement
src/ui/Splitter.js:56:14
     siblings.forEach(item => {
       if (typeof item.size === 'number') {
         totalWeight += item.size
-      } else {
-        fixedSpace += this.isVertical ? item.element.offsetWidth : item.element.offsetHeight
-      }
+      } else {}
     })
 

[NoCoverage] AssignmentOperator
src/ui/Splitter.js:57:9
       if (typeof item.size === 'number') {
         totalWeight += item.size
       } else {
-        fixedSpace += this.isVertical ? item.element.offsetWidth : item.element.offsetHeight
+        fixedSpace -= this.isVertical ? item.element.offsetWidth : item.element.offsetHeight
       }
     })

[Killed] MethodExpression
src/ui/Splitter.js:61:28
       }
     })
 
-    const availableSpace = Math.max(0, totalSize - fixedSpace)
+    const availableSpace = Math.min(0, totalSize - fixedSpace)
     const pixelsPerPercent = totalWeight > 0 ? (availableSpace / totalWeight) : 1
 
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: Infinity

Expected precision:    2
Expected difference: < 0.005
Received difference:   Infinity

[Survived] ArithmeticOperator
src/ui/Splitter.js:61:40
       }
     })
 
-    const availableSpace = Math.max(0, totalSize - fixedSpace)
+    const availableSpace = Math.max(0, totalSize + fixedSpace)
     const pixelsPerPercent = totalWeight > 0 ? (availableSpace / totalWeight) : 1
 

[Killed] EqualityOperator
src/ui/Splitter.js:62:30
     })
 
     const availableSpace = Math.max(0, totalSize - fixedSpace)
-    const pixelsPerPercent = totalWeight > 0 ? (availableSpace / totalWeight) : 1
+    const pixelsPerPercent = totalWeight <= 0 ? (availableSpace / totalWeight) : 1
 
     const startPrevSize = this.prevItem.size ?? 50
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 51

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.8999999999999986

[Killed] ArithmeticOperator
src/ui/Splitter.js:62:49
     })
 
     const availableSpace = Math.max(0, totalSize - fixedSpace)
-    const pixelsPerPercent = totalWeight > 0 ? (availableSpace / totalWeight) : 1
+    const pixelsPerPercent = totalWeight > 0 ? (availableSpace * totalWeight) : 1
 
     const startPrevSize = this.prevItem.size ?? 50
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50.00001

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.09998999999999825

[Survived] LogicalOperator
src/ui/Splitter.js:64:27
     const availableSpace = Math.max(0, totalSize - fixedSpace)
     const pixelsPerPercent = totalWeight > 0 ? (availableSpace / totalWeight) : 1
 
-    const startPrevSize = this.prevItem.size ?? 50
+    const startPrevSize = this.prevItem.size && 50
     const startNextSize = this.nextItem.size ?? 50
     const prevType = typeof startPrevSize === 'number' ? 'weight' : 'fixed'

[Survived] LogicalOperator
src/ui/Splitter.js:65:27
     const pixelsPerPercent = totalWeight > 0 ? (availableSpace / totalWeight) : 1
 
     const startPrevSize = this.prevItem.size ?? 50
-    const startNextSize = this.nextItem.size ?? 50
+    const startNextSize = this.nextItem.size && 50
     const prevType = typeof startPrevSize === 'number' ? 'weight' : 'fixed'
     const nextType = typeof startNextSize === 'number' ? 'weight' : 'fixed'

[Killed] EqualityOperator
src/ui/Splitter.js:66:22
 
     const startPrevSize = this.prevItem.size ?? 50
     const startNextSize = this.nextItem.size ?? 50
-    const prevType = typeof startPrevSize === 'number' ? 'weight' : 'fixed'
+    const prevType = typeof startPrevSize !== 'number' ? 'weight' : 'fixed'
     const nextType = typeof startNextSize === 'number' ? 'weight' : 'fixed'
 
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has type:  string
Received has value: "51weight"

[Killed] ConditionalExpression
src/ui/Splitter.js:66:22
 
     const startPrevSize = this.prevItem.size ?? 50
     const startNextSize = this.nextItem.size ?? 50
-    const prevType = typeof startPrevSize === 'number' ? 'weight' : 'fixed'
+    const prevType = false ? 'weight' : 'fixed'
     const nextType = typeof startNextSize === 'number' ? 'weight' : 'fixed'
 
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has type:  string
Received has value: "51weight"

[Killed] ConditionalExpression
src/ui/Splitter.js:67:22
     const startPrevSize = this.prevItem.size ?? 50
     const startNextSize = this.nextItem.size ?? 50
     const prevType = typeof startPrevSize === 'number' ? 'weight' : 'fixed'
-    const nextType = typeof startNextSize === 'number' ? 'weight' : 'fixed'
+    const nextType = false ? 'weight' : 'fixed'
 
     if (prevType === 'weight' && nextType === 'weight') {
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.10000000000000142

[Killed] EqualityOperator
src/ui/Splitter.js:67:22
     const startPrevSize = this.prevItem.size ?? 50
     const startNextSize = this.nextItem.size ?? 50
     const prevType = typeof startPrevSize === 'number' ? 'weight' : 'fixed'
-    const nextType = typeof startNextSize === 'number' ? 'weight' : 'fixed'
+    const nextType = typeof startNextSize !== 'number' ? 'weight' : 'fixed'
 
     if (prevType === 'weight' && nextType === 'weight') {
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.10000000000000142

[Killed] EqualityOperator
src/ui/Splitter.js:69:9
     const prevType = typeof startPrevSize === 'number' ? 'weight' : 'fixed'
     const nextType = typeof startNextSize === 'number' ? 'weight' : 'fixed'
 
-    if (prevType === 'weight' && nextType === 'weight') {
+    if (prevType !== 'weight' && nextType === 'weight') {
       const diffPct = diffPx / pixelsPerPercent
       const newPrev = startPrevSize + diffPct
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.10000000000000142

[Killed] ConditionalExpression
src/ui/Splitter.js:69:9
     const prevType = typeof startPrevSize === 'number' ? 'weight' : 'fixed'
     const nextType = typeof startNextSize === 'number' ? 'weight' : 'fixed'
 
-    if (prevType === 'weight' && nextType === 'weight') {
+    if (false) {
       const diffPct = diffPx / pixelsPerPercent
       const newPrev = startPrevSize + diffPct
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.10000000000000142

[Killed] ArithmeticOperator
src/ui/Splitter.js:70:23
     const nextType = typeof startNextSize === 'number' ? 'weight' : 'fixed'
 
     if (prevType === 'weight' && nextType === 'weight') {
-      const diffPct = diffPx / pixelsPerPercent
+      const diffPct = diffPx * pixelsPerPercent
       const newPrev = startPrevSize + diffPct
       const newNext = startNextSize - diffPct
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 60

Expected precision:    2
Expected difference: < 0.005
Received difference:   9.899999999999999

[Killed] ArithmeticOperator
src/ui/Splitter.js:71:23
 
     if (prevType === 'weight' && nextType === 'weight') {
       const diffPct = diffPx / pixelsPerPercent
-      const newPrev = startPrevSize + diffPct
+      const newPrev = startPrevSize - diffPct
       const newNext = startNextSize - diffPct
       // Apply bounds (simplified for keyboard)
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 50.1
Received: 49.9

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.20000000000000284

[Killed] ArithmeticOperator
src/ui/Splitter.js:72:23
     if (prevType === 'weight' && nextType === 'weight') {
       const diffPct = diffPx / pixelsPerPercent
       const newPrev = startPrevSize + diffPct
-      const newNext = startNextSize - diffPct
+      const newNext = startNextSize + diffPct
       // Apply bounds (simplified for keyboard)
       this.prevItem.size = newPrev
killedBy: Splitter Component Tests Keyboard accessibility (Arrow keys) moves splitter
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 49.9
Received: 50.1

Expected precision:    2
Expected difference: < 0.005
Received difference:   0.20000000000000284

[NoCoverage] BlockStatement
src/ui/Splitter.js:76:12
       // Apply bounds (simplified for keyboard)
       this.prevItem.size = newPrev
       this.nextItem.size = newNext
-    } else {
-      // Simplified fixed resize for keyboard
-      if (prevType === 'fixed') {
-        const parsed = Utils.parseSize(startPrevSize)
-        this.prevItem.size = (parsed.value + diffPx) + parsed.unit
-      }
-      if (nextType === 'fixed') {
-        const parsed = Utils.parseSize(startNextSize)
-        this.nextItem.size = (parsed.value - diffPx) + parsed.unit
-      }
-    }
+    } else {}
     this.prevItem.updateFlex()
     this.nextItem.updateFlex()

[NoCoverage] BlockStatement
src/ui/Splitter.js:78:33
       this.nextItem.size = newNext
     } else {
       // Simplified fixed resize for keyboard
-      if (prevType === 'fixed') {
-        const parsed = Utils.parseSize(startPrevSize)
-        this.prevItem.size = (parsed.value + diffPx) + parsed.unit
-      }
+      if (prevType === 'fixed') {}
       if (nextType === 'fixed') {
         const parsed = Utils.parseSize(startNextSize)

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:78:11
       this.nextItem.size = newNext
     } else {
       // Simplified fixed resize for keyboard
-      if (prevType === 'fixed') {
+      if (false) {
         const parsed = Utils.parseSize(startPrevSize)
         this.prevItem.size = (parsed.value + diffPx) + parsed.unit

[NoCoverage] ArithmeticOperator
src/ui/Splitter.js:80:31
       // Simplified fixed resize for keyboard
       if (prevType === 'fixed') {
         const parsed = Utils.parseSize(startPrevSize)
-        this.prevItem.size = (parsed.value + diffPx) + parsed.unit
+        this.prevItem.size = (parsed.value - diffPx) + parsed.unit
       }
       if (nextType === 'fixed') {

[NoCoverage] ArithmeticOperator
src/ui/Splitter.js:80:30
       // Simplified fixed resize for keyboard
       if (prevType === 'fixed') {
         const parsed = Utils.parseSize(startPrevSize)
-        this.prevItem.size = (parsed.value + diffPx) + parsed.unit
+        this.prevItem.size = parsed.value + diffPx - parsed.unit
       }
       if (nextType === 'fixed') {

[NoCoverage] EqualityOperator
src/ui/Splitter.js:82:11
         const parsed = Utils.parseSize(startPrevSize)
         this.prevItem.size = (parsed.value + diffPx) + parsed.unit
       }
-      if (nextType === 'fixed') {
+      if (nextType !== 'fixed') {
         const parsed = Utils.parseSize(startNextSize)
         this.nextItem.size = (parsed.value - diffPx) + parsed.unit

[NoCoverage] BlockStatement
src/ui/Splitter.js:82:33
         const parsed = Utils.parseSize(startPrevSize)
         this.prevItem.size = (parsed.value + diffPx) + parsed.unit
       }
-      if (nextType === 'fixed') {
-        const parsed = Utils.parseSize(startNextSize)
-        this.nextItem.size = (parsed.value - diffPx) + parsed.unit
-      }
+      if (nextType === 'fixed') {}
     }
     this.prevItem.updateFlex()

[NoCoverage] ArithmeticOperator
src/ui/Splitter.js:84:30
       }
       if (nextType === 'fixed') {
         const parsed = Utils.parseSize(startNextSize)
-        this.nextItem.size = (parsed.value - diffPx) + parsed.unit
+        this.nextItem.size = parsed.value - diffPx - parsed.unit
       }
     }

[NoCoverage] ArithmeticOperator
src/ui/Splitter.js:84:31
       }
       if (nextType === 'fixed') {
         const parsed = Utils.parseSize(startNextSize)
-        this.nextItem.size = (parsed.value - diffPx) + parsed.unit
+        this.nextItem.size = (parsed.value + diffPx) + parsed.unit
       }
     }

[Killed] BlockStatement
src/ui/Splitter.js:91:19
     this.nextItem.updateFlex()
   }
 
-  _onDblClick (e) {
-    e.preventDefault()
-    this.prevItem.size = 50
-    this.nextItem.size = 50
-    if (this.parentContainer.tulwebItem) {
-      this.parentContainer.tulwebItem.updateLayout()
-    } else {
-      this.prevItem.updateFlex()
-      this.nextItem.updateFlex()
-    }
-  }
+  _onDblClick (e) {}
 
   _onMouseDown (e) {
killedBy: Splitter Component Tests Splitter double click resets sizes to 50/50
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 20

[Killed] ConditionalExpression
src/ui/Splitter.js:95:9
     e.preventDefault()
     this.prevItem.size = 50
     this.nextItem.size = 50
-    if (this.parentContainer.tulwebItem) {
+    if (true) {
       this.parentContainer.tulwebItem.updateLayout()
     } else {
killedBy: Splitter Component Tests Splitter double click resets sizes to 50/50
statusReason: TypeError: Cannot read properties of undefined (reading 'updateLayout')

[NoCoverage] BlockStatement
src/ui/Splitter.js:95:42
     e.preventDefault()
     this.prevItem.size = 50
     this.nextItem.size = 50
-    if (this.parentContainer.tulwebItem) {
-      this.parentContainer.tulwebItem.updateLayout()
-    } else {
+    if (this.parentContainer.tulwebItem) {} else {
       this.prevItem.updateFlex()
       this.nextItem.updateFlex()

[Killed] BlockStatement
src/ui/Splitter.js:97:12
     this.nextItem.size = 50
     if (this.parentContainer.tulwebItem) {
       this.parentContainer.tulwebItem.updateLayout()
-    } else {
-      this.prevItem.updateFlex()
-      this.nextItem.updateFlex()
-    }
+    } else {}
   }
 
killedBy: Splitter Component Tests Splitter double click resets sizes to 50/50
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
src/ui/Splitter.js:104:9
   }
 
   _onMouseDown (e) {
-    if (e.type !== 'touchstart') e.preventDefault()
+    if (false) e.preventDefault()
 
     const isTouch = e.touches && e.touches.length > 0

[Survived] EqualityOperator
src/ui/Splitter.js:104:9
   }
 
   _onMouseDown (e) {
-    if (e.type !== 'touchstart') e.preventDefault()
+    if (e.type === 'touchstart') e.preventDefault()
 
     const isTouch = e.touches && e.touches.length > 0

[Killed] ConditionalExpression
src/ui/Splitter.js:106:21
   _onMouseDown (e) {
     if (e.type !== 'touchstart') e.preventDefault()
 
-    const isTouch = e.touches && e.touches.length > 0
+    const isTouch = true
     const clientX = isTouch ? e.touches[0].clientX : e.clientX
     const clientY = isTouch ? e.touches[0].clientY : e.clientY
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] LogicalOperator
src/ui/Splitter.js:106:21
   _onMouseDown (e) {
     if (e.type !== 'touchstart') e.preventDefault()
 
-    const isTouch = e.touches && e.touches.length > 0
+    const isTouch = e.touches || e.touches.length > 0
     const clientX = isTouch ? e.touches[0].clientX : e.clientX
     const clientY = isTouch ? e.touches[0].clientY : e.clientY
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
src/ui/Splitter.js:110:23
     const clientX = isTouch ? e.touches[0].clientX : e.clientX
     const clientY = isTouch ? e.touches[0].clientY : e.clientY
 
-    this.isDragging = true
+    this.isDragging = false
     this.element.classList.add('active')
 
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[Survived] LogicalOperator
src/ui/Splitter.js:115:26
 
     // Calculate base metrics
     this.startPos = this.isVertical ? clientX : clientY
-    this.startPrevSize = this.prevItem.size ?? 50
+    this.startPrevSize = this.prevItem.size && 50
     this.startNextSize = this.nextItem.size ?? 50
 

[Survived] LogicalOperator
src/ui/Splitter.js:116:26
     // Calculate base metrics
     this.startPos = this.isVertical ? clientX : clientY
     this.startPrevSize = this.prevItem.size ?? 50
-    this.startNextSize = this.nextItem.size ?? 50
+    this.startNextSize = this.nextItem.size && 50
 
     this.prevType = typeof this.startPrevSize === 'number' ? 'weight' : 'fixed'

[Killed] ConditionalExpression
src/ui/Splitter.js:118:21
     this.startPrevSize = this.prevItem.size ?? 50
     this.startNextSize = this.nextItem.size ?? 50
 
-    this.prevType = typeof this.startPrevSize === 'number' ? 'weight' : 'fixed'
+    this.prevType = false ? 'weight' : 'fixed'
     this.nextType = typeof this.startNextSize === 'number' ? 'weight' : 'fixed'
 
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has type:  string
Received has value: "100px"
