[Killed] EqualityOperator
src/ui/Splitter.js:118:21
     this.startPrevSize = this.prevItem.size ?? 50
     this.startNextSize = this.nextItem.size ?? 50
 
-    this.prevType = typeof this.startPrevSize === 'number' ? 'weight' : 'fixed'
+    this.prevType = typeof this.startPrevSize !== 'number' ? 'weight' : 'fixed'
     this.nextType = typeof this.startNextSize === 'number' ? 'weight' : 'fixed'
 
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has type:  string
Received has value: "100px"

[Killed] EqualityOperator
src/ui/Splitter.js:119:21
     this.startNextSize = this.nextItem.size ?? 50
 
     this.prevType = typeof this.startPrevSize === 'number' ? 'weight' : 'fixed'
-    this.nextType = typeof this.startNextSize === 'number' ? 'weight' : 'fixed'
+    this.nextType = typeof this.startNextSize !== 'number' ? 'weight' : 'fixed'
 
     // Get pixels to percentage ratio for weights, accounting for fixed-size siblings
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[Killed] ConditionalExpression
src/ui/Splitter.js:119:21
     this.startNextSize = this.nextItem.size ?? 50
 
     this.prevType = typeof this.startPrevSize === 'number' ? 'weight' : 'fixed'
-    this.nextType = typeof this.startNextSize === 'number' ? 'weight' : 'fixed'
+    this.nextType = false ? 'weight' : 'fixed'
 
     // Get pixels to percentage ratio for weights, accounting for fixed-size siblings
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[Killed] ArithmeticOperator
src/ui/Splitter.js:138:48
     })
 
     const availableSpace = Math.max(0, totalSize - fixedSpace)
-    this.pixelsPerPercent = totalWeight > 0 ? (availableSpace / totalWeight) : 1
+    this.pixelsPerPercent = totalWeight > 0 ? (availableSpace * totalWeight) : 1
 
     document.addEventListener('mousemove', this._onMouseMove)
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50.001

Expected precision:    2
Expected difference: < 0.005
Received difference:   9.999000000000002

[Survived] ConditionalExpression
src/ui/Splitter.js:138:29
     })
 
     const availableSpace = Math.max(0, totalSize - fixedSpace)
-    this.pixelsPerPercent = totalWeight > 0 ? (availableSpace / totalWeight) : 1
+    this.pixelsPerPercent = true ? (availableSpace / totalWeight) : 1
 
     document.addEventListener('mousemove', this._onMouseMove)

[Killed] StringLiteral
src/ui/Splitter.js:140:31
     const availableSpace = Math.max(0, totalSize - fixedSpace)
     this.pixelsPerPercent = totalWeight > 0 ? (availableSpace / totalWeight) : 1
 
-    document.addEventListener('mousemove', this._onMouseMove)
+    document.addEventListener("", this._onMouseMove)
     document.addEventListener('mouseup', this._onMouseUp)
     document.addEventListener('touchmove', this._onMouseMove, { passive: false })
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[Survived] BooleanLiteral
src/ui/Splitter.js:142:74
 
     document.addEventListener('mousemove', this._onMouseMove)
     document.addEventListener('mouseup', this._onMouseUp)
-    document.addEventListener('touchmove', this._onMouseMove, { passive: false })
+    document.addEventListener('touchmove', this._onMouseMove, { passive: true })
     document.addEventListener('touchend', this._onMouseUp)
   }

[Killed] BlockStatement
src/ui/Splitter.js:146:20
     document.addEventListener('touchend', this._onMouseUp)
   }
 
-  _onMouseMove (e) {
-    if (!this.isDragging) return
-    if (this._rafPending) {
-      this._lastMoveEvent = e
-      return
-    }
-    this._rafPending = true
-    this._lastMoveEvent = e
-    requestAnimationFrame(() => {
-      this._rafPending = false
-      this._applyResize(this._lastMoveEvent)
-    })
-  }
+  _onMouseMove (e) {}
 
   _applyResize (e) {
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[Killed] BooleanLiteral
src/ui/Splitter.js:147:9
   }
 
   _onMouseMove (e) {
-    if (!this.isDragging) return
+    if (this.isDragging) return
     if (this._rafPending) {
       this._lastMoveEvent = e
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[Killed] ConditionalExpression
src/ui/Splitter.js:147:9
   }
 
   _onMouseMove (e) {
-    if (!this.isDragging) return
+    if (true) return
     if (this._rafPending) {
       this._lastMoveEvent = e
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[Killed] ConditionalExpression
src/ui/Splitter.js:148:9
 
   _onMouseMove (e) {
     if (!this.isDragging) return
-    if (this._rafPending) {
+    if (true) {
       this._lastMoveEvent = e
       return
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[NoCoverage] BlockStatement
src/ui/Splitter.js:148:27
 
   _onMouseMove (e) {
     if (!this.isDragging) return
-    if (this._rafPending) {
-      this._lastMoveEvent = e
-      return
-    }
+    if (this._rafPending) {}
     this._rafPending = true
     this._lastMoveEvent = e

[Survived] BooleanLiteral
src/ui/Splitter.js:152:24
       this._lastMoveEvent = e
       return
     }
-    this._rafPending = true
+    this._rafPending = false
     this._lastMoveEvent = e
     requestAnimationFrame(() => {

[Killed] BlockStatement
src/ui/Splitter.js:154:33
     }
     this._rafPending = true
     this._lastMoveEvent = e
-    requestAnimationFrame(() => {
-      this._rafPending = false
-      this._applyResize(this._lastMoveEvent)
-    })
+    requestAnimationFrame(() => {})
   }
 
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[Survived] BooleanLiteral
src/ui/Splitter.js:155:26
     this._rafPending = true
     this._lastMoveEvent = e
     requestAnimationFrame(() => {
-      this._rafPending = false
+      this._rafPending = true
       this._applyResize(this._lastMoveEvent)
     })

[Killed] BooleanLiteral
src/ui/Splitter.js:161:9
   }
 
   _applyResize (e) {
-    if (!this.isDragging) return
+    if (this.isDragging) return
     const isTouch = e.touches && e.touches.length > 0
     const clientX = isTouch ? e.touches[0].clientX : e.clientX
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[Killed] ConditionalExpression
src/ui/Splitter.js:161:9
   }
 
   _applyResize (e) {
-    if (!this.isDragging) return
+    if (true) return
     const isTouch = e.touches && e.touches.length > 0
     const clientX = isTouch ? e.touches[0].clientX : e.clientX
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[Killed] LogicalOperator
src/ui/Splitter.js:162:21
 
   _applyResize (e) {
     if (!this.isDragging) return
-    const isTouch = e.touches && e.touches.length > 0
+    const isTouch = e.touches || e.touches.length > 0
     const clientX = isTouch ? e.touches[0].clientX : e.clientX
     const clientY = isTouch ? e.touches[0].clientY : e.clientY
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/ui/Splitter.js:162:21
 
   _applyResize (e) {
     if (!this.isDragging) return
-    const isTouch = e.touches && e.touches.length > 0
+    const isTouch = true
     const clientX = isTouch ? e.touches[0].clientX : e.clientX
     const clientY = isTouch ? e.touches[0].clientY : e.clientY
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] ConditionalExpression
src/ui/Splitter.js:166:9
     const clientX = isTouch ? e.touches[0].clientX : e.clientX
     const clientY = isTouch ? e.touches[0].clientY : e.clientY
 
-    if (isTouch) e.preventDefault() // Prevent scrolling during resize
+    if (false) e.preventDefault() // Prevent scrolling during resize
 
     const currentPos = this.isVertical ? clientX : clientY

[Survived] ConditionalExpression
src/ui/Splitter.js:166:9
     const clientX = isTouch ? e.touches[0].clientX : e.clientX
     const clientY = isTouch ? e.touches[0].clientY : e.clientY
 
-    if (isTouch) e.preventDefault() // Prevent scrolling during resize
+    if (true) e.preventDefault() // Prevent scrolling during resize
 
     const currentPos = this.isVertical ? clientX : clientY

[Killed] ArithmeticOperator
src/ui/Splitter.js:169:20
     if (isTouch) e.preventDefault() // Prevent scrolling during resize
 
     const currentPos = this.isVertical ? clientX : clientY
-    const diffPx = currentPos - this.startPos
+    const diffPx = currentPos + this.startPos
 
     const minPrevPx = this.isVertical ? (this.prevItem.getMinWidthPx() || 40) : (this.prevItem.getMinHeightPx() || 40)
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 96

Expected precision:    2
Expected difference: < 0.005
Received difference:   36

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:171:82
     const currentPos = this.isVertical ? clientX : clientY
     const diffPx = currentPos - this.startPos
 
-    const minPrevPx = this.isVertical ? (this.prevItem.getMinWidthPx() || 40) : (this.prevItem.getMinHeightPx() || 40)
+    const minPrevPx = this.isVertical ? (this.prevItem.getMinWidthPx() || 40) : (false)
     const minNextPx = this.isVertical ? (this.nextItem.getMinWidthPx() || 40) : (this.nextItem.getMinHeightPx() || 40)
 

[Survived] LogicalOperator
src/ui/Splitter.js:171:42
     const currentPos = this.isVertical ? clientX : clientY
     const diffPx = currentPos - this.startPos
 
-    const minPrevPx = this.isVertical ? (this.prevItem.getMinWidthPx() || 40) : (this.prevItem.getMinHeightPx() || 40)
+    const minPrevPx = this.isVertical ? (this.prevItem.getMinWidthPx() && 40) : (this.prevItem.getMinHeightPx() || 40)
     const minNextPx = this.isVertical ? (this.nextItem.getMinWidthPx() || 40) : (this.nextItem.getMinHeightPx() || 40)
 

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:172:82
     const diffPx = currentPos - this.startPos
 
     const minPrevPx = this.isVertical ? (this.prevItem.getMinWidthPx() || 40) : (this.prevItem.getMinHeightPx() || 40)
-    const minNextPx = this.isVertical ? (this.nextItem.getMinWidthPx() || 40) : (this.nextItem.getMinHeightPx() || 40)
+    const minNextPx = this.isVertical ? (this.nextItem.getMinWidthPx() || 40) : (true)
 
     if (this.prevType === 'weight' && this.nextType === 'weight') {

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:172:82
     const diffPx = currentPos - this.startPos
 
     const minPrevPx = this.isVertical ? (this.prevItem.getMinWidthPx() || 40) : (this.prevItem.getMinHeightPx() || 40)
-    const minNextPx = this.isVertical ? (this.nextItem.getMinWidthPx() || 40) : (this.nextItem.getMinHeightPx() || 40)
+    const minNextPx = this.isVertical ? (this.nextItem.getMinWidthPx() || 40) : (false)
 
     if (this.prevType === 'weight' && this.nextType === 'weight') {

[Killed] ConditionalExpression
src/ui/Splitter.js:174:9
     const minPrevPx = this.isVertical ? (this.prevItem.getMinWidthPx() || 40) : (this.prevItem.getMinHeightPx() || 40)
     const minNextPx = this.isVertical ? (this.nextItem.getMinWidthPx() || 40) : (this.nextItem.getMinHeightPx() || 40)
 
-    if (this.prevType === 'weight' && this.nextType === 'weight') {
+    if (false) {
       const diffPct = diffPx / this.pixelsPerPercent
       let newPrev = this.startPrevSize + diffPct
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[Killed] BlockStatement
src/ui/Splitter.js:174:67
     const minPrevPx = this.isVertical ? (this.prevItem.getMinWidthPx() || 40) : (this.prevItem.getMinHeightPx() || 40)
     const minNextPx = this.isVertical ? (this.nextItem.getMinWidthPx() || 40) : (this.nextItem.getMinHeightPx() || 40)
 
-    if (this.prevType === 'weight' && this.nextType === 'weight') {
-      const diffPct = diffPx / this.pixelsPerPercent
-      let newPrev = this.startPrevSize + diffPct
-      let newNext = this.startNextSize - diffPct
-
-      const totalWeight = this.startPrevSize + this.startNextSize
-      const minPrevWeight = minPrevPx / this.pixelsPerPercent
-      const minNextWeight = minNextPx / this.pixelsPerPercent
-
-      if (newPrev < minPrevWeight) {
-        newPrev = minPrevWeight
-        newNext = totalWeight - minPrevWeight
-      } else if (newNext < minNextWeight) {
-        newNext = minNextWeight
-        newPrev = totalWeight - minNextWeight
-      }
-
-      this.prevItem.size = newPrev
-      this.nextItem.size = newNext
-    } else {
+    if (this.prevType === 'weight' && this.nextType === 'weight') {} else {
       // Mixed or Both Fixed
       if (this.prevType === 'fixed') {
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 50

Expected precision:    2
Expected difference: < 0.005
Received difference:   10

[Killed] ArithmeticOperator
src/ui/Splitter.js:175:23
     const minNextPx = this.isVertical ? (this.nextItem.getMinWidthPx() || 40) : (this.nextItem.getMinHeightPx() || 40)
 
     if (this.prevType === 'weight' && this.nextType === 'weight') {
-      const diffPct = diffPx / this.pixelsPerPercent
+      const diffPct = diffPx * this.pixelsPerPercent
       let newPrev = this.startPrevSize + diffPct
       let newNext = this.startNextSize - diffPct
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 96

Expected precision:    2
Expected difference: < 0.005
Received difference:   36

[Killed] ArithmeticOperator
src/ui/Splitter.js:176:21
 
     if (this.prevType === 'weight' && this.nextType === 'weight') {
       const diffPct = diffPx / this.pixelsPerPercent
-      let newPrev = this.startPrevSize + diffPct
+      let newPrev = this.startPrevSize - diffPct
       let newNext = this.startNextSize - diffPct
 
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 40

Expected precision:    2
Expected difference: < 0.005
Received difference:   20

[Killed] ArithmeticOperator
src/ui/Splitter.js:177:21
     if (this.prevType === 'weight' && this.nextType === 'weight') {
       const diffPct = diffPx / this.pixelsPerPercent
       let newPrev = this.startPrevSize + diffPct
-      let newNext = this.startNextSize - diffPct
+      let newNext = this.startNextSize + diffPct
 
       const totalWeight = this.startPrevSize + this.startNextSize
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 40
Received: 60

Expected precision:    2
Expected difference: < 0.005
Received difference:   20

[Survived] ArithmeticOperator
src/ui/Splitter.js:179:27
       let newPrev = this.startPrevSize + diffPct
       let newNext = this.startNextSize - diffPct
 
-      const totalWeight = this.startPrevSize + this.startNextSize
+      const totalWeight = this.startPrevSize - this.startNextSize
       const minPrevWeight = minPrevPx / this.pixelsPerPercent
       const minNextWeight = minNextPx / this.pixelsPerPercent

[Killed] ArithmeticOperator
src/ui/Splitter.js:180:29
       let newNext = this.startNextSize - diffPct
 
       const totalWeight = this.startPrevSize + this.startNextSize
-      const minPrevWeight = minPrevPx / this.pixelsPerPercent
+      const minPrevWeight = minPrevPx * this.pixelsPerPercent
       const minNextWeight = minNextPx / this.pixelsPerPercent
 
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 400

Expected precision:    2
Expected difference: < 0.005
Received difference:   340

[Killed] ArithmeticOperator
src/ui/Splitter.js:181:29
 
       const totalWeight = this.startPrevSize + this.startNextSize
       const minPrevWeight = minPrevPx / this.pixelsPerPercent
-      const minNextWeight = minNextPx / this.pixelsPerPercent
+      const minNextWeight = minNextPx * this.pixelsPerPercent
 
       if (newPrev < minPrevWeight) {
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: -300

Expected precision:    2
Expected difference: < 0.005
Received difference:   360

[Killed] ConditionalExpression
src/ui/Splitter.js:183:11
       const minPrevWeight = minPrevPx / this.pixelsPerPercent
       const minNextWeight = minNextPx / this.pixelsPerPercent
 
-      if (newPrev < minPrevWeight) {
+      if (true) {
         newPrev = minPrevWeight
         newNext = totalWeight - minPrevWeight
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 4

Expected precision:    2
Expected difference: < 0.005
Received difference:   56

[Killed] EqualityOperator
src/ui/Splitter.js:183:11
       const minPrevWeight = minPrevPx / this.pixelsPerPercent
       const minNextWeight = minNextPx / this.pixelsPerPercent
 
-      if (newPrev < minPrevWeight) {
+      if (newPrev >= minPrevWeight) {
         newPrev = minPrevWeight
         newNext = totalWeight - minPrevWeight
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 4

Expected precision:    2
Expected difference: < 0.005
Received difference:   56

[NoCoverage] ArithmeticOperator
src/ui/Splitter.js:185:19
 
       if (newPrev < minPrevWeight) {
         newPrev = minPrevWeight
-        newNext = totalWeight - minPrevWeight
+        newNext = totalWeight + minPrevWeight
       } else if (newNext < minNextWeight) {
         newNext = minNextWeight

[Killed] EqualityOperator
src/ui/Splitter.js:186:18
       if (newPrev < minPrevWeight) {
         newPrev = minPrevWeight
         newNext = totalWeight - minPrevWeight
-      } else if (newNext < minNextWeight) {
+      } else if (newNext >= minNextWeight) {
         newNext = minNextWeight
         newPrev = totalWeight - minNextWeight
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 96

Expected precision:    2
Expected difference: < 0.005
Received difference:   36

[Killed] ConditionalExpression
src/ui/Splitter.js:186:18
       if (newPrev < minPrevWeight) {
         newPrev = minPrevWeight
         newNext = totalWeight - minPrevWeight
-      } else if (newNext < minNextWeight) {
+      } else if (true) {
         newNext = minNextWeight
         newPrev = totalWeight - minNextWeight
killedBy: Splitter Component Tests Mouse drag (horizontal) resizes children
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 60
Received: 96

Expected precision:    2
Expected difference: < 0.005
Received difference:   36

[NoCoverage] ArithmeticOperator
src/ui/Splitter.js:188:19
         newNext = totalWeight - minPrevWeight
       } else if (newNext < minNextWeight) {
         newNext = minNextWeight
-        newPrev = totalWeight - minNextWeight
+        newPrev = totalWeight + minNextWeight
       }
 

[NoCoverage] EqualityOperator
src/ui/Splitter.js:195:11
       this.nextItem.size = newNext
     } else {
       // Mixed or Both Fixed
-      if (this.prevType === 'fixed') {
+      if (this.prevType !== 'fixed') {
         const parsed = Utils.parseSize(this.startPrevSize)
         if (parsed.unit === 'px' || parsed.unit === '%') {

[NoCoverage] BlockStatement
src/ui/Splitter.js:195:38
       this.nextItem.size = newNext
     } else {
       // Mixed or Both Fixed
-      if (this.prevType === 'fixed') {
-        const parsed = Utils.parseSize(this.startPrevSize)
-        if (parsed.unit === 'px' || parsed.unit === '%') {
-          let newVal = parsed.value + (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
-          const minVal = parsed.unit === '%' ? minPrevPx / this.pixelsPerPercent : minPrevPx
-          if (newVal < minVal) newVal = minVal
-          this.prevItem.size = newVal + parsed.unit
-        } else {
-          // Fallback for other units: convert to px once dragged
-          const currentPx = this.isVertical ? this.prevItem.element.offsetWidth : this.prevItem.element.offsetHeight
-          let newVal = currentPx + diffPx
-          if (newVal < minPrevPx) newVal = minPrevPx
-          this.prevItem.size = newVal + 'px'
-          this.startPrevSize = this.prevItem.size // Update base for next move
-          this.startPos = currentPos
-        }
-      }
+      if (this.prevType === 'fixed') {}
       if (this.nextType === 'fixed') {
         const parsed = Utils.parseSize(this.startNextSize)

[NoCoverage] EqualityOperator
src/ui/Splitter.js:197:37
       // Mixed or Both Fixed
       if (this.prevType === 'fixed') {
         const parsed = Utils.parseSize(this.startPrevSize)
-        if (parsed.unit === 'px' || parsed.unit === '%') {
+        if (parsed.unit === 'px' || parsed.unit !== '%') {
           let newVal = parsed.value + (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minPrevPx / this.pixelsPerPercent : minPrevPx

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:197:37
       // Mixed or Both Fixed
       if (this.prevType === 'fixed') {
         const parsed = Utils.parseSize(this.startPrevSize)
-        if (parsed.unit === 'px' || parsed.unit === '%') {
+        if (parsed.unit === 'px' || false) {
           let newVal = parsed.value + (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minPrevPx / this.pixelsPerPercent : minPrevPx

[NoCoverage] EqualityOperator
src/ui/Splitter.js:198:40
       if (this.prevType === 'fixed') {
         const parsed = Utils.parseSize(this.startPrevSize)
         if (parsed.unit === 'px' || parsed.unit === '%') {
-          let newVal = parsed.value + (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
+          let newVal = parsed.value + (parsed.unit !== '%' ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minPrevPx / this.pixelsPerPercent : minPrevPx
           if (newVal < minVal) newVal = minVal

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:198:40
       if (this.prevType === 'fixed') {
         const parsed = Utils.parseSize(this.startPrevSize)
         if (parsed.unit === 'px' || parsed.unit === '%') {
-          let newVal = parsed.value + (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
+          let newVal = parsed.value + (true ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minPrevPx / this.pixelsPerPercent : minPrevPx
           if (newVal < minVal) newVal = minVal

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:199:26
         const parsed = Utils.parseSize(this.startPrevSize)
         if (parsed.unit === 'px' || parsed.unit === '%') {
           let newVal = parsed.value + (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
-          const minVal = parsed.unit === '%' ? minPrevPx / this.pixelsPerPercent : minPrevPx
+          const minVal = true ? minPrevPx / this.pixelsPerPercent : minPrevPx
           if (newVal < minVal) newVal = minVal
           this.prevItem.size = newVal + parsed.unit

[NoCoverage] ArithmeticOperator
src/ui/Splitter.js:199:48
         const parsed = Utils.parseSize(this.startPrevSize)
         if (parsed.unit === 'px' || parsed.unit === '%') {
           let newVal = parsed.value + (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
-          const minVal = parsed.unit === '%' ? minPrevPx / this.pixelsPerPercent : minPrevPx
+          const minVal = parsed.unit === '%' ? minPrevPx * this.pixelsPerPercent : minPrevPx
           if (newVal < minVal) newVal = minVal
           this.prevItem.size = newVal + parsed.unit

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:200:15
         if (parsed.unit === 'px' || parsed.unit === '%') {
           let newVal = parsed.value + (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minPrevPx / this.pixelsPerPercent : minPrevPx
-          if (newVal < minVal) newVal = minVal
+          if (false) newVal = minVal
           this.prevItem.size = newVal + parsed.unit
         } else {

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:200:15
         if (parsed.unit === 'px' || parsed.unit === '%') {
           let newVal = parsed.value + (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minPrevPx / this.pixelsPerPercent : minPrevPx
-          if (newVal < minVal) newVal = minVal
+          if (true) newVal = minVal
           this.prevItem.size = newVal + parsed.unit
         } else {

[NoCoverage] ArithmeticOperator
src/ui/Splitter.js:201:32
           let newVal = parsed.value + (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minPrevPx / this.pixelsPerPercent : minPrevPx
           if (newVal < minVal) newVal = minVal
-          this.prevItem.size = newVal + parsed.unit
+          this.prevItem.size = newVal - parsed.unit
         } else {
           // Fallback for other units: convert to px once dragged

[NoCoverage] BlockStatement
src/ui/Splitter.js:202:16
           const minVal = parsed.unit === '%' ? minPrevPx / this.pixelsPerPercent : minPrevPx
           if (newVal < minVal) newVal = minVal
           this.prevItem.size = newVal + parsed.unit
-        } else {
-          // Fallback for other units: convert to px once dragged
-          const currentPx = this.isVertical ? this.prevItem.element.offsetWidth : this.prevItem.element.offsetHeight
-          let newVal = currentPx + diffPx
-          if (newVal < minPrevPx) newVal = minPrevPx
-          this.prevItem.size = newVal + 'px'
-          this.startPrevSize = this.prevItem.size // Update base for next move
-          this.startPos = currentPos
-        }
+        } else {}
       }
       if (this.nextType === 'fixed') {

[NoCoverage] ArithmeticOperator
src/ui/Splitter.js:205:24
         } else {
           // Fallback for other units: convert to px once dragged
           const currentPx = this.isVertical ? this.prevItem.element.offsetWidth : this.prevItem.element.offsetHeight
-          let newVal = currentPx + diffPx
+          let newVal = currentPx - diffPx
           if (newVal < minPrevPx) newVal = minPrevPx
           this.prevItem.size = newVal + 'px'

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:206:15
           // Fallback for other units: convert to px once dragged
           const currentPx = this.isVertical ? this.prevItem.element.offsetWidth : this.prevItem.element.offsetHeight
           let newVal = currentPx + diffPx
-          if (newVal < minPrevPx) newVal = minPrevPx
+          if (true) newVal = minPrevPx
           this.prevItem.size = newVal + 'px'
           this.startPrevSize = this.prevItem.size // Update base for next move
