[NoCoverage] EqualityOperator
src/ui/Splitter.js:206:15
           // Fallback for other units: convert to px once dragged
           const currentPx = this.isVertical ? this.prevItem.element.offsetWidth : this.prevItem.element.offsetHeight
           let newVal = currentPx + diffPx
-          if (newVal < minPrevPx) newVal = minPrevPx
+          if (newVal >= minPrevPx) newVal = minPrevPx
           this.prevItem.size = newVal + 'px'
           this.startPrevSize = this.prevItem.size // Update base for next move

[NoCoverage] StringLiteral
src/ui/Splitter.js:207:41
           const currentPx = this.isVertical ? this.prevItem.element.offsetWidth : this.prevItem.element.offsetHeight
           let newVal = currentPx + diffPx
           if (newVal < minPrevPx) newVal = minPrevPx
-          this.prevItem.size = newVal + 'px'
+          this.prevItem.size = newVal + ""
           this.startPrevSize = this.prevItem.size // Update base for next move
           this.startPos = currentPos

[NoCoverage] EqualityOperator
src/ui/Splitter.js:212:11
           this.startPos = currentPos
         }
       }
-      if (this.nextType === 'fixed') {
+      if (this.nextType !== 'fixed') {
         const parsed = Utils.parseSize(this.startNextSize)
         if (parsed.unit === 'px' || parsed.unit === '%') {

[NoCoverage] BlockStatement
src/ui/Splitter.js:212:38
           this.startPos = currentPos
         }
       }
-      if (this.nextType === 'fixed') {
-        const parsed = Utils.parseSize(this.startNextSize)
-        if (parsed.unit === 'px' || parsed.unit === '%') {
-          let newVal = parsed.value - (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
-          const minVal = parsed.unit === '%' ? minNextPx / this.pixelsPerPercent : minNextPx
-          if (newVal < minVal) newVal = minVal
-          this.nextItem.size = newVal + parsed.unit
-        } else {
-          const currentPx = this.isVertical ? this.nextItem.element.offsetWidth : this.nextItem.element.offsetHeight
-          let newVal = currentPx - diffPx
-          if (newVal < minNextPx) newVal = minNextPx
-          this.nextItem.size = newVal + 'px'
-          this.startNextSize = this.nextItem.size
-          this.startPos = currentPos
-        }
-      }
+      if (this.nextType === 'fixed') {}
     }
 

[NoCoverage] BlockStatement
src/ui/Splitter.js:214:58
       }
       if (this.nextType === 'fixed') {
         const parsed = Utils.parseSize(this.startNextSize)
-        if (parsed.unit === 'px' || parsed.unit === '%') {
-          let newVal = parsed.value - (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
-          const minVal = parsed.unit === '%' ? minNextPx / this.pixelsPerPercent : minNextPx
-          if (newVal < minVal) newVal = minVal
-          this.nextItem.size = newVal + parsed.unit
-        } else {
+        if (parsed.unit === 'px' || parsed.unit === '%') {} else {
           const currentPx = this.isVertical ? this.nextItem.element.offsetWidth : this.nextItem.element.offsetHeight
           let newVal = currentPx - diffPx

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:214:13
       }
       if (this.nextType === 'fixed') {
         const parsed = Utils.parseSize(this.startNextSize)
-        if (parsed.unit === 'px' || parsed.unit === '%') {
+        if (false) {
           let newVal = parsed.value - (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minNextPx / this.pixelsPerPercent : minNextPx

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:215:40
       if (this.nextType === 'fixed') {
         const parsed = Utils.parseSize(this.startNextSize)
         if (parsed.unit === 'px' || parsed.unit === '%') {
-          let newVal = parsed.value - (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
+          let newVal = parsed.value - (false ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minNextPx / this.pixelsPerPercent : minNextPx
           if (newVal < minVal) newVal = minVal

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:215:40
       if (this.nextType === 'fixed') {
         const parsed = Utils.parseSize(this.startNextSize)
         if (parsed.unit === 'px' || parsed.unit === '%') {
-          let newVal = parsed.value - (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
+          let newVal = parsed.value - (true ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minNextPx / this.pixelsPerPercent : minNextPx
           if (newVal < minVal) newVal = minVal

[NoCoverage] ArithmeticOperator
src/ui/Splitter.js:216:48
         const parsed = Utils.parseSize(this.startNextSize)
         if (parsed.unit === 'px' || parsed.unit === '%') {
           let newVal = parsed.value - (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
-          const minVal = parsed.unit === '%' ? minNextPx / this.pixelsPerPercent : minNextPx
+          const minVal = parsed.unit === '%' ? minNextPx * this.pixelsPerPercent : minNextPx
           if (newVal < minVal) newVal = minVal
           this.nextItem.size = newVal + parsed.unit

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:216:26
         const parsed = Utils.parseSize(this.startNextSize)
         if (parsed.unit === 'px' || parsed.unit === '%') {
           let newVal = parsed.value - (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
-          const minVal = parsed.unit === '%' ? minNextPx / this.pixelsPerPercent : minNextPx
+          const minVal = true ? minNextPx / this.pixelsPerPercent : minNextPx
           if (newVal < minVal) newVal = minVal
           this.nextItem.size = newVal + parsed.unit

[NoCoverage] EqualityOperator
src/ui/Splitter.js:217:15
         if (parsed.unit === 'px' || parsed.unit === '%') {
           let newVal = parsed.value - (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minNextPx / this.pixelsPerPercent : minNextPx
-          if (newVal < minVal) newVal = minVal
+          if (newVal <= minVal) newVal = minVal
           this.nextItem.size = newVal + parsed.unit
         } else {

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:217:15
         if (parsed.unit === 'px' || parsed.unit === '%') {
           let newVal = parsed.value - (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minNextPx / this.pixelsPerPercent : minNextPx
-          if (newVal < minVal) newVal = minVal
+          if (true) newVal = minVal
           this.nextItem.size = newVal + parsed.unit
         } else {

[NoCoverage] ArithmeticOperator
src/ui/Splitter.js:218:32
           let newVal = parsed.value - (parsed.unit === '%' ? diffPx / this.pixelsPerPercent : diffPx)
           const minVal = parsed.unit === '%' ? minNextPx / this.pixelsPerPercent : minNextPx
           if (newVal < minVal) newVal = minVal
-          this.nextItem.size = newVal + parsed.unit
+          this.nextItem.size = newVal - parsed.unit
         } else {
           const currentPx = this.isVertical ? this.nextItem.element.offsetWidth : this.nextItem.element.offsetHeight

[NoCoverage] BlockStatement
src/ui/Splitter.js:219:16
           const minVal = parsed.unit === '%' ? minNextPx / this.pixelsPerPercent : minNextPx
           if (newVal < minVal) newVal = minVal
           this.nextItem.size = newVal + parsed.unit
-        } else {
-          const currentPx = this.isVertical ? this.nextItem.element.offsetWidth : this.nextItem.element.offsetHeight
-          let newVal = currentPx - diffPx
-          if (newVal < minNextPx) newVal = minNextPx
-          this.nextItem.size = newVal + 'px'
-          this.startNextSize = this.nextItem.size
-          this.startPos = currentPos
-        }
+        } else {}
       }
     }

[NoCoverage] ArithmeticOperator
src/ui/Splitter.js:221:24
           this.nextItem.size = newVal + parsed.unit
         } else {
           const currentPx = this.isVertical ? this.nextItem.element.offsetWidth : this.nextItem.element.offsetHeight
-          let newVal = currentPx - diffPx
+          let newVal = currentPx + diffPx
           if (newVal < minNextPx) newVal = minNextPx
           this.nextItem.size = newVal + 'px'

[NoCoverage] ConditionalExpression
src/ui/Splitter.js:222:15
         } else {
           const currentPx = this.isVertical ? this.nextItem.element.offsetWidth : this.nextItem.element.offsetHeight
           let newVal = currentPx - diffPx
-          if (newVal < minNextPx) newVal = minNextPx
+          if (false) newVal = minNextPx
           this.nextItem.size = newVal + 'px'
           this.startNextSize = this.nextItem.size

[NoCoverage] EqualityOperator
src/ui/Splitter.js:222:15
         } else {
           const currentPx = this.isVertical ? this.nextItem.element.offsetWidth : this.nextItem.element.offsetHeight
           let newVal = currentPx - diffPx
-          if (newVal < minNextPx) newVal = minNextPx
+          if (newVal <= minNextPx) newVal = minNextPx
           this.nextItem.size = newVal + 'px'
           this.startNextSize = this.nextItem.size

[Survived] BlockStatement
src/ui/Splitter.js:235:18
     this.nextItem.updateFlex()
   }
 
-  _onMouseUp (e) {
-    if (this.isDragging) {
-      this.isDragging = false
-      this.element.classList.remove('active')
-      document.removeEventListener('mousemove', this._onMouseMove)
-      document.removeEventListener('mouseup', this._onMouseUp)
-      document.removeEventListener('touchmove', this._onMouseMove)
-      document.removeEventListener('touchend', this._onMouseUp)
-    }
-  }
+  _onMouseUp (e) {}
 
   destroy () {

[Survived] ConditionalExpression
src/ui/Splitter.js:236:9
   }
 
   _onMouseUp (e) {
-    if (this.isDragging) {
+    if (false) {
       this.isDragging = false
       this.element.classList.remove('active')

[Survived] ConditionalExpression
src/ui/Splitter.js:236:9
   }
 
   _onMouseUp (e) {
-    if (this.isDragging) {
+    if (true) {
       this.isDragging = false
       this.element.classList.remove('active')

[Survived] BooleanLiteral
src/ui/Splitter.js:237:25
 
   _onMouseUp (e) {
     if (this.isDragging) {
-      this.isDragging = false
+      this.isDragging = true
       this.element.classList.remove('active')
       document.removeEventListener('mousemove', this._onMouseMove)

[Survived] BlockStatement
src/ui/Splitter.js:246:14
     }
   }
 
-  destroy () {
-    if (this.isDragging) {
-      this._onMouseUp()
-    }
-    this.element.removeEventListener('mousedown', this._onMouseDown)
-    this.element.removeEventListener('dblclick', this._onDblClick)
-    if (this.element.parentElement) {
-      this.element.parentElement.removeChild(this.element)
-    }
-  }
+  destroy () {}
 }
 

[NoCoverage] BlockStatement
src/ui/Splitter.js:247:26
   }
 
   destroy () {
-    if (this.isDragging) {
-      this._onMouseUp()
-    }
+    if (this.isDragging) {}
     this.element.removeEventListener('mousedown', this._onMouseDown)
     this.element.removeEventListener('dblclick', this._onDblClick)

[Survived] ConditionalExpression
src/ui/Splitter.js:247:9
   }
 
   destroy () {
-    if (this.isDragging) {
+    if (true) {
       this._onMouseUp()
     }

[Survived] StringLiteral
src/ui/Splitter.js:250:38
     if (this.isDragging) {
       this._onMouseUp()
     }
-    this.element.removeEventListener('mousedown', this._onMouseDown)
+    this.element.removeEventListener("", this._onMouseDown)
     this.element.removeEventListener('dblclick', this._onDblClick)
     if (this.element.parentElement) {

[Survived] ConditionalExpression
src/ui/Splitter.js:252:9
     }
     this.element.removeEventListener('mousedown', this._onMouseDown)
     this.element.removeEventListener('dblclick', this._onDblClick)
-    if (this.element.parentElement) {
+    if (true) {
       this.element.parentElement.removeChild(this.element)
     }

[Survived] ConditionalExpression
src/ui/Splitter.js:252:9
     }
     this.element.removeEventListener('mousedown', this._onMouseDown)
     this.element.removeEventListener('dblclick', this._onDblClick)
-    if (this.element.parentElement) {
+    if (false) {
       this.element.parentElement.removeChild(this.element)
     }
