[Killed] BlockStatement
src/managers/PopoutManager.js:5:31
 import { RowItem } from '../core/ContainerItem.js'
 
 export class PopoutManager {
-  constructor (layoutManager) {
-    this.layoutManager = layoutManager
-    // Map of popoutId -> { window, originalStack, location, intervalId }
-    this.openPopouts = new Map()
-
-    // Close all popouts when parent unloads
-    this._onBeforeUnload = () => this.closeAll()
-    window.addEventListener('beforeunload', this._onBeforeUnload)
-  }
+  constructor (layoutManager) {}
 
   /**
killedBy: PopoutManager Unit Tests LayoutManager has PopoutManager initialized when enabled
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Survived] ArrowFunction
src/managers/PopoutManager.js:11:28
     this.openPopouts = new Map()
 
     // Close all popouts when parent unloads
-    this._onBeforeUnload = () => this.closeAll()
+    this._onBeforeUnload = () => undefined
     window.addEventListener('beforeunload', this._onBeforeUnload)
   }

[Survived] StringLiteral
src/managers/PopoutManager.js:12:29
 
     // Close all popouts when parent unloads
     this._onBeforeUnload = () => this.closeAll()
-    window.addEventListener('beforeunload', this._onBeforeUnload)
+    window.addEventListener("", this._onBeforeUnload)
   }
 

[Killed] ConditionalExpression
src/managers/PopoutManager.js:21:9
      * preserving all event listeners and closures.
      */
   popout (stack) {
-    if (!stack || stack.children.length === 0) return null
+    if (true) return null
 
     // Can't popout a stack that's already in a popout
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

[Killed] BooleanLiteral
src/managers/PopoutManager.js:21:9
      * preserving all event listeners and closures.
      */
   popout (stack) {
-    if (!stack || stack.children.length === 0) return null
+    if (stack || stack.children.length === 0) return null
 
     // Can't popout a stack that's already in a popout
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
src/managers/PopoutManager.js:24:9
     if (!stack || stack.children.length === 0) return null
 
     // Can't popout a stack that's already in a popout
-    if (stack.isPopoutChild) {
+    if (false) {
       return null
     }
killedBy: PopoutManager Unit Tests prevents popping out a stack that is already a popout child
statusReason: Error: expect(received).toBeNull()

Received: "popout-6ae5q5zte"

[Killed] ConditionalExpression
src/managers/PopoutManager.js:24:9
     if (!stack || stack.children.length === 0) return null
 
     // Can't popout a stack that's already in a popout
-    if (stack.isPopoutChild) {
+    if (true) {
       return null
     }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

[Survived] MethodExpression
src/managers/PopoutManager.js:32:19
 
     // Calculate window dimensions from the stack's current size before we move it
     const rect = stack.element.getBoundingClientRect()
-    const width = Math.max(400, Math.round(rect.width))
+    const width = Math.min(400, Math.round(rect.width))
     let height = Math.max(300, Math.round(rect.height))
     if (stack.isMinimized) height = 500

[Survived] MethodExpression
src/managers/PopoutManager.js:33:18
     // Calculate window dimensions from the stack's current size before we move it
     const rect = stack.element.getBoundingClientRect()
     const width = Math.max(400, Math.round(rect.width))
-    let height = Math.max(300, Math.round(rect.height))
+    let height = Math.min(300, Math.round(rect.height))
     if (stack.isMinimized) height = 500
     const left = Math.round(window.screenX + rect.left)

[Survived] ConditionalExpression
src/managers/PopoutManager.js:34:9
     const rect = stack.element.getBoundingClientRect()
     const width = Math.max(400, Math.round(rect.width))
     let height = Math.max(300, Math.round(rect.height))
-    if (stack.isMinimized) height = 500
+    if (false) height = 500
     const left = Math.round(window.screenX + rect.left)
     const top = Math.round(window.screenY + rect.top)

[Survived] ConditionalExpression
src/managers/PopoutManager.js:34:9
     const rect = stack.element.getBoundingClientRect()
     const width = Math.max(400, Math.round(rect.width))
     let height = Math.max(300, Math.round(rect.height))
-    if (stack.isMinimized) height = 500
+    if (true) height = 500
     const left = Math.round(window.screenX + rect.left)
     const top = Math.round(window.screenY + rect.top)

[Survived] ArithmeticOperator
src/managers/PopoutManager.js:35:29
     const width = Math.max(400, Math.round(rect.width))
     let height = Math.max(300, Math.round(rect.height))
     if (stack.isMinimized) height = 500
-    const left = Math.round(window.screenX + rect.left)
+    const left = Math.round(window.screenX - rect.left)
     const top = Math.round(window.screenY + rect.top)
 

[Survived] ArithmeticOperator
src/managers/PopoutManager.js:36:28
     let height = Math.max(300, Math.round(rect.height))
     if (stack.isMinimized) height = 500
     const left = Math.round(window.screenX + rect.left)
-    const top = Math.round(window.screenY + rect.top)
+    const top = Math.round(window.screenY - rect.top)
 
     // Build styles string from all <link> and <style> tags in parent

[Survived] LogicalOperator
src/managers/PopoutManager.js:40:23
 
     // Build styles string from all <link> and <style> tags in parent
     const styles = this._collectStyles()
-    const bodyClass = document.body.className || ''
+    const bodyClass = document.body.className && ''
 
     // Open the window

[Survived] ConditionalExpression
src/managers/PopoutManager.js:40:23
 
     // Build styles string from all <link> and <style> tags in parent
     const styles = this._collectStyles()
-    const bodyClass = document.body.className || ''
+    const bodyClass = false
 
     // Open the window

[Survived] StringLiteral
src/managers/PopoutManager.js:43:22
     const bodyClass = document.body.className || ''
 
     // Open the window
-    const features = `width=${width},height=${height},left=${left},top=${top},resizable=yes,scrollbars=no,status=no,toolbar=no,menubar=no,location=no`
+    const features = ``
     const childWindow = window.open('', popoutId, features)
 

[Survived] StringLiteral
src/managers/PopoutManager.js:44:37
 
     // Open the window
     const features = `width=${width},height=${height},left=${left},top=${top},resizable=yes,scrollbars=no,status=no,toolbar=no,menubar=no,location=no`
-    const childWindow = window.open('', popoutId, features)
+    const childWindow = window.open("Stryker was here!", popoutId, features)
 
     if (!childWindow) {

[Killed] ConditionalExpression
src/managers/PopoutManager.js:46:9
     const features = `width=${width},height=${height},left=${left},top=${top},resizable=yes,scrollbars=no,status=no,toolbar=no,menubar=no,location=no`
     const childWindow = window.open('', popoutId, features)
 
-    if (!childWindow) {
+    if (true) {
       this.layoutManager.showToast('Popup blocked. Please allow popups for this site.', 'error')
       return null
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

[Killed] BooleanLiteral
src/managers/PopoutManager.js:46:9
     const features = `width=${width},height=${height},left=${left},top=${top},resizable=yes,scrollbars=no,status=no,toolbar=no,menubar=no,location=no`
     const childWindow = window.open('', popoutId, features)
 
-    if (!childWindow) {
+    if (childWindow) {
       this.layoutManager.showToast('Popup blocked. Please allow popups for this site.', 'error')
       return null
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

[NoCoverage] StringLiteral
src/managers/PopoutManager.js:47:36
     const childWindow = window.open('', popoutId, features)
 
     if (!childWindow) {
-      this.layoutManager.showToast('Popup blocked. Please allow popups for this site.', 'error')
+      this.layoutManager.showToast("", 'error')
       return null
     }

[Killed] ConditionalExpression
src/managers/PopoutManager.js:68:9
 
     // 1. Detach stack from parent's tree logic WITHOUT destroying it
     // We use the new detachChild which removes it from the layout tree but preserves the instance
-    if (stack.parent) {
+    if (true) {
       stack.parent.detachChild(stack)
       if (stack.parent && stack.parent.children && stack.parent.children.length === 0) {
killedBy: PopoutManager Unit Tests falls back to root if parent is no longer available
statusReason: TypeError: Cannot read properties of null (reading 'detachChild')

[Killed] BlockStatement
src/managers/PopoutManager.js:68:23
 
     // 1. Detach stack from parent's tree logic WITHOUT destroying it
     // We use the new detachChild which removes it from the layout tree but preserves the instance
-    if (stack.parent) {
-      stack.parent.detachChild(stack)
-      if (stack.parent && stack.parent.children && stack.parent.children.length === 0) {
-        this.layoutManager._cleanupEmptyStack(stack.parent)
-      }
-    } else {
+    if (stack.parent) {} else {
       // Stack was root
       this.layoutManager.rootElement.innerHTML = ''
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

[Killed] LogicalOperator
src/managers/PopoutManager.js:70:11
     // We use the new detachChild which removes it from the layout tree but preserves the instance
     if (stack.parent) {
       stack.parent.detachChild(stack)
-      if (stack.parent && stack.parent.children && stack.parent.children.length === 0) {
+      if (stack.parent && stack.parent.children || stack.parent.children.length === 0) {
         this.layoutManager._cleanupEmptyStack(stack.parent)
       }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of null (reading 'children')

[Killed] LogicalOperator
src/managers/PopoutManager.js:70:11
     // We use the new detachChild which removes it from the layout tree but preserves the instance
     if (stack.parent) {
       stack.parent.detachChild(stack)
-      if (stack.parent && stack.parent.children && stack.parent.children.length === 0) {
+      if (stack.parent || stack.parent.children && stack.parent.children.length === 0) {
         this.layoutManager._cleanupEmptyStack(stack.parent)
       }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of null (reading 'children')

[Killed] BlockStatement
src/managers/PopoutManager.js:73:12
       if (stack.parent && stack.parent.children && stack.parent.children.length === 0) {
         this.layoutManager._cleanupEmptyStack(stack.parent)
       }
-    } else {
-      // Stack was root
-      this.layoutManager.rootElement.innerHTML = ''
-      this.layoutManager.root = null
-      this.layoutManager.renderEmptyState()
-    }
+    } else {}
 
     // Apply some overrides while in popout mode
killedBy: PopoutManager Unit Tests falls back to root if parent is no longer available
statusReason: Error: expect(received).toBeNull()

[Killed] BooleanLiteral
src/managers/PopoutManager.js:81:27
     }
 
     // Apply some overrides while in popout mode
-    stack.isPopoutChild = true
+    stack.isPopoutChild = false
 
     // Track previous state
killedBy: PopoutManager Unit Tests prevents popping out a stack that is already a popout child
statusReason: Error: expect(received).toBeNull()

Received: "popout-6jszpwa8t"

[Killed] BlockStatement
src/managers/PopoutManager.js:88:28
     entry.prePopoutMaximized = Boolean(stack.isMaximized)
 
     // Force maximize (even if previously minimized)
-    if (stack.isMinimized) {
-      stack.element.classList.remove('minimized')
-      stack.isMinimized = false
-      stack.updateFlex()
-    }
+    if (stack.isMinimized) {}
     if (!stack.isMaximized) {
       stack.element.classList.add('maximized')
killedBy: PopoutManager Unit Tests popped-out stack is always maximized even when previously minimized
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/managers/PopoutManager.js:88:9
     entry.prePopoutMaximized = Boolean(stack.isMaximized)
 
     // Force maximize (even if previously minimized)
-    if (stack.isMinimized) {
+    if (false) {
       stack.element.classList.remove('minimized')
       stack.isMinimized = false
killedBy: PopoutManager Unit Tests popped-out stack is always maximized even when previously minimized
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/managers/PopoutManager.js:90:27
     // Force maximize (even if previously minimized)
     if (stack.isMinimized) {
       stack.element.classList.remove('minimized')
-      stack.isMinimized = false
+      stack.isMinimized = true
       stack.updateFlex()
     }
killedBy: PopoutManager Unit Tests popped-out stack is always maximized even when previously minimized
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/managers/PopoutManager.js:93:9
       stack.isMinimized = false
       stack.updateFlex()
     }
-    if (!stack.isMaximized) {
+    if (false) {
       stack.element.classList.add('maximized')
       stack.isMaximized = true
killedBy: PopoutManager Unit Tests popped-out stack is always maximized even when previously minimized
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/managers/PopoutManager.js:93:29
       stack.isMinimized = false
       stack.updateFlex()
     }
-    if (!stack.isMaximized) {
-      stack.element.classList.add('maximized')
-      stack.isMaximized = true
-    }
+    if (!stack.isMaximized) {}
 
     // Force it to full size temporarily
killedBy: PopoutManager Unit Tests popped-out stack is always maximized even when previously minimized
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/managers/PopoutManager.js:95:27
     }
     if (!stack.isMaximized) {
       stack.element.classList.add('maximized')
-      stack.isMaximized = true
+      stack.isMaximized = false
     }
 
killedBy: PopoutManager Unit Tests popped-out stack is always maximized even when previously minimized
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/managers/PopoutManager.js:104:9
     stack.element.style.flex = '1' // Make sure it takes full space
 
     // Stop displaying the popout button in popouts
-    if (stack.popoutBtn) stack.popoutBtn.style.display = 'none'
+    if (false) stack.popoutBtn.style.display = 'none'
 
     // Prepare the transfer logic

[Survived] ConditionalExpression
src/managers/PopoutManager.js:104:9
     stack.element.style.flex = '1' // Make sure it takes full space
 
     // Stop displaying the popout button in popouts
-    if (stack.popoutBtn) stack.popoutBtn.style.display = 'none'
+    if (true) stack.popoutBtn.style.display = 'none'
 
     // Prepare the transfer logic

[Survived] BlockStatement
src/managers/PopoutManager.js:107:35
     if (stack.popoutBtn) stack.popoutBtn.style.display = 'none'
 
     // Prepare the transfer logic
-    const performTransfer = () => {
-      const destContainer = childWindow.document.getElementById('tulweb-popout-root')
-      if (!destContainer) return
-
-      // The core transfer: adopt the node and its entire subtree to the new document
-      childWindow.document.adoptNode(stack.element)
-
-      // Append it to the new window's DOM
-      destContainer.appendChild(stack.element)
-
-      // Force a resize event on the children so they layout correctly in the new window size
-      stack.children.forEach(child => child.emit('resize'))
-      this.layoutManager.emit('popoutReady', { popoutId })
-    }
+    const performTransfer = () => {}
 
     // Write the HTML skeleton into the new window

[Survived] ConditionalExpression
src/managers/PopoutManager.js:109:11
     // Prepare the transfer logic
     const performTransfer = () => {
       const destContainer = childWindow.document.getElementById('tulweb-popout-root')
-      if (!destContainer) return
+      if (false) return
 
       // The core transfer: adopt the node and its entire subtree to the new document

[Survived] BooleanLiteral
src/managers/PopoutManager.js:109:11
     // Prepare the transfer logic
     const performTransfer = () => {
       const destContainer = childWindow.document.getElementById('tulweb-popout-root')
-      if (!destContainer) return
+      if (destContainer) return
 
       // The core transfer: adopt the node and its entire subtree to the new document

[Survived] ArrowFunction
src/managers/PopoutManager.js:118:30
       destContainer.appendChild(stack.element)
 
       // Force a resize event on the children so they layout correctly in the new window size
-      stack.children.forEach(child => child.emit('resize'))
+      stack.children.forEach(() => undefined)
       this.layoutManager.emit('popoutReady', { popoutId })
     }

[Survived] StringLiteral
src/managers/PopoutManager.js:118:50
       destContainer.appendChild(stack.element)
 
       // Force a resize event on the children so they layout correctly in the new window size
-      stack.children.forEach(child => child.emit('resize'))
+      stack.children.forEach(child => child.emit(""))
       this.layoutManager.emit('popoutReady', { popoutId })
     }

[Survived] ConditionalExpression
src/managers/PopoutManager.js:158:9
     childWindow.document.close()
 
     // Wait for styles and DOM to be ready
-    if (childWindow.document.readyState === 'complete') {
+    if (true) {
       performTransfer()
     } else {

[NoCoverage] BlockStatement
src/managers/PopoutManager.js:158:57
     childWindow.document.close()
 
     // Wait for styles and DOM to be ready
-    if (childWindow.document.readyState === 'complete') {
-      performTransfer()
-    } else {
+    if (childWindow.document.readyState === 'complete') {} else {
       childWindow.addEventListener('load', performTransfer)
     }

[Survived] BlockStatement
src/managers/PopoutManager.js:160:12
     // Wait for styles and DOM to be ready
     if (childWindow.document.readyState === 'complete') {
       performTransfer()
-    } else {
-      childWindow.addEventListener('load', performTransfer)
-    }
+    } else {}
 
     this.layoutManager.emit('popoutCreated', { popoutId })

[Survived] StringLiteral
src/managers/PopoutManager.js:164:29
       childWindow.addEventListener('load', performTransfer)
     }
 
-    this.layoutManager.emit('popoutCreated', { popoutId })
+    this.layoutManager.emit("", { popoutId })
     this.layoutManager.emit('popout', stack)
     this.layoutManager.emit('stateChanged')

[Killed] StringLiteral
src/managers/PopoutManager.js:165:29
     }
 
     this.layoutManager.emit('popoutCreated', { popoutId })
-    this.layoutManager.emit('popout', stack)
+    this.layoutManager.emit("", stack)
     this.layoutManager.emit('stateChanged')
 
killedBy: PopoutManager Unit Tests emits popout and popout-restore events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

                <div … />
                <div class="tulweb-empty-state">
                    <svg … />
                    <div … />

[NoCoverage] BlockStatement
src/managers/PopoutManager.js:169:42
     this.layoutManager.emit('stateChanged')
 
     // Monitor child window closure: fallback polling just in case beforeunload is missed
-    const intervalId = setInterval(() => {
-      if (childWindow.closed) {
-        clearInterval(intervalId)
-        this._handlePopoutClosed(popoutId)
-      }
-    }, 300)
+    const intervalId = setInterval(() => {}, 300)
 
     entry.intervalId = intervalId

[NoCoverage] BlockStatement
src/managers/PopoutManager.js:170:31
 
     // Monitor child window closure: fallback polling just in case beforeunload is missed
     const intervalId = setInterval(() => {
-      if (childWindow.closed) {
-        clearInterval(intervalId)
-        this._handlePopoutClosed(popoutId)
-      }
+      if (childWindow.closed) {}
     }, 300)
 

[NoCoverage] ConditionalExpression
src/managers/PopoutManager.js:170:11
 
     // Monitor child window closure: fallback polling just in case beforeunload is missed
     const intervalId = setInterval(() => {
-      if (childWindow.closed) {
+      if (true) {
         clearInterval(intervalId)
         this._handlePopoutClosed(popoutId)

[NoCoverage] BlockStatement
src/managers/PopoutManager.js:179:31
     entry.intervalId = intervalId
 
     // Also recover via beforeunload on the child window itself for faster response and event listener fidelity
-    const rescueStack = () => {
-      if (this.openPopouts.has(popoutId)) {
-        this._handlePopoutClosed(popoutId)
-      }
-    }
+    const rescueStack = () => {}
     childWindow.addEventListener('beforeunload', rescueStack)
     childWindow.addEventListener('pagehide', rescueStack)

[NoCoverage] ConditionalExpression
src/managers/PopoutManager.js:180:11
 
     // Also recover via beforeunload on the child window itself for faster response and event listener fidelity
     const rescueStack = () => {
-      if (this.openPopouts.has(popoutId)) {
+      if (false) {
         this._handlePopoutClosed(popoutId)
       }

[NoCoverage] BlockStatement
src/managers/PopoutManager.js:180:43
 
     // Also recover via beforeunload on the child window itself for faster response and event listener fidelity
     const rescueStack = () => {
-      if (this.openPopouts.has(popoutId)) {
-        this._handlePopoutClosed(popoutId)
-      }
+      if (this.openPopouts.has(popoutId)) {}
     }
     childWindow.addEventListener('beforeunload', rescueStack)

[Survived] StringLiteral
src/managers/PopoutManager.js:185:34
       }
     }
     childWindow.addEventListener('beforeunload', rescueStack)
-    childWindow.addEventListener('pagehide', rescueStack)
+    childWindow.addEventListener("", rescueStack)
     childWindow.addEventListener('unload', rescueStack)
 

[Survived] StringLiteral
src/managers/PopoutManager.js:186:34
     }
     childWindow.addEventListener('beforeunload', rescueStack)
     childWindow.addEventListener('pagehide', rescueStack)
-    childWindow.addEventListener('unload', rescueStack)
+    childWindow.addEventListener("", rescueStack)
 
     return popoutId

[Survived] BlockStatement
src/managers/PopoutManager.js:191:21
     return popoutId
   }
 
-  _collectStyles () {
-    const parts = []
-    document.querySelectorAll('link[rel="stylesheet"]').forEach(link => {
-      parts.push(`<link rel="stylesheet" href="${link.href}">`)
-    })
-    document.querySelectorAll('style').forEach(style => {
-      parts.push(`<style>\n${style.textContent}\n</style>`)
-    })
-    return parts.join('\n')
-  }
+  _collectStyles () {}
 
   _getPopoutTitle (stack) {

[NoCoverage] BlockStatement
src/managers/PopoutManager.js:193:73
 
   _collectStyles () {
     const parts = []
-    document.querySelectorAll('link[rel="stylesheet"]').forEach(link => {
-      parts.push(`<link rel="stylesheet" href="${link.href}">`)
-    })
+    document.querySelectorAll('link[rel="stylesheet"]').forEach(link => {})
     document.querySelectorAll('style').forEach(style => {
       parts.push(`<style>\n${style.textContent}\n</style>`)

[Killed] StringLiteral
src/managers/PopoutManager.js:193:31
 
   _collectStyles () {
     const parts = []
-    document.querySelectorAll('link[rel="stylesheet"]').forEach(link => {
+    document.querySelectorAll("").forEach(link => {
       parts.push(`<link rel="stylesheet" href="${link.href}">`)
     })
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: SyntaxError: '' is not a valid selector

[NoCoverage] BlockStatement
src/managers/PopoutManager.js:196:57
     document.querySelectorAll('link[rel="stylesheet"]').forEach(link => {
       parts.push(`<link rel="stylesheet" href="${link.href}">`)
     })
-    document.querySelectorAll('style').forEach(style => {
-      parts.push(`<style>\n${style.textContent}\n</style>`)
-    })
+    document.querySelectorAll('style').forEach(style => {})
     return parts.join('\n')
   }

[Killed] StringLiteral
src/managers/PopoutManager.js:196:31
     document.querySelectorAll('link[rel="stylesheet"]').forEach(link => {
       parts.push(`<link rel="stylesheet" href="${link.href}">`)
     })
-    document.querySelectorAll('style').forEach(style => {
+    document.querySelectorAll("").forEach(style => {
       parts.push(`<style>\n${style.textContent}\n</style>`)
     })
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: SyntaxError: '' is not a valid selector

[NoCoverage] StringLiteral
src/managers/PopoutManager.js:197:18
       parts.push(`<link rel="stylesheet" href="${link.href}">`)
     })
     document.querySelectorAll('style').forEach(style => {
-      parts.push(`<style>\n${style.textContent}\n</style>`)
+      parts.push(``)
     })
     return parts.join('\n')

[Survived] BlockStatement
src/managers/PopoutManager.js:202:27
     return parts.join('\n')
   }
 
-  _getPopoutTitle (stack) {
-    if (stack.children && stack.children.length > 0) {
-      const first = stack.children[0]
-      return (first.config.title || first.config.componentName || 'Panel') + ' — TulWEB Popout'
-    }
-    return 'TulWEB Popout'
-  }
+  _getPopoutTitle (stack) {}
 
   _handlePopoutClosed (popoutId) {

[Survived] ConditionalExpression
src/managers/PopoutManager.js:203:27
   }
 
   _getPopoutTitle (stack) {
-    if (stack.children && stack.children.length > 0) {
+    if (stack.children && true) {
       const first = stack.children[0]
       return (first.config.title || first.config.componentName || 'Panel') + ' — TulWEB Popout'

[Survived] LogicalOperator
src/managers/PopoutManager.js:203:9
   }
 
   _getPopoutTitle (stack) {
-    if (stack.children && stack.children.length > 0) {
+    if (stack.children || stack.children.length > 0) {
       const first = stack.children[0]
       return (first.config.title || first.config.componentName || 'Panel') + ' — TulWEB Popout'

[Survived] LogicalOperator
src/managers/PopoutManager.js:205:15
   _getPopoutTitle (stack) {
     if (stack.children && stack.children.length > 0) {
       const first = stack.children[0]
-      return (first.config.title || first.config.componentName || 'Panel') + ' — TulWEB Popout'
+      return (first.config.title && first.config.componentName || 'Panel') + ' — TulWEB Popout'
     }
     return 'TulWEB Popout'

[Survived] ConditionalExpression
src/managers/PopoutManager.js:205:15
   _getPopoutTitle (stack) {
     if (stack.children && stack.children.length > 0) {
       const first = stack.children[0]
-      return (first.config.title || first.config.componentName || 'Panel') + ' — TulWEB Popout'
+      return (false) + ' — TulWEB Popout'
     }
     return 'TulWEB Popout'

[NoCoverage] StringLiteral
src/managers/PopoutManager.js:207:12
       const first = stack.children[0]
       return (first.config.title || first.config.componentName || 'Panel') + ' — TulWEB Popout'
     }
-    return 'TulWEB Popout'
+    return ""
   }
 

[Killed] ConditionalExpression
src/managers/PopoutManager.js:212:9
 
   _handlePopoutClosed (popoutId) {
     const entry = this.openPopouts.get(popoutId)
-    if (!entry) return
+    if (true) return
 
     this.layoutManager.dragManager.cancelDrag()
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BooleanLiteral
src/managers/PopoutManager.js:212:9
 
   _handlePopoutClosed (popoutId) {
     const entry = this.openPopouts.get(popoutId)
-    if (!entry) return
+    if (entry) return
 
     this.layoutManager.dragManager.cancelDrag()
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Survived] ConditionalExpression
src/managers/PopoutManager.js:216:9
 
     this.layoutManager.dragManager.cancelDrag()
 
-    if (entry.intervalId) clearInterval(entry.intervalId)
+    if (true) clearInterval(entry.intervalId)
     this.openPopouts.delete(popoutId)
 

[Survived] ConditionalExpression
src/managers/PopoutManager.js:216:9
 
     this.layoutManager.dragManager.cancelDrag()
 
-    if (entry.intervalId) clearInterval(entry.intervalId)
+    if (false) clearInterval(entry.intervalId)
     this.openPopouts.delete(popoutId)
 

[Killed] ConditionalExpression
src/managers/PopoutManager.js:221:9
 
     const stack = entry.originalStack
 
-    if (stack && stack.element) {
+    if (false) {
       // Adopt it back to the parent document
       document.adoptNode(stack.element)
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: Error: expect(received).not.toBeNull()

Received: null
