[Survived] ConditionalExpression
src/managers/PopoutManager.js:221:9
 
     const stack = entry.originalStack
 
-    if (stack && stack.element) {
+    if (true) {
       // Adopt it back to the parent document
       document.adoptNode(stack.element)

[Survived] BooleanLiteral
src/managers/PopoutManager.js:226:29
       document.adoptNode(stack.element)
 
       // Remove popout styling overrides
-      stack.isPopoutChild = false
+      stack.isPopoutChild = true
       stack.element.style.width = ''
       stack.element.style.height = ''

[Survived] StringLiteral
src/managers/PopoutManager.js:227:35
 
       // Remove popout styling overrides
       stack.isPopoutChild = false
-      stack.element.style.width = ''
+      stack.element.style.width = "Stryker was here!"
       stack.element.style.height = ''
       stack.element.style.flex = ''

[Survived] ConditionalExpression
src/managers/PopoutManager.js:230:11
       stack.element.style.width = ''
       stack.element.style.height = ''
       stack.element.style.flex = ''
-      if (stack.popoutBtn) stack.popoutBtn.style.display = ''
+      if (false) stack.popoutBtn.style.display = ''
 
       // Restore previous minimized/maximized state

[Survived] ConditionalExpression
src/managers/PopoutManager.js:230:11
       stack.element.style.width = ''
       stack.element.style.height = ''
       stack.element.style.flex = ''
-      if (stack.popoutBtn) stack.popoutBtn.style.display = ''
+      if (true) stack.popoutBtn.style.display = ''
 
       // Restore previous minimized/maximized state

[Killed] ConditionalExpression
src/managers/PopoutManager.js:233:11
       if (stack.popoutBtn) stack.popoutBtn.style.display = ''
 
       // Restore previous minimized/maximized state
-      if (entry.prePopoutMinimized) {
+      if (false) {
         stack.element.classList.add('minimized')
         stack.isMinimized = true
killedBy: PopoutManager Unit Tests state restores correctly after popout closes (was minimized)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/managers/PopoutManager.js:233:11
       if (stack.popoutBtn) stack.popoutBtn.style.display = ''
 
       // Restore previous minimized/maximized state
-      if (entry.prePopoutMinimized) {
+      if (true) {
         stack.element.classList.add('minimized')
         stack.isMinimized = true
killedBy: PopoutManager Unit Tests state restores correctly after popout closes (was normal)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
src/managers/PopoutManager.js:234:37
 
       // Restore previous minimized/maximized state
       if (entry.prePopoutMinimized) {
-        stack.element.classList.add('minimized')
+        stack.element.classList.add("")
         stack.isMinimized = true
       } else {
killedBy: PopoutManager Unit Tests state restores correctly after popout closes (was minimized)
statusReason: SyntaxError: The token provided must not be empty.

[Killed] BooleanLiteral
src/managers/PopoutManager.js:235:29
       // Restore previous minimized/maximized state
       if (entry.prePopoutMinimized) {
         stack.element.classList.add('minimized')
-        stack.isMinimized = true
+        stack.isMinimized = false
       } else {
         stack.element.classList.remove('minimized')
killedBy: PopoutManager Unit Tests state restores correctly after popout closes (was minimized)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BlockStatement
src/managers/PopoutManager.js:236:14
       if (entry.prePopoutMinimized) {
         stack.element.classList.add('minimized')
         stack.isMinimized = true
-      } else {
-        stack.element.classList.remove('minimized')
-        stack.isMinimized = false
-      }
+      } else {}
 
       if (!entry.prePopoutMaximized) {

[Killed] StringLiteral
src/managers/PopoutManager.js:237:40
         stack.element.classList.add('minimized')
         stack.isMinimized = true
       } else {
-        stack.element.classList.remove('minimized')
+        stack.element.classList.remove("")
         stack.isMinimized = false
       }
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: SyntaxError: The token provided must not be empty.

[Killed] BooleanLiteral
src/managers/PopoutManager.js:241:11
         stack.isMinimized = false
       }
 
-      if (!entry.prePopoutMaximized) {
+      if (entry.prePopoutMaximized) {
         stack.element.classList.remove('maximized')
         stack.isMaximized = false
killedBy: PopoutManager Unit Tests state restores correctly after popout closes (was minimized)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/managers/PopoutManager.js:241:11
         stack.isMinimized = false
       }
 
-      if (!entry.prePopoutMaximized) {
+      if (false) {
         stack.element.classList.remove('maximized')
         stack.isMaximized = false
killedBy: PopoutManager Unit Tests state restores correctly after popout closes (was minimized)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
src/managers/PopoutManager.js:242:40
       }
 
       if (!entry.prePopoutMaximized) {
-        stack.element.classList.remove('maximized')
+        stack.element.classList.remove("")
         stack.isMaximized = false
       } else {
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: SyntaxError: The token provided must not be empty.

[Killed] BooleanLiteral
src/managers/PopoutManager.js:243:29
 
       if (!entry.prePopoutMaximized) {
         stack.element.classList.remove('maximized')
-        stack.isMaximized = false
+        stack.isMaximized = true
       } else {
         stack.element.classList.add('maximized')
killedBy: PopoutManager Unit Tests state restores correctly after popout closes (was minimized)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[NoCoverage] BlockStatement
src/managers/PopoutManager.js:244:14
       if (!entry.prePopoutMaximized) {
         stack.element.classList.remove('maximized')
         stack.isMaximized = false
-      } else {
-        stack.element.classList.add('maximized')
-        stack.isMaximized = true
-      }
+      } else {}
 
       // Sync SVG toggles and styles

[NoCoverage] BlockStatement
src/managers/PopoutManager.js:251:30
 
       // Sync SVG toggles and styles
       stack.updateFlex()
-      if (stack.isMaximized) {
-        if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
-      } else {
+      if (stack.isMaximized) {} else {
         if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
       }

[Survived] ConditionalExpression
src/managers/PopoutManager.js:251:11
 
       // Sync SVG toggles and styles
       stack.updateFlex()
-      if (stack.isMaximized) {
+      if (false) {
         if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
       } else {

[NoCoverage] ConditionalExpression
src/managers/PopoutManager.js:252:13
       // Sync SVG toggles and styles
       stack.updateFlex()
       if (stack.isMaximized) {
-        if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
+        if (true) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
       } else {
         if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'

[NoCoverage] ConditionalExpression
src/managers/PopoutManager.js:252:13
       // Sync SVG toggles and styles
       stack.updateFlex()
       if (stack.isMaximized) {
-        if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
+        if (false) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
       } else {
         if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'

[Survived] BlockStatement
src/managers/PopoutManager.js:253:14
       stack.updateFlex()
       if (stack.isMaximized) {
         if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
-      } else {
-        if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
-      }
+      } else {}
 
       // Add the stack back to the LayoutManager's tree

[Survived] ConditionalExpression
src/managers/PopoutManager.js:254:13
       if (stack.isMaximized) {
         if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
       } else {
-        if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
+        if (false) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
       }
 

[Survived] ConditionalExpression
src/managers/PopoutManager.js:254:13
       if (stack.isMaximized) {
         if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
       } else {
-        if (stack.maxBtn) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
+        if (true) stack.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
       }
 

[Killed] BooleanLiteral
src/managers/PopoutManager.js:258:22
       }
 
       // Add the stack back to the LayoutManager's tree
-      let restored = false
+      let restored = true
 
       // Try to restore to previous location
killedBy: PopoutManager Unit Tests falls back to root if parent is no longer available
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/managers/PopoutManager.js:261:54
       let restored = false
 
       // Try to restore to previous location
-      if (entry.location && entry.location.parentId) {
-        let parent = this.layoutManager.getItemById(entry.location.parentId)
-
-        // If the direct parent is gone, try to find an ancestor
-        if (!parent) {
-          parent = this.layoutManager.root
-        }
-
-        if (parent && parent.config && (parent.config.type === 'row' || parent.config.type === 'column')) {
-          const targetIndex = Math.min(entry.location.index, parent.children.length)
-          parent.addChild(stack, targetIndex)
-          restored = true
-        }
-      }
+      if (entry.location && entry.location.parentId) {}
 
       if (!restored) {
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
src/managers/PopoutManager.js:261:11
       let restored = false
 
       // Try to restore to previous location
-      if (entry.location && entry.location.parentId) {
+      if (false) {
         let parent = this.layoutManager.getItemById(entry.location.parentId)
 
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Survived] ConditionalExpression
src/managers/PopoutManager.js:265:13
         let parent = this.layoutManager.getItemById(entry.location.parentId)
 
         // If the direct parent is gone, try to find an ancestor
-        if (!parent) {
+        if (false) {
           parent = this.layoutManager.root
         }

[Survived] BooleanLiteral
src/managers/PopoutManager.js:265:13
         let parent = this.layoutManager.getItemById(entry.location.parentId)
 
         // If the direct parent is gone, try to find an ancestor
-        if (!parent) {
+        if (parent) {
           parent = this.layoutManager.root
         }

[Killed] BlockStatement
src/managers/PopoutManager.js:269:107
           parent = this.layoutManager.root
         }
 
-        if (parent && parent.config && (parent.config.type === 'row' || parent.config.type === 'column')) {
-          const targetIndex = Math.min(entry.location.index, parent.children.length)
-          parent.addChild(stack, targetIndex)
-          restored = true
-        }
+        if (parent && parent.config && (parent.config.type === 'row' || parent.config.type === 'column')) {}
       }
 
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] LogicalOperator
src/managers/PopoutManager.js:269:13
           parent = this.layoutManager.root
         }
 
-        if (parent && parent.config && (parent.config.type === 'row' || parent.config.type === 'column')) {
+        if (parent || parent.config && (parent.config.type === 'row' || parent.config.type === 'column')) {
           const targetIndex = Math.min(entry.location.index, parent.children.length)
           parent.addChild(stack, targetIndex)
killedBy: PopoutManager Unit Tests re-integration when original parent was deleted (falls back to root)
statusReason: TypeError: Cannot read properties of null (reading 'config')

[Killed] MethodExpression
src/managers/PopoutManager.js:270:31
         }
 
         if (parent && parent.config && (parent.config.type === 'row' || parent.config.type === 'column')) {
-          const targetIndex = Math.min(entry.location.index, parent.children.length)
+          const targetIndex = Math.max(entry.location.index, parent.children.length)
           parent.addChild(stack, targetIndex)
           restored = true
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Survived] BooleanLiteral
src/managers/PopoutManager.js:272:22
         if (parent && parent.config && (parent.config.type === 'row' || parent.config.type === 'column')) {
           const targetIndex = Math.min(entry.location.index, parent.children.length)
           parent.addChild(stack, targetIndex)
-          restored = true
+          restored = false
         }
       }

[Killed] BooleanLiteral
src/managers/PopoutManager.js:276:11
         }
       }
 
-      if (!restored) {
+      if (restored) {
         // Fallback: original re-integration logic
         if (!this.layoutManager.root) {
killedBy: PopoutManager Unit Tests falls back to root if parent is no longer available
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
src/managers/PopoutManager.js:276:11
         }
       }
 
-      if (!restored) {
+      if (false) {
         // Fallback: original re-integration logic
         if (!this.layoutManager.root) {
killedBy: PopoutManager Unit Tests falls back to root if parent is no longer available
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BooleanLiteral
src/managers/PopoutManager.js:278:13
 
       if (!restored) {
         // Fallback: original re-integration logic
-        if (!this.layoutManager.root) {
+        if (this.layoutManager.root) {
           // Layout is empty, create the stack as root
           const row = this.layoutManager._buildObjectTree({
killedBy: PopoutManager Unit Tests falls back to root if parent is no longer available
statusReason: TypeError: Cannot read properties of null (reading 'config')

[Killed] BlockStatement
src/managers/PopoutManager.js:278:39
 
       if (!restored) {
         // Fallback: original re-integration logic
-        if (!this.layoutManager.root) {
-          // Layout is empty, create the stack as root
-          const row = this.layoutManager._buildObjectTree({
-            type: 'row',
-            content: []
-          })
-          this.layoutManager.root = row
-          this.layoutManager.rootElement.innerHTML = ''
-          this.layoutManager.rootElement.appendChild(row.element)
-          row.addChild(stack)
-          this.layoutManager.root.updateLayout()
-        } else {
+        if (!this.layoutManager.root) {} else {
           // Find the best stack to add to, or create a new split
           const root = this.layoutManager.root
killedBy: PopoutManager Unit Tests falls back to root if parent is no longer available
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] StringLiteral
src/managers/PopoutManager.js:281:19
         if (!this.layoutManager.root) {
           // Layout is empty, create the stack as root
           const row = this.layoutManager._buildObjectTree({
-            type: 'row',
+            type: "",
             content: []
           })
killedBy: PopoutManager Unit Tests falls back to root if parent is no longer available
statusReason: TypeError: Cannot read properties of undefined (reading 'element')

[NoCoverage] ConditionalExpression
src/managers/PopoutManager.js:293:31
           // Find the best stack to add to, or create a new split
           const root = this.layoutManager.root
 
-          if (root.config && (root.config.type === 'row' || root.config.type === 'column')) {
+          if (root.config && (true)) {
             stack.size = 50
             // Reduce existing children proportionally

[NoCoverage] ConditionalExpression
src/managers/PopoutManager.js:293:15
           // Find the best stack to add to, or create a new split
           const root = this.layoutManager.root
 
-          if (root.config && (root.config.type === 'row' || root.config.type === 'column')) {
+          if (false) {
             stack.size = 50
             // Reduce existing children proportionally

[NoCoverage] BlockStatement
src/managers/PopoutManager.js:296:40
           if (root.config && (root.config.type === 'row' || root.config.type === 'column')) {
             stack.size = 50
             // Reduce existing children proportionally
-            root.children.forEach(c => { if (typeof c.size === 'number') c.size *= 0.8 })
+            root.children.forEach(c => {})
             root.addChild(stack)
           } else {

[NoCoverage] EqualityOperator
src/managers/PopoutManager.js:296:46
           if (root.config && (root.config.type === 'row' || root.config.type === 'column')) {
             stack.size = 50
             // Reduce existing children proportionally
-            root.children.forEach(c => { if (typeof c.size === 'number') c.size *= 0.8 })
+            root.children.forEach(c => { if (typeof c.size !== 'number') c.size *= 0.8 })
             root.addChild(stack)
           } else {

[NoCoverage] BlockStatement
src/managers/PopoutManager.js:298:18
             // Reduce existing children proportionally
             root.children.forEach(c => { if (typeof c.size === 'number') c.size *= 0.8 })
             root.addChild(stack)
-          } else {
-            // Root is a stack - wrap in row
-            const wrapper = new RowItem({ type: 'row' }, this.layoutManager)
-            const oldRoot = root
-            oldRoot.size = 50
-            stack.size = 50
-
-            this.layoutManager.rootElement.innerHTML = ''
-            oldRoot.parent = null
-            wrapper.addChild(oldRoot, undefined, true)
-            wrapper.addChild(stack, undefined, true)
-
-            this.layoutManager.root = wrapper
-            this.layoutManager.rootElement.appendChild(wrapper.element)
-            wrapper.updateLayout()
-          }
+          } else {}
         }
       }

[NoCoverage] ObjectLiteral
src/managers/PopoutManager.js:300:41
             root.addChild(stack)
           } else {
             // Root is a stack - wrap in row
-            const wrapper = new RowItem({ type: 'row' }, this.layoutManager)
+            const wrapper = new RowItem({}, this.layoutManager)
             const oldRoot = root
             oldRoot.size = 50

[NoCoverage] StringLiteral
src/managers/PopoutManager.js:305:56
             oldRoot.size = 50
             stack.size = 50
 
-            this.layoutManager.rootElement.innerHTML = ''
+            this.layoutManager.rootElement.innerHTML = "Stryker was here!"
             oldRoot.parent = null
             wrapper.addChild(oldRoot, undefined, true)

[NoCoverage] BooleanLiteral
src/managers/PopoutManager.js:307:50
 
             this.layoutManager.rootElement.innerHTML = ''
             oldRoot.parent = null
-            wrapper.addChild(oldRoot, undefined, true)
+            wrapper.addChild(oldRoot, undefined, false)
             wrapper.addChild(stack, undefined, true)
 

[NoCoverage] BooleanLiteral
src/managers/PopoutManager.js:308:48
             this.layoutManager.rootElement.innerHTML = ''
             oldRoot.parent = null
             wrapper.addChild(oldRoot, undefined, true)
-            wrapper.addChild(stack, undefined, true)
+            wrapper.addChild(stack, undefined, false)
 
             this.layoutManager.root = wrapper

[Survived] ArrowFunction
src/managers/PopoutManager.js:318:30
       }
 
       stack.updateFlex()
-      stack.children.forEach(child => child.emit('resize'))
+      stack.children.forEach(() => undefined)
       this.layoutManager.updateLayout()
       this.layoutManager.showToast('Popout returned to workspace')

[Survived] StringLiteral
src/managers/PopoutManager.js:318:50
       }
 
       stack.updateFlex()
-      stack.children.forEach(child => child.emit('resize'))
+      stack.children.forEach(child => child.emit(""))
       this.layoutManager.updateLayout()
       this.layoutManager.showToast('Popout returned to workspace')

[Killed] BlockStatement
src/managers/PopoutManager.js:331:36
   /**
      * Send a theme change to all open popouts
      */
-  broadcastThemeChange (bodyClass) {
-    this.openPopouts.forEach((entry) => {
-      try {
-        if (entry.window && !entry.window.closed) {
-          entry.window.document.body.className = bodyClass
-        }
-      } catch (e) {
-        // Cross-origin or already closed
-      }
-    })
-  }
+  broadcastThemeChange (bodyClass) {}
 
   /**
killedBy: PopoutManager Unit Tests broadcastThemeChange updates open popout windows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark-mode"
Received: ""

[Killed] BlockStatement
src/managers/PopoutManager.js:332:41
      * Send a theme change to all open popouts
      */
   broadcastThemeChange (bodyClass) {
-    this.openPopouts.forEach((entry) => {
-      try {
-        if (entry.window && !entry.window.closed) {
-          entry.window.document.body.className = bodyClass
-        }
-      } catch (e) {
-        // Cross-origin or already closed
-      }
-    })
+    this.openPopouts.forEach((entry) => {})
   }
 
killedBy: PopoutManager Unit Tests broadcastThemeChange updates open popout windows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark-mode"
Received: ""

[Killed] BlockStatement
src/managers/PopoutManager.js:333:11
      */
   broadcastThemeChange (bodyClass) {
     this.openPopouts.forEach((entry) => {
-      try {
-        if (entry.window && !entry.window.closed) {
-          entry.window.document.body.className = bodyClass
-        }
-      } catch (e) {
+      try {} catch (e) {
         // Cross-origin or already closed
       }
killedBy: PopoutManager Unit Tests broadcastThemeChange updates open popout windows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark-mode"
Received: ""

[Killed] BlockStatement
src/managers/PopoutManager.js:334:51
   broadcastThemeChange (bodyClass) {
     this.openPopouts.forEach((entry) => {
       try {
-        if (entry.window && !entry.window.closed) {
-          entry.window.document.body.className = bodyClass
-        }
+        if (entry.window && !entry.window.closed) {}
       } catch (e) {
         // Cross-origin or already closed
killedBy: PopoutManager Unit Tests broadcastThemeChange updates open popout windows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark-mode"
Received: ""

[Killed] BooleanLiteral
src/managers/PopoutManager.js:334:29
   broadcastThemeChange (bodyClass) {
     this.openPopouts.forEach((entry) => {
       try {
-        if (entry.window && !entry.window.closed) {
+        if (entry.window && entry.window.closed) {
           entry.window.document.body.className = bodyClass
         }
killedBy: PopoutManager Unit Tests broadcastThemeChange updates open popout windows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark-mode"
Received: ""

[Survived] BlockStatement
src/managers/PopoutManager.js:346:26
   /**
      * Close a specific popout
      */
-  closePopout (popoutId) {
-    const entry = this.openPopouts.get(popoutId)
-    if (entry && entry.window) {
-      try { entry.window.close() } catch (e) { /* cross-origin safety */ }
-    }
-  }
+  closePopout (popoutId) {}
 
   /**

[Survived] ConditionalExpression
src/managers/PopoutManager.js:348:9
      */
   closePopout (popoutId) {
     const entry = this.openPopouts.get(popoutId)
-    if (entry && entry.window) {
+    if (true) {
       try { entry.window.close() } catch (e) { /* cross-origin safety */ }
     }

[Survived] LogicalOperator
src/managers/PopoutManager.js:348:9
      */
   closePopout (popoutId) {
     const entry = this.openPopouts.get(popoutId)
-    if (entry && entry.window) {
+    if (entry || entry.window) {
       try { entry.window.close() } catch (e) { /* cross-origin safety */ }
     }

[Survived] BlockStatement
src/managers/PopoutManager.js:349:11
   closePopout (popoutId) {
     const entry = this.openPopouts.get(popoutId)
     if (entry && entry.window) {
-      try { entry.window.close() } catch (e) { /* cross-origin safety */ }
+      try {} catch (e) { /* cross-origin safety */ }
     }
   }

[Survived] BlockStatement
src/managers/PopoutManager.js:356:15
   /**
      * Close all open popouts
      */
-  closeAll () {
-    this.openPopouts.forEach((entry, popoutId) => {
-      this.closePopout(popoutId)
-    })
-  }
+  closeAll () {}
 
   /**

[Survived] BlockStatement
src/managers/PopoutManager.js:357:51
      * Close all open popouts
      */
   closeAll () {
-    this.openPopouts.forEach((entry, popoutId) => {
-      this.closePopout(popoutId)
-    })
+    this.openPopouts.forEach((entry, popoutId) => {})
   }
 

[NoCoverage] BlockStatement
src/managers/PopoutManager.js:365:16
   /**
      * Get the number of open popouts
      */
-  get count () {
-    return this.openPopouts.size
-  }
+  get count () {}
 
   destroy () {

[Survived] BlockStatement
src/managers/PopoutManager.js:369:14
     return this.openPopouts.size
   }
 
-  destroy () {
-    this.closeAll()
-    window.removeEventListener('beforeunload', this._onBeforeUnload)
-    this.openPopouts.clear()
-  }
+  destroy () {}
 }
 
