[Killed] BlockStatement
src/managers/DragManager.js:7:31
 import { RowItem, ColumnItem } from '../core/ContainerItem.js'
 
 export class DragManager {
-  constructor (layoutManager) {
-    this.isDragging = false
-    this.dragItem = null
-    this.proxy = null
-    this.indicator = null
-    this.layoutManager = layoutManager
-    this.sourceType = null
-    this.sourceStack = null
-    this._dragDoc = document
-
-    this.isPendingDrag = false
-    this.pendingStartPos = null
-    this.pendingArgs = null
-
-    this.currentDropZone = null
-
-    this.init()
-  }
+  constructor (layoutManager) {}
 
   init () {
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Survived] BooleanLiteral
src/managers/DragManager.js:8:23
 
 export class DragManager {
   constructor (layoutManager) {
-    this.isDragging = false
+    this.isDragging = true
     this.dragItem = null
     this.proxy = null

[Survived] BooleanLiteral
src/managers/DragManager.js:17:26
     this.sourceStack = null
     this._dragDoc = document
 
-    this.isPendingDrag = false
+    this.isPendingDrag = true
     this.pendingStartPos = null
     this.pendingArgs = null

[Killed] BlockStatement
src/managers/DragManager.js:26:11
     this.init()
   }
 
-  init () {
-    this.handleMouseMove = this.handleMouseMove.bind(this)
-    this.handleMouseUp = this.handleMouseUp.bind(this)
-    this.handlePendingMove = this.handlePendingMove.bind(this)
-    this.handlePendingUp = this.handlePendingUp.bind(this)
-
-    // Touch bindings
-    this.handleTouchMove = (e) => { this.handleMouseMove(e); if (this.isDragging) e.preventDefault() }
-    this.handleTouchEnd = (e) => this.handleMouseUp(e)
-    this.handlePendingTouchMove = (e) => this.handlePendingMove(e)
-    this.handlePendingTouchEnd = (e) => this.handlePendingUp(e)
-
-    // Create indicator element
-    this.indicator = Utils.createElement('div', 'tulweb-drop-indicator', document.body)
-    this.indicator.style.display = 'none'
-    this.indicator.setAttribute('role', 'status')
-    this.indicator.setAttribute('aria-live', 'polite')
-
-    // Create tab drop indicator element
-    this.tabIndicator = Utils.createElement('div', 'tulweb-tab-drop-indicator', document.body)
-    this.tabIndicator.style.display = 'none'
-    this.tabIndicator.setAttribute('role', 'status')
-    this.tabIndicator.setAttribute('aria-live', 'polite')
-  }
+  init () {}
 
   destroy () {
statusReason: TypeError: Cannot read properties of null (reading 'style')

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:33:66
     this.handlePendingUp = this.handlePendingUp.bind(this)
 
     // Touch bindings
-    this.handleTouchMove = (e) => { this.handleMouseMove(e); if (this.isDragging) e.preventDefault() }
+    this.handleTouchMove = (e) => { this.handleMouseMove(e); if (false) e.preventDefault() }
     this.handleTouchEnd = (e) => this.handleMouseUp(e)
     this.handlePendingTouchMove = (e) => this.handlePendingMove(e)

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:33:66
     this.handlePendingUp = this.handlePendingUp.bind(this)
 
     // Touch bindings
-    this.handleTouchMove = (e) => { this.handleMouseMove(e); if (this.isDragging) e.preventDefault() }
+    this.handleTouchMove = (e) => { this.handleMouseMove(e); if (true) e.preventDefault() }
     this.handleTouchEnd = (e) => this.handleMouseUp(e)
     this.handlePendingTouchMove = (e) => this.handlePendingMove(e)

[Survived] ArrowFunction
src/managers/DragManager.js:34:27
 
     // Touch bindings
     this.handleTouchMove = (e) => { this.handleMouseMove(e); if (this.isDragging) e.preventDefault() }
-    this.handleTouchEnd = (e) => this.handleMouseUp(e)
+    this.handleTouchEnd = () => undefined
     this.handlePendingTouchMove = (e) => this.handlePendingMove(e)
     this.handlePendingTouchEnd = (e) => this.handlePendingUp(e)

[Survived] ArrowFunction
src/managers/DragManager.js:35:35
     // Touch bindings
     this.handleTouchMove = (e) => { this.handleMouseMove(e); if (this.isDragging) e.preventDefault() }
     this.handleTouchEnd = (e) => this.handleMouseUp(e)
-    this.handlePendingTouchMove = (e) => this.handlePendingMove(e)
+    this.handlePendingTouchMove = () => undefined
     this.handlePendingTouchEnd = (e) => this.handlePendingUp(e)
 

[Survived] ArrowFunction
src/managers/DragManager.js:36:34
     this.handleTouchMove = (e) => { this.handleMouseMove(e); if (this.isDragging) e.preventDefault() }
     this.handleTouchEnd = (e) => this.handleMouseUp(e)
     this.handlePendingTouchMove = (e) => this.handlePendingMove(e)
-    this.handlePendingTouchEnd = (e) => this.handlePendingUp(e)
+    this.handlePendingTouchEnd = () => undefined
 
     // Create indicator element

[Survived] StringLiteral
src/managers/DragManager.js:40:36
 
     // Create indicator element
     this.indicator = Utils.createElement('div', 'tulweb-drop-indicator', document.body)
-    this.indicator.style.display = 'none'
+    this.indicator.style.display = ""
     this.indicator.setAttribute('role', 'status')
     this.indicator.setAttribute('aria-live', 'polite')

[Killed] StringLiteral
src/managers/DragManager.js:45:45
     this.indicator.setAttribute('aria-live', 'polite')
 
     // Create tab drop indicator element
-    this.tabIndicator = Utils.createElement('div', 'tulweb-tab-drop-indicator', document.body)
+    this.tabIndicator = Utils.createElement("", 'tulweb-tab-drop-indicator', document.body)
     this.tabIndicator.style.display = 'none'
     this.tabIndicator.setAttribute('role', 'status')
killedBy: PopoutManager Unit Tests LayoutManager has PopoutManager initialized when enabled
statusReason: InvalidCharacterError: "" did not match the Name production

[Survived] StringLiteral
src/managers/DragManager.js:45:52
     this.indicator.setAttribute('aria-live', 'polite')
 
     // Create tab drop indicator element
-    this.tabIndicator = Utils.createElement('div', 'tulweb-tab-drop-indicator', document.body)
+    this.tabIndicator = Utils.createElement('div', "", document.body)
     this.tabIndicator.style.display = 'none'
     this.tabIndicator.setAttribute('role', 'status')

[Survived] StringLiteral
src/managers/DragManager.js:47:44
     // Create tab drop indicator element
     this.tabIndicator = Utils.createElement('div', 'tulweb-tab-drop-indicator', document.body)
     this.tabIndicator.style.display = 'none'
-    this.tabIndicator.setAttribute('role', 'status')
+    this.tabIndicator.setAttribute('role', "")
     this.tabIndicator.setAttribute('aria-live', 'polite')
   }

[Survived] BlockStatement
src/managers/DragManager.js:51:14
     this.tabIndicator.setAttribute('aria-live', 'polite')
   }
 
-  destroy () {
-    if (this.indicator && this.indicator.parentElement) {
-      this.indicator.parentElement.removeChild(this.indicator)
-    }
-    if (this.tabIndicator && this.tabIndicator.parentElement) {
-      this.tabIndicator.parentElement.removeChild(this.tabIndicator)
-    }
-    this.layoutManager = null
-  }
+  destroy () {}
 
   pendDrag (evt, itemConfig, type, sourceStack, title) {

[Survived] LogicalOperator
src/managers/DragManager.js:52:9
   }
 
   destroy () {
-    if (this.indicator && this.indicator.parentElement) {
+    if (this.indicator || this.indicator.parentElement) {
       this.indicator.parentElement.removeChild(this.indicator)
     }

[Survived] BlockStatement
src/managers/DragManager.js:52:57
   }
 
   destroy () {
-    if (this.indicator && this.indicator.parentElement) {
-      this.indicator.parentElement.removeChild(this.indicator)
-    }
+    if (this.indicator && this.indicator.parentElement) {}
     if (this.tabIndicator && this.tabIndicator.parentElement) {
       this.tabIndicator.parentElement.removeChild(this.tabIndicator)

[Survived] ConditionalExpression
src/managers/DragManager.js:55:9
     if (this.indicator && this.indicator.parentElement) {
       this.indicator.parentElement.removeChild(this.indicator)
     }
-    if (this.tabIndicator && this.tabIndicator.parentElement) {
+    if (false) {
       this.tabIndicator.parentElement.removeChild(this.tabIndicator)
     }

[Survived] LogicalOperator
src/managers/DragManager.js:55:9
     if (this.indicator && this.indicator.parentElement) {
       this.indicator.parentElement.removeChild(this.indicator)
     }
-    if (this.tabIndicator && this.tabIndicator.parentElement) {
+    if (this.tabIndicator || this.tabIndicator.parentElement) {
       this.tabIndicator.parentElement.removeChild(this.tabIndicator)
     }

[Killed] BlockStatement
src/managers/DragManager.js:61:56
     this.layoutManager = null
   }
 
-  pendDrag (evt, itemConfig, type, sourceStack, title) {
-    this.isPendingDrag = true
-    this._dragDoc = evt.target ? (evt.target.ownerDocument || document) : document
-
-    const isTouch = evt.touches && evt.touches.length > 0
-    const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
-    const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
-
-    this.pendingStartPos = { x: clientX, y: clientY }
-    this.pendingArgs = { itemConfig, type, sourceStack, title }
-
-    if (isTouch) {
-      this._dragDoc.addEventListener('touchmove', this.handlePendingTouchMove, { passive: false })
-      this._dragDoc.addEventListener('touchend', this.handlePendingTouchEnd)
-    } else {
-      this._dragDoc.addEventListener('mousemove', this.handlePendingMove)
-      this._dragDoc.addEventListener('mouseup', this.handlePendingUp)
-    }
-  }
+  pendDrag (evt, itemConfig, type, sourceStack, title) {}
 
   cancelDrag () {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/managers/DragManager.js:62:26
   }
 
   pendDrag (evt, itemConfig, type, sourceStack, title) {
-    this.isPendingDrag = true
+    this.isPendingDrag = false
     this._dragDoc = evt.target ? (evt.target.ownerDocument || document) : document
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:63:35
 
   pendDrag (evt, itemConfig, type, sourceStack, title) {
     this.isPendingDrag = true
-    this._dragDoc = evt.target ? (evt.target.ownerDocument || document) : document
+    this._dragDoc = evt.target ? (true) : document
 
     const isTouch = evt.touches && evt.touches.length > 0

[NoCoverage] LogicalOperator
src/managers/DragManager.js:63:35
 
   pendDrag (evt, itemConfig, type, sourceStack, title) {
     this.isPendingDrag = true
-    this._dragDoc = evt.target ? (evt.target.ownerDocument || document) : document
+    this._dragDoc = evt.target ? (evt.target.ownerDocument && document) : document
 
     const isTouch = evt.touches && evt.touches.length > 0

[Killed] LogicalOperator
src/managers/DragManager.js:65:21
     this.isPendingDrag = true
     this._dragDoc = evt.target ? (evt.target.ownerDocument || document) : document
 
-    const isTouch = evt.touches && evt.touches.length > 0
+    const isTouch = evt.touches || evt.touches.length > 0
     const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
     const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/managers/DragManager.js:65:21
     this.isPendingDrag = true
     this._dragDoc = evt.target ? (evt.target.ownerDocument || document) : document
 
-    const isTouch = evt.touches && evt.touches.length > 0
+    const isTouch = true
     const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
     const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ObjectLiteral
src/managers/DragManager.js:69:28
     const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
     const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
 
-    this.pendingStartPos = { x: clientX, y: clientY }
+    this.pendingStartPos = {}
     this.pendingArgs = { itemConfig, type, sourceStack, title }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
src/managers/DragManager.js:70:24
     const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
 
     this.pendingStartPos = { x: clientX, y: clientY }
-    this.pendingArgs = { itemConfig, type, sourceStack, title }
+    this.pendingArgs = {}
 
     if (isTouch) {
statusReason: TypeError: Cannot read properties of undefined (reading 'title')

[Survived] ConditionalExpression
src/managers/DragManager.js:72:9
     this.pendingStartPos = { x: clientX, y: clientY }
     this.pendingArgs = { itemConfig, type, sourceStack, title }
 
-    if (isTouch) {
+    if (false) {
       this._dragDoc.addEventListener('touchmove', this.handlePendingTouchMove, { passive: false })
       this._dragDoc.addEventListener('touchend', this.handlePendingTouchEnd)

[NoCoverage] BlockStatement
src/managers/DragManager.js:72:18
     this.pendingStartPos = { x: clientX, y: clientY }
     this.pendingArgs = { itemConfig, type, sourceStack, title }
 
-    if (isTouch) {
-      this._dragDoc.addEventListener('touchmove', this.handlePendingTouchMove, { passive: false })
-      this._dragDoc.addEventListener('touchend', this.handlePendingTouchEnd)
-    } else {
+    if (isTouch) {} else {
       this._dragDoc.addEventListener('mousemove', this.handlePendingMove)
       this._dragDoc.addEventListener('mouseup', this.handlePendingUp)

[NoCoverage] BooleanLiteral
src/managers/DragManager.js:73:91
     this.pendingArgs = { itemConfig, type, sourceStack, title }
 
     if (isTouch) {
-      this._dragDoc.addEventListener('touchmove', this.handlePendingTouchMove, { passive: false })
+      this._dragDoc.addEventListener('touchmove', this.handlePendingTouchMove, { passive: true })
       this._dragDoc.addEventListener('touchend', this.handlePendingTouchEnd)
     } else {

[NoCoverage] ObjectLiteral
src/managers/DragManager.js:73:80
     this.pendingArgs = { itemConfig, type, sourceStack, title }
 
     if (isTouch) {
-      this._dragDoc.addEventListener('touchmove', this.handlePendingTouchMove, { passive: false })
+      this._dragDoc.addEventListener('touchmove', this.handlePendingTouchMove, {})
       this._dragDoc.addEventListener('touchend', this.handlePendingTouchEnd)
     } else {

[Survived] BlockStatement
src/managers/DragManager.js:75:12
     if (isTouch) {
       this._dragDoc.addEventListener('touchmove', this.handlePendingTouchMove, { passive: false })
       this._dragDoc.addEventListener('touchend', this.handlePendingTouchEnd)
-    } else {
-      this._dragDoc.addEventListener('mousemove', this.handlePendingMove)
-      this._dragDoc.addEventListener('mouseup', this.handlePendingUp)
-    }
+    } else {}
   }
 

[Survived] StringLiteral
src/managers/DragManager.js:76:38
       this._dragDoc.addEventListener('touchmove', this.handlePendingTouchMove, { passive: false })
       this._dragDoc.addEventListener('touchend', this.handlePendingTouchEnd)
     } else {
-      this._dragDoc.addEventListener('mousemove', this.handlePendingMove)
+      this._dragDoc.addEventListener("", this.handlePendingMove)
       this._dragDoc.addEventListener('mouseup', this.handlePendingUp)
     }

[Killed] BlockStatement
src/managers/DragManager.js:81:17
     }
   }
 
-  cancelDrag () {
-    if (this.isPendingDrag) {
-      this.handlePendingUp()
-    }
-    if (this.isDragging) {
-      this.handleMouseUp()
-    }
-    this.isPendingDrag = false
-    this.isDragging = false
-  }
+  cancelDrag () {}
 
   handlePendingMove (evt) {
killedBy: DragManager Integration Tests cancel pending drag resets state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ConditionalExpression
src/managers/DragManager.js:82:9
   }
 
   cancelDrag () {
-    if (this.isPendingDrag) {
+    if (false) {
       this.handlePendingUp()
     }

[Survived] BlockStatement
src/managers/DragManager.js:82:29
   }
 
   cancelDrag () {
-    if (this.isPendingDrag) {
-      this.handlePendingUp()
-    }
+    if (this.isPendingDrag) {}
     if (this.isDragging) {
       this.handleMouseUp()

[Survived] ConditionalExpression
src/managers/DragManager.js:85:9
     if (this.isPendingDrag) {
       this.handlePendingUp()
     }
-    if (this.isDragging) {
+    if (true) {
       this.handleMouseUp()
     }

[NoCoverage] BlockStatement
src/managers/DragManager.js:85:26
     if (this.isPendingDrag) {
       this.handlePendingUp()
     }
-    if (this.isDragging) {
-      this.handleMouseUp()
-    }
+    if (this.isDragging) {}
     this.isPendingDrag = false
     this.isDragging = false

[Killed] BooleanLiteral
src/managers/DragManager.js:88:26
     if (this.isDragging) {
       this.handleMouseUp()
     }
-    this.isPendingDrag = false
+    this.isPendingDrag = true
     this.isDragging = false
   }
killedBy: DragManager Integration Tests cancel pending drag resets state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] BooleanLiteral
src/managers/DragManager.js:89:23
       this.handleMouseUp()
     }
     this.isPendingDrag = false
-    this.isDragging = false
+    this.isDragging = true
   }
 

[Killed] BlockStatement
src/managers/DragManager.js:92:27
     this.isDragging = false
   }
 
-  handlePendingMove (evt) {
-    if (!this.isPendingDrag) return
-    const isTouch = evt.touches && evt.touches.length > 0
-    const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
-    const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
-
-    const dx = clientX - this.pendingStartPos.x
-    const dy = clientY - this.pendingStartPos.y
-    if (Math.abs(dx) > 8 || Math.abs(dy) > 8) {
-      this.isPendingDrag = false
-      this._dragDoc.removeEventListener('mousemove', this.handlePendingMove)
-      this._dragDoc.removeEventListener('mouseup', this.handlePendingUp)
-      this._dragDoc.removeEventListener('touchmove', this.handlePendingTouchMove)
-      this._dragDoc.removeEventListener('touchend', this.handlePendingTouchEnd)
-
-      const a = this.pendingArgs
-      this.startDrag(evt, a.itemConfig, a.type, a.sourceStack, a.title)
-    }
-  }
+  handlePendingMove (evt) {}
 
   handlePendingUp (evt) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/managers/DragManager.js:93:9
   }
 
   handlePendingMove (evt) {
-    if (!this.isPendingDrag) return
+    if (true) return
     const isTouch = evt.touches && evt.touches.length > 0
     const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/managers/DragManager.js:93:9
   }
 
   handlePendingMove (evt) {
-    if (!this.isPendingDrag) return
+    if (this.isPendingDrag) return
     const isTouch = evt.touches && evt.touches.length > 0
     const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/managers/DragManager.js:94:21
 
   handlePendingMove (evt) {
     if (!this.isPendingDrag) return
-    const isTouch = evt.touches && evt.touches.length > 0
+    const isTouch = evt.touches || evt.touches.length > 0
     const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
     const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/managers/DragManager.js:94:21
 
   handlePendingMove (evt) {
     if (!this.isPendingDrag) return
-    const isTouch = evt.touches && evt.touches.length > 0
+    const isTouch = true
     const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
     const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] ArithmeticOperator
src/managers/DragManager.js:98:16
     const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
     const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
 
-    const dx = clientX - this.pendingStartPos.x
+    const dx = clientX + this.pendingStartPos.x
     const dy = clientY - this.pendingStartPos.y
     if (Math.abs(dx) > 8 || Math.abs(dy) > 8) {

[Survived] ArithmeticOperator
src/managers/DragManager.js:99:16
     const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
 
     const dx = clientX - this.pendingStartPos.x
-    const dy = clientY - this.pendingStartPos.y
+    const dy = clientY + this.pendingStartPos.y
     if (Math.abs(dx) > 8 || Math.abs(dy) > 8) {
       this.isPendingDrag = false

[Killed] BlockStatement
src/managers/DragManager.js:100:47
 
     const dx = clientX - this.pendingStartPos.x
     const dy = clientY - this.pendingStartPos.y
-    if (Math.abs(dx) > 8 || Math.abs(dy) > 8) {
-      this.isPendingDrag = false
-      this._dragDoc.removeEventListener('mousemove', this.handlePendingMove)
-      this._dragDoc.removeEventListener('mouseup', this.handlePendingUp)
-      this._dragDoc.removeEventListener('touchmove', this.handlePendingTouchMove)
-      this._dragDoc.removeEventListener('touchend', this.handlePendingTouchEnd)
-
-      const a = this.pendingArgs
-      this.startDrag(evt, a.itemConfig, a.type, a.sourceStack, a.title)
-    }
+    if (Math.abs(dx) > 8 || Math.abs(dy) > 8) {}
   }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/managers/DragManager.js:100:9
 
     const dx = clientX - this.pendingStartPos.x
     const dy = clientY - this.pendingStartPos.y
-    if (Math.abs(dx) > 8 || Math.abs(dy) > 8) {
+    if (false) {
       this.isPendingDrag = false
       this._dragDoc.removeEventListener('mousemove', this.handlePendingMove)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/managers/DragManager.js:101:28
     const dx = clientX - this.pendingStartPos.x
     const dy = clientY - this.pendingStartPos.y
     if (Math.abs(dx) > 8 || Math.abs(dy) > 8) {
-      this.isPendingDrag = false
+      this.isPendingDrag = true
       this._dragDoc.removeEventListener('mousemove', this.handlePendingMove)
       this._dragDoc.removeEventListener('mouseup', this.handlePendingUp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] StringLiteral
src/managers/DragManager.js:102:41
     const dy = clientY - this.pendingStartPos.y
     if (Math.abs(dx) > 8 || Math.abs(dy) > 8) {
       this.isPendingDrag = false
-      this._dragDoc.removeEventListener('mousemove', this.handlePendingMove)
+      this._dragDoc.removeEventListener("", this.handlePendingMove)
       this._dragDoc.removeEventListener('mouseup', this.handlePendingUp)
       this._dragDoc.removeEventListener('touchmove', this.handlePendingTouchMove)

[Survived] StringLiteral
src/managers/DragManager.js:103:41
     if (Math.abs(dx) > 8 || Math.abs(dy) > 8) {
       this.isPendingDrag = false
       this._dragDoc.removeEventListener('mousemove', this.handlePendingMove)
-      this._dragDoc.removeEventListener('mouseup', this.handlePendingUp)
+      this._dragDoc.removeEventListener("", this.handlePendingUp)
       this._dragDoc.removeEventListener('touchmove', this.handlePendingTouchMove)
       this._dragDoc.removeEventListener('touchend', this.handlePendingTouchEnd)

[Survived] StringLiteral
src/managers/DragManager.js:104:41
       this.isPendingDrag = false
       this._dragDoc.removeEventListener('mousemove', this.handlePendingMove)
       this._dragDoc.removeEventListener('mouseup', this.handlePendingUp)
-      this._dragDoc.removeEventListener('touchmove', this.handlePendingTouchMove)
+      this._dragDoc.removeEventListener("", this.handlePendingTouchMove)
       this._dragDoc.removeEventListener('touchend', this.handlePendingTouchEnd)
 

[Survived] BlockStatement
src/managers/DragManager.js:112:25
     }
   }
 
-  handlePendingUp (evt) {
-    this.isPendingDrag = false
-    this._dragDoc.removeEventListener('mousemove', this.handlePendingMove)
-    this._dragDoc.removeEventListener('mouseup', this.handlePendingUp)
-    this._dragDoc.removeEventListener('touchmove', this.handlePendingTouchMove)
-    this._dragDoc.removeEventListener('touchend', this.handlePendingTouchEnd)
-  }
+  handlePendingUp (evt) {}
 
   startDrag (evt, itemConfig, type, sourceStack, title) {

[Survived] BooleanLiteral
src/managers/DragManager.js:113:26
   }
 
   handlePendingUp (evt) {
-    this.isPendingDrag = false
+    this.isPendingDrag = true
     this._dragDoc.removeEventListener('mousemove', this.handlePendingMove)
     this._dragDoc.removeEventListener('mouseup', this.handlePendingUp)

[Survived] StringLiteral
src/managers/DragManager.js:117:39
     this._dragDoc.removeEventListener('mousemove', this.handlePendingMove)
     this._dragDoc.removeEventListener('mouseup', this.handlePendingUp)
     this._dragDoc.removeEventListener('touchmove', this.handlePendingTouchMove)
-    this._dragDoc.removeEventListener('touchend', this.handlePendingTouchEnd)
+    this._dragDoc.removeEventListener("", this.handlePendingTouchEnd)
   }
 

[Killed] BlockStatement
src/managers/DragManager.js:120:57
     this._dragDoc.removeEventListener('touchend', this.handlePendingTouchEnd)
   }
 
-  startDrag (evt, itemConfig, type, sourceStack, title) {
-    this.isDragging = true
-    // Deep-clone external configs to prevent mutating the original drag source
-    this.dragItem = type === 'external' ? structuredClone(itemConfig) : itemConfig
-    this.sourceType = type
-    this.sourceStack = sourceStack
-
-    // Create UI proxy in the document where the drag originated
-    this.proxy = Utils.createElement('div', 'tulweb-drag-proxy', this._dragDoc.body)
-    this.proxy.textContent = title || itemConfig.title || 'Component'
-    this.updateProxyPos(evt)
-
-    if (evt.touches) {
-      this._dragDoc.addEventListener('touchmove', this.handleTouchMove, { passive: false })
-      this._dragDoc.addEventListener('touchend', this.handleTouchEnd)
-    } else {
-      this._dragDoc.addEventListener('mousemove', this.handleMouseMove)
-      this._dragDoc.addEventListener('mouseup', this.handleMouseUp)
-    }
-
-    // If dragging from a stack, make it look active but keep it in the DOM until drop
-    if (sourceStack) {
-      // Visual feedback only for now
-    }
-  }
+  startDrag (evt, itemConfig, type, sourceStack, title) {}
 
   updateProxyPos (evt) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/managers/DragManager.js:121:23
   }
 
   startDrag (evt, itemConfig, type, sourceStack, title) {
-    this.isDragging = true
+    this.isDragging = false
     // Deep-clone external configs to prevent mutating the original drag source
     this.dragItem = type === 'external' ? structuredClone(itemConfig) : itemConfig
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/managers/DragManager.js:123:21
   startDrag (evt, itemConfig, type, sourceStack, title) {
     this.isDragging = true
     // Deep-clone external configs to prevent mutating the original drag source
-    this.dragItem = type === 'external' ? structuredClone(itemConfig) : itemConfig
+    this.dragItem = type !== 'external' ? structuredClone(itemConfig) : itemConfig
     this.sourceType = type
     this.sourceStack = sourceStack
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
src/managers/DragManager.js:123:21
   startDrag (evt, itemConfig, type, sourceStack, title) {
     this.isDragging = true
     // Deep-clone external configs to prevent mutating the original drag source
-    this.dragItem = type === 'external' ? structuredClone(itemConfig) : itemConfig
+    this.dragItem = true ? structuredClone(itemConfig) : itemConfig
     this.sourceType = type
     this.sourceStack = sourceStack
statusReason: Error: expect(received).toBeNull()

[Killed] StringLiteral
src/managers/DragManager.js:128:38
     this.sourceStack = sourceStack
 
     // Create UI proxy in the document where the drag originated
-    this.proxy = Utils.createElement('div', 'tulweb-drag-proxy', this._dragDoc.body)
+    this.proxy = Utils.createElement("", 'tulweb-drag-proxy', this._dragDoc.body)
     this.proxy.textContent = title || itemConfig.title || 'Component'
     this.updateProxyPos(evt)
statusReason: InvalidCharacterError: "" did not match the Name production

[Survived] StringLiteral
src/managers/DragManager.js:128:45
     this.sourceStack = sourceStack
 
     // Create UI proxy in the document where the drag originated
-    this.proxy = Utils.createElement('div', 'tulweb-drag-proxy', this._dragDoc.body)
+    this.proxy = Utils.createElement('div', "", this._dragDoc.body)
     this.proxy.textContent = title || itemConfig.title || 'Component'
     this.updateProxyPos(evt)

[Survived] ConditionalExpression
src/managers/DragManager.js:129:30
 
     // Create UI proxy in the document where the drag originated
     this.proxy = Utils.createElement('div', 'tulweb-drag-proxy', this._dragDoc.body)
-    this.proxy.textContent = title || itemConfig.title || 'Component'
+    this.proxy.textContent = false
     this.updateProxyPos(evt)
 
