[Survived] ConditionalExpression
src/managers/DragManager.js:129:30
 
     // Create UI proxy in the document where the drag originated
     this.proxy = Utils.createElement('div', 'tulweb-drag-proxy', this._dragDoc.body)
-    this.proxy.textContent = title || itemConfig.title || 'Component'
+    this.proxy.textContent = false || 'Component'
     this.updateProxyPos(evt)
 

[NoCoverage] BlockStatement
src/managers/DragManager.js:132:22
     this.proxy.textContent = title || itemConfig.title || 'Component'
     this.updateProxyPos(evt)
 
-    if (evt.touches) {
-      this._dragDoc.addEventListener('touchmove', this.handleTouchMove, { passive: false })
-      this._dragDoc.addEventListener('touchend', this.handleTouchEnd)
-    } else {
+    if (evt.touches) {} else {
       this._dragDoc.addEventListener('mousemove', this.handleMouseMove)
       this._dragDoc.addEventListener('mouseup', this.handleMouseUp)

[Survived] ConditionalExpression
src/managers/DragManager.js:132:9
     this.proxy.textContent = title || itemConfig.title || 'Component'
     this.updateProxyPos(evt)
 
-    if (evt.touches) {
+    if (true) {
       this._dragDoc.addEventListener('touchmove', this.handleTouchMove, { passive: false })
       this._dragDoc.addEventListener('touchend', this.handleTouchEnd)

[NoCoverage] BooleanLiteral
src/managers/DragManager.js:133:84
     this.updateProxyPos(evt)
 
     if (evt.touches) {
-      this._dragDoc.addEventListener('touchmove', this.handleTouchMove, { passive: false })
+      this._dragDoc.addEventListener('touchmove', this.handleTouchMove, { passive: true })
       this._dragDoc.addEventListener('touchend', this.handleTouchEnd)
     } else {

[Survived] BlockStatement
src/managers/DragManager.js:135:12
     if (evt.touches) {
       this._dragDoc.addEventListener('touchmove', this.handleTouchMove, { passive: false })
       this._dragDoc.addEventListener('touchend', this.handleTouchEnd)
-    } else {
-      this._dragDoc.addEventListener('mousemove', this.handleMouseMove)
-      this._dragDoc.addEventListener('mouseup', this.handleMouseUp)
-    }
+    } else {}
 
     // If dragging from a stack, make it look active but keep it in the DOM until drop

[Survived] ConditionalExpression
src/managers/DragManager.js:141:9
     }
 
     // If dragging from a stack, make it look active but keep it in the DOM until drop
-    if (sourceStack) {
+    if (true) {
       // Visual feedback only for now
     }

[Survived] ConditionalExpression
src/managers/DragManager.js:141:9
     }
 
     // If dragging from a stack, make it look active but keep it in the DOM until drop
-    if (sourceStack) {
+    if (false) {
       // Visual feedback only for now
     }

[Survived] BlockStatement
src/managers/DragManager.js:146:24
     }
   }
 
-  updateProxyPos (evt) {
-    if (this.proxy) {
-      const isTouch = evt.touches && evt.touches.length > 0
-      const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
-      const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
-      this.proxy.style.left = (clientX + 10) + 'px'
-      this.proxy.style.top = (clientY + 10) + 'px'
-    }
-  }
+  updateProxyPos (evt) {}
 
   handleMouseMove (evt) {

[Survived] BlockStatement
src/managers/DragManager.js:147:21
   }
 
   updateProxyPos (evt) {
-    if (this.proxy) {
-      const isTouch = evt.touches && evt.touches.length > 0
-      const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
-      const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
-      this.proxy.style.left = (clientX + 10) + 'px'
-      this.proxy.style.top = (clientY + 10) + 'px'
-    }
+    if (this.proxy) {}
   }
 

[Survived] ConditionalExpression
src/managers/DragManager.js:147:9
   }
 
   updateProxyPos (evt) {
-    if (this.proxy) {
+    if (false) {
       const isTouch = evt.touches && evt.touches.length > 0
       const clientX = isTouch ? evt.touches[0].clientX : evt.clientX

[Killed] ConditionalExpression
src/managers/DragManager.js:148:23
 
   updateProxyPos (evt) {
     if (this.proxy) {
-      const isTouch = evt.touches && evt.touches.length > 0
+      const isTouch = true
       const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
       const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] LogicalOperator
src/managers/DragManager.js:148:23
 
   updateProxyPos (evt) {
     if (this.proxy) {
-      const isTouch = evt.touches && evt.touches.length > 0
+      const isTouch = evt.touches || evt.touches.length > 0
       const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
       const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] ArithmeticOperator
src/managers/DragManager.js:151:32
       const isTouch = evt.touches && evt.touches.length > 0
       const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
       const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
-      this.proxy.style.left = (clientX + 10) + 'px'
+      this.proxy.style.left = (clientX - 10) + 'px'
       this.proxy.style.top = (clientY + 10) + 'px'
     }

[Survived] ArithmeticOperator
src/managers/DragManager.js:152:31
       const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
       const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
       this.proxy.style.left = (clientX + 10) + 'px'
-      this.proxy.style.top = (clientY + 10) + 'px'
+      this.proxy.style.top = (clientY - 10) + 'px'
     }
   }

[Survived] StringLiteral
src/managers/DragManager.js:152:47
       const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
       const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
       this.proxy.style.left = (clientX + 10) + 'px'
-      this.proxy.style.top = (clientY + 10) + 'px'
+      this.proxy.style.top = (clientY + 10) + ""
     }
   }

[Killed] BlockStatement
src/managers/DragManager.js:156:25
     }
   }
 
-  handleMouseMove (evt) {
-    if (!this.isDragging) return
-    evt.preventDefault()
-    this.updateProxyPos(evt)
-    this.findDropZone(evt)
-  }
+  handleMouseMove (evt) {}
 
   handleMouseUp (evt) {
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Killed] BooleanLiteral
src/managers/DragManager.js:157:9
   }
 
   handleMouseMove (evt) {
-    if (!this.isDragging) return
+    if (this.isDragging) return
     evt.preventDefault()
     this.updateProxyPos(evt)
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Killed] ConditionalExpression
src/managers/DragManager.js:157:9
   }
 
   handleMouseMove (evt) {
-    if (!this.isDragging) return
+    if (true) return
     evt.preventDefault()
     this.updateProxyPos(evt)
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Killed] BooleanLiteral
src/managers/DragManager.js:164:9
   }
 
   handleMouseUp (evt) {
-    if (!this.isDragging) return
+    if (this.isDragging) return
     this.isDragging = false
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/managers/DragManager.js:164:9
   }
 
   handleMouseUp (evt) {
-    if (!this.isDragging) return
+    if (true) return
     this.isDragging = false
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/managers/DragManager.js:165:23
 
   handleMouseUp (evt) {
     if (!this.isDragging) return
-    this.isDragging = false
+    this.isDragging = true
 
     this._dragDoc.removeEventListener('mousemove', this.handleMouseMove)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] StringLiteral
src/managers/DragManager.js:167:39
     if (!this.isDragging) return
     this.isDragging = false
 
-    this._dragDoc.removeEventListener('mousemove', this.handleMouseMove)
+    this._dragDoc.removeEventListener("", this.handleMouseMove)
     this._dragDoc.removeEventListener('mouseup', this.handleMouseUp)
     this._dragDoc.removeEventListener('touchmove', this.handleTouchMove)

[Survived] BlockStatement
src/managers/DragManager.js:172:21
     this._dragDoc.removeEventListener('touchmove', this.handleTouchMove)
     this._dragDoc.removeEventListener('touchend', this.handleTouchEnd)
 
-    if (this.proxy) {
-      if (this.proxy.parentElement) {
-        this.proxy.parentElement.removeChild(this.proxy)
-      }
-      this.proxy = null
-    }
+    if (this.proxy) {}
 
     if (this.indicator) {

[Survived] ConditionalExpression
src/managers/DragManager.js:172:9
     this._dragDoc.removeEventListener('touchmove', this.handleTouchMove)
     this._dragDoc.removeEventListener('touchend', this.handleTouchEnd)
 
-    if (this.proxy) {
+    if (true) {
       if (this.proxy.parentElement) {
         this.proxy.parentElement.removeChild(this.proxy)

[Survived] ConditionalExpression
src/managers/DragManager.js:173:11
     this._dragDoc.removeEventListener('touchend', this.handleTouchEnd)
 
     if (this.proxy) {
-      if (this.proxy.parentElement) {
+      if (false) {
         this.proxy.parentElement.removeChild(this.proxy)
       }

[Survived] ConditionalExpression
src/managers/DragManager.js:173:11
     this._dragDoc.removeEventListener('touchend', this.handleTouchEnd)
 
     if (this.proxy) {
-      if (this.proxy.parentElement) {
+      if (true) {
         this.proxy.parentElement.removeChild(this.proxy)
       }

[Survived] ConditionalExpression
src/managers/DragManager.js:179:9
       this.proxy = null
     }
 
-    if (this.indicator) {
+    if (true) {
       this.indicator.style.display = 'none'
       this.indicator.classList.remove('visible')

[Survived] BlockStatement
src/managers/DragManager.js:179:25
       this.proxy = null
     }
 
-    if (this.indicator) {
-      this.indicator.style.display = 'none'
-      this.indicator.classList.remove('visible')
-    }
+    if (this.indicator) {}
 
     if (this.tabIndicator) {

[Survived] StringLiteral
src/managers/DragManager.js:180:38
     }
 
     if (this.indicator) {
-      this.indicator.style.display = 'none'
+      this.indicator.style.display = ""
       this.indicator.classList.remove('visible')
     }

[Survived] ConditionalExpression
src/managers/DragManager.js:184:9
       this.indicator.classList.remove('visible')
     }
 
-    if (this.tabIndicator) {
+    if (false) {
       this.tabIndicator.style.display = 'none'
       this.tabIndicator.classList.remove('visible')

[Survived] ConditionalExpression
src/managers/DragManager.js:184:9
       this.indicator.classList.remove('visible')
     }
 
-    if (this.tabIndicator) {
+    if (true) {
       this.tabIndicator.style.display = 'none'
       this.tabIndicator.classList.remove('visible')

[Killed] ConditionalExpression
src/managers/DragManager.js:189:9
       this.tabIndicator.classList.remove('visible')
     }
 
-    if (this.currentDropZone) {
+    if (false) {
       this.executeDrop()
     } else if (this.sourceType === 'tab' && this.sourceStack && this.dragItem) {
statusReason: Error: expect(received).toBeNull()

[Killed] BlockStatement
src/managers/DragManager.js:189:31
       this.tabIndicator.classList.remove('visible')
     }
 
-    if (this.currentDropZone) {
-      this.executeDrop()
-    } else if (this.sourceType === 'tab' && this.sourceStack && this.dragItem) {
+    if (this.currentDropZone) {} else if (this.sourceType === 'tab' && this.sourceStack && this.dragItem) {
       // Dragged outside, maybe remove or just cancel? Currently cancel.
     }
statusReason: Error: expect(received).toBeNull()

[Survived] EqualityOperator
src/managers/DragManager.js:191:16
 
     if (this.currentDropZone) {
       this.executeDrop()
-    } else if (this.sourceType === 'tab' && this.sourceStack && this.dragItem) {
+    } else if (this.sourceType !== 'tab' && this.sourceStack && this.dragItem) {
       // Dragged outside, maybe remove or just cancel? Currently cancel.
     }

[Survived] ConditionalExpression
src/managers/DragManager.js:191:16
 
     if (this.currentDropZone) {
       this.executeDrop()
-    } else if (this.sourceType === 'tab' && this.sourceStack && this.dragItem) {
+    } else if (false) {
       // Dragged outside, maybe remove or just cancel? Currently cancel.
     }

[Killed] LogicalOperator
src/managers/DragManager.js:201:21
   }
 
   findDropZone (evt) {
-    const isTouch = evt.touches && evt.touches.length > 0
+    const isTouch = evt.touches || evt.touches.length > 0
     const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
     const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/managers/DragManager.js:201:21
   }
 
   findDropZone (evt) {
-    const isTouch = evt.touches && evt.touches.length > 0
+    const isTouch = true
     const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
     const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/managers/DragManager.js:207:9
 
     // Find what we are over. The proxy has pointer-events: none, so this gets the actual element
     const el = this._dragDoc.elementFromPoint(clientX, clientY)
-    if (!el) return this.hideIndicator()
+    if (true) return this.hideIndicator()
 
     // Find the closest Layout Item
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Killed] BooleanLiteral
src/managers/DragManager.js:207:9
 
     // Find what we are over. The proxy has pointer-events: none, so this gets the actual element
     const el = this._dragDoc.elementFromPoint(clientX, clientY)
-    if (!el) return this.hideIndicator()
+    if (el) return this.hideIndicator()
 
     // Find the closest Layout Item
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Killed] EqualityOperator
src/managers/DragManager.js:212:25
     // Find the closest Layout Item
     let targetItem = null
     let currentEl = el
-    while (currentEl && currentEl !== this._dragDoc.body) {
+    while (currentEl && currentEl === this._dragDoc.body) {
       if (currentEl.tulwebItem) {
         targetItem = currentEl.tulwebItem
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Killed] ConditionalExpression
src/managers/DragManager.js:212:12
     // Find the closest Layout Item
     let targetItem = null
     let currentEl = el
-    while (currentEl && currentEl !== this._dragDoc.body) {
+    while (false) {
       if (currentEl.tulwebItem) {
         targetItem = currentEl.tulwebItem
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Killed] ConditionalExpression
src/managers/DragManager.js:213:11
     let targetItem = null
     let currentEl = el
     while (currentEl && currentEl !== this._dragDoc.body) {
-      if (currentEl.tulwebItem) {
+      if (false) {
         targetItem = currentEl.tulwebItem
         break
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Killed] BlockStatement
src/managers/DragManager.js:213:33
     let targetItem = null
     let currentEl = el
     while (currentEl && currentEl !== this._dragDoc.body) {
-      if (currentEl.tulwebItem) {
-        targetItem = currentEl.tulwebItem
-        break
-      }
+      if (currentEl.tulwebItem) {}
       currentEl = currentEl.parentElement
     }
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Killed] BooleanLiteral
src/managers/DragManager.js:220:9
       currentEl = currentEl.parentElement
     }
 
-    if (!targetItem) {
+    if (targetItem) {
       // If it's a drag over the root and root is empty, allow dropping
       if (this.layoutManager.rootElement.contains(el) && !this.layoutManager.root) {
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Killed] ConditionalExpression
src/managers/DragManager.js:220:9
       currentEl = currentEl.parentElement
     }
 
-    if (!targetItem) {
+    if (true) {
       // If it's a drag over the root and root is empty, allow dropping
       if (this.layoutManager.rootElement.contains(el) && !this.layoutManager.root) {
statusReason: TypeError: Cannot read properties of null (reading 'target')

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:222:11
 
     if (!targetItem) {
       // If it's a drag over the root and root is empty, allow dropping
-      if (this.layoutManager.rootElement.contains(el) && !this.layoutManager.root) {
+      if (false) {
         this.currentDropZone = { target: 'root', edge: 'center' }
         this.showIndicator(this.layoutManager.rootElement, 'center')

[NoCoverage] BooleanLiteral
src/managers/DragManager.js:222:58
 
     if (!targetItem) {
       // If it's a drag over the root and root is empty, allow dropping
-      if (this.layoutManager.rootElement.contains(el) && !this.layoutManager.root) {
+      if (this.layoutManager.rootElement.contains(el) && this.layoutManager.root) {
         this.currentDropZone = { target: 'root', edge: 'center' }
         this.showIndicator(this.layoutManager.rootElement, 'center')

[Killed] ConditionalExpression
src/managers/DragManager.js:231:9
     }
 
     // If hovering over a component inside a stack, we want to target the stack
-    if (targetItem instanceof ComponentItem && targetItem.parent instanceof StackItem) {
+    if (true) {
       targetItem = targetItem.parent
     }
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Survived] ConditionalExpression
src/managers/DragManager.js:231:9
     }
 
     // If hovering over a component inside a stack, we want to target the stack
-    if (targetItem instanceof ComponentItem && targetItem.parent instanceof StackItem) {
+    if (false) {
       targetItem = targetItem.parent
     }

[Killed] LogicalOperator
src/managers/DragManager.js:236:9
     }
 
     // Don't dropping on itself if it's the only tab
-    if (targetItem === this.sourceStack && targetItem.children.length === 1 && this.sourceType === 'tab') {
+    if (targetItem === this.sourceStack && targetItem.children.length === 1 || this.sourceType === 'tab') {
       return this.hideIndicator() // Can't drop on self if only child
     }
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Killed] EqualityOperator
src/managers/DragManager.js:236:9
     }
 
     // Don't dropping on itself if it's the only tab
-    if (targetItem === this.sourceStack && targetItem.children.length === 1 && this.sourceType === 'tab') {
+    if (targetItem !== this.sourceStack && targetItem.children.length === 1 && this.sourceType === 'tab') {
       return this.hideIndicator() // Can't drop on self if only child
     }
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Killed] ConditionalExpression
src/managers/DragManager.js:244:9
     const pos = Utils.getRelativePos(evt, targetItem.element)
 
     let edge = 'center'
-    if (targetItem instanceof StackItem) {
+    if (false) {
       const isHeader = targetItem.headerEl.contains(el)
       if (isHeader) {
statusReason: TypeError: Cannot read properties of null (reading 'target')

[Survived] ConditionalExpression
src/managers/DragManager.js:244:9
     const pos = Utils.getRelativePos(evt, targetItem.element)
 
     let edge = 'center'
-    if (targetItem instanceof StackItem) {
+    if (true) {
       const isHeader = targetItem.headerEl.contains(el)
       if (isHeader) {

[Killed] ConditionalExpression
src/managers/DragManager.js:246:11
     let edge = 'center'
     if (targetItem instanceof StackItem) {
       const isHeader = targetItem.headerEl.contains(el)
-      if (isHeader) {
+      if (true) {
         edge = 'tab_insert'
 
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "tab_insert"

[Survived] ConditionalExpression
src/managers/DragManager.js:246:11
     let edge = 'center'
     if (targetItem instanceof StackItem) {
       const isHeader = targetItem.headerEl.contains(el)
-      if (isHeader) {
+      if (false) {
         edge = 'tab_insert'
 

[NoCoverage] StringLiteral
src/managers/DragManager.js:249:68
       if (isHeader) {
         edge = 'tab_insert'
 
-        const tabs = Array.from(targetItem.tabsEl.querySelectorAll('.tulweb-tab'))
+        const tabs = Array.from(targetItem.tabsEl.querySelectorAll(""))
         let dropIdx = tabs.length
         let dropLeft = 0

[NoCoverage] EqualityOperator
src/managers/DragManager.js:256:28
         let dropHeight = 0
         let dropWidth = 0
 
-        const isVertical = targetItem.tabPosition === 'left' || targetItem.tabPosition === 'right'
+        const isVertical = targetItem.tabPosition !== 'left' || targetItem.tabPosition === 'right'
 
         if (tabs.length > 0) {

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:256:65
         let dropHeight = 0
         let dropWidth = 0
 
-        const isVertical = targetItem.tabPosition === 'left' || targetItem.tabPosition === 'right'
+        const isVertical = targetItem.tabPosition === 'left' || false
 
         if (tabs.length > 0) {

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:258:13
 
         const isVertical = targetItem.tabPosition === 'left' || targetItem.tabPosition === 'right'
 
-        if (tabs.length > 0) {
+        if (false) {
           for (let i = 0; i < tabs.length; i++) {
             const tab = tabs[i]

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:258:13
 
         const isVertical = targetItem.tabPosition === 'left' || targetItem.tabPosition === 'right'
 
-        if (tabs.length > 0) {
+        if (true) {
           for (let i = 0; i < tabs.length; i++) {
             const tab = tabs[i]

[NoCoverage] EqualityOperator
src/managers/DragManager.js:259:27
         const isVertical = targetItem.tabPosition === 'left' || targetItem.tabPosition === 'right'
 
         if (tabs.length > 0) {
-          for (let i = 0; i < tabs.length; i++) {
+          for (let i = 0; i <= tabs.length; i++) {
             const tab = tabs[i]
             const rect = tab.getBoundingClientRect()

[NoCoverage] BlockStatement
src/managers/DragManager.js:259:49
         const isVertical = targetItem.tabPosition === 'left' || targetItem.tabPosition === 'right'
 
         if (tabs.length > 0) {
-          for (let i = 0; i < tabs.length; i++) {
-            const tab = tabs[i]
-            const rect = tab.getBoundingClientRect()
-            if (tab.style.display === 'none') continue
-
-            if (isVertical) {
-              if (clientY < rect.top + rect.height / 2) {
-                dropIdx = i
-                dropLeft = rect.left
-                dropTop = rect.top
-                dropWidth = rect.width
-                dropHeight = 2
-                break
-              }
-            } else {
-              if (clientX < rect.left + rect.width / 2) {
-                dropIdx = i
-                dropLeft = rect.left
-                dropTop = rect.top
-                dropWidth = 2
-                dropHeight = rect.height
-                break
-              }
-            }
-          }
+          for (let i = 0; i < tabs.length; i++) {}
 
           if (dropIdx === tabs.length) {

[NoCoverage] EqualityOperator
src/managers/DragManager.js:262:17
           for (let i = 0; i < tabs.length; i++) {
             const tab = tabs[i]
             const rect = tab.getBoundingClientRect()
-            if (tab.style.display === 'none') continue
+            if (tab.style.display !== 'none') continue
 
             if (isVertical) {

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:262:17
           for (let i = 0; i < tabs.length; i++) {
             const tab = tabs[i]
             const rect = tab.getBoundingClientRect()
-            if (tab.style.display === 'none') continue
+            if (true) continue
 
             if (isVertical) {

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:264:17
             const rect = tab.getBoundingClientRect()
             if (tab.style.display === 'none') continue
 
-            if (isVertical) {
+            if (false) {
               if (clientY < rect.top + rect.height / 2) {
                 dropIdx = i

[NoCoverage] BlockStatement
src/managers/DragManager.js:264:29
             const rect = tab.getBoundingClientRect()
             if (tab.style.display === 'none') continue
 
-            if (isVertical) {
-              if (clientY < rect.top + rect.height / 2) {
-                dropIdx = i
-                dropLeft = rect.left
-                dropTop = rect.top
-                dropWidth = rect.width
-                dropHeight = 2
-                break
-              }
-            } else {
+            if (isVertical) {} else {
               if (clientX < rect.left + rect.width / 2) {
                 dropIdx = i

[NoCoverage] EqualityOperator
src/managers/DragManager.js:265:19
             if (tab.style.display === 'none') continue
 
             if (isVertical) {
-              if (clientY < rect.top + rect.height / 2) {
+              if (clientY <= rect.top + rect.height / 2) {
                 dropIdx = i
                 dropLeft = rect.left

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:265:29
             if (tab.style.display === 'none') continue
 
             if (isVertical) {
-              if (clientY < rect.top + rect.height / 2) {
+              if (clientY < rect.top - rect.height / 2) {
                 dropIdx = i
                 dropLeft = rect.left

[NoCoverage] BlockStatement
src/managers/DragManager.js:273:20
                 dropHeight = 2
                 break
               }
-            } else {
-              if (clientX < rect.left + rect.width / 2) {
-                dropIdx = i
-                dropLeft = rect.left
-                dropTop = rect.top
-                dropWidth = 2
-                dropHeight = rect.height
-                break
-              }
-            }
+            } else {}
           }
 

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:274:41
                 break
               }
             } else {
-              if (clientX < rect.left + rect.width / 2) {
+              if (clientX < rect.left + rect.width * 2) {
                 dropIdx = i
                 dropLeft = rect.left

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:274:29
                 break
               }
             } else {
-              if (clientX < rect.left + rect.width / 2) {
+              if (clientX < rect.left - rect.width / 2) {
                 dropIdx = i
                 dropLeft = rect.left

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:285:15
             }
           }
 
-          if (dropIdx === tabs.length) {
+          if (true) {
             let lastVisible = null
             for (let i = tabs.length - 1; i >= 0; i--) {

[NoCoverage] EqualityOperator
src/managers/DragManager.js:285:15
             }
           }
 
-          if (dropIdx === tabs.length) {
+          if (dropIdx !== tabs.length) {
             let lastVisible = null
             for (let i = tabs.length - 1; i >= 0; i--) {

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:287:26
 
           if (dropIdx === tabs.length) {
             let lastVisible = null
-            for (let i = tabs.length - 1; i >= 0; i--) {
+            for (let i = tabs.length + 1; i >= 0; i--) {
               if (tabs[i].style.display !== 'none') {
                 lastVisible = tabs[i]

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:287:43
 
           if (dropIdx === tabs.length) {
             let lastVisible = null
-            for (let i = tabs.length - 1; i >= 0; i--) {
+            for (let i = tabs.length - 1; false; i--) {
               if (tabs[i].style.display !== 'none') {
                 lastVisible = tabs[i]

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:288:19
           if (dropIdx === tabs.length) {
             let lastVisible = null
             for (let i = tabs.length - 1; i >= 0; i--) {
-              if (tabs[i].style.display !== 'none') {
+              if (true) {
                 lastVisible = tabs[i]
                 dropIdx = i + 1

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:288:19
           if (dropIdx === tabs.length) {
             let lastVisible = null
             for (let i = tabs.length - 1; i >= 0; i--) {
-              if (tabs[i].style.display !== 'none') {
+              if (false) {
                 lastVisible = tabs[i]
                 dropIdx = i + 1

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:290:27
             for (let i = tabs.length - 1; i >= 0; i--) {
               if (tabs[i].style.display !== 'none') {
                 lastVisible = tabs[i]
-                dropIdx = i + 1
+                dropIdx = i - 1
                 break
               }
