[NoCoverage] BlockStatement
src/managers/DragManager.js:294:30
                 break
               }
             }
-            if (lastVisible) {
-              const rect = lastVisible.getBoundingClientRect()
-              if (isVertical) {
-                dropLeft = rect.left
-                dropTop = rect.bottom
-                dropWidth = rect.width
-                dropHeight = 2
-              } else {
-                dropLeft = rect.right
-                dropTop = rect.top
-                dropWidth = 2
-                dropHeight = rect.height
-              }
-            } else {
+            if (lastVisible) {} else {
               // Fallback if all hidden
               const rect = targetItem.tabsEl.getBoundingClientRect()

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:294:17
                 break
               }
             }
-            if (lastVisible) {
+            if (true) {
               const rect = lastVisible.getBoundingClientRect()
               if (isVertical) {

[NoCoverage] BlockStatement
src/managers/DragManager.js:296:31
             }
             if (lastVisible) {
               const rect = lastVisible.getBoundingClientRect()
-              if (isVertical) {
-                dropLeft = rect.left
-                dropTop = rect.bottom
-                dropWidth = rect.width
-                dropHeight = 2
-              } else {
+              if (isVertical) {} else {
                 dropLeft = rect.right
                 dropTop = rect.top

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:296:19
             }
             if (lastVisible) {
               const rect = lastVisible.getBoundingClientRect()
-              if (isVertical) {
+              if (true) {
                 dropLeft = rect.left
                 dropTop = rect.bottom

[NoCoverage] BlockStatement
src/managers/DragManager.js:301:22
                 dropTop = rect.bottom
                 dropWidth = rect.width
                 dropHeight = 2
-              } else {
-                dropLeft = rect.right
-                dropTop = rect.top
-                dropWidth = 2
-                dropHeight = rect.height
-              }
+              } else {}
             } else {
               // Fallback if all hidden

[NoCoverage] BlockStatement
src/managers/DragManager.js:307:20
                 dropWidth = 2
                 dropHeight = rect.height
               }
-            } else {
-              // Fallback if all hidden
-              const rect = targetItem.tabsEl.getBoundingClientRect()
-              if (isVertical) {
-                dropLeft = rect.left + 4
-                dropTop = rect.top + 8
-                dropWidth = rect.width - 8
-                dropHeight = 2
-              } else {
-                dropLeft = rect.left + 8
-                dropTop = rect.top + 4
-                dropWidth = 2
-                dropHeight = rect.height - 8
-              }
-            }
+            } else {}
           }
         } else {

[NoCoverage] BlockStatement
src/managers/DragManager.js:310:31
             } else {
               // Fallback if all hidden
               const rect = targetItem.tabsEl.getBoundingClientRect()
-              if (isVertical) {
-                dropLeft = rect.left + 4
-                dropTop = rect.top + 8
-                dropWidth = rect.width - 8
-                dropHeight = 2
-              } else {
+              if (isVertical) {} else {
                 dropLeft = rect.left + 8
                 dropTop = rect.top + 4

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:310:19
             } else {
               // Fallback if all hidden
               const rect = targetItem.tabsEl.getBoundingClientRect()
-              if (isVertical) {
+              if (false) {
                 dropLeft = rect.left + 4
                 dropTop = rect.top + 8

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:311:28
               // Fallback if all hidden
               const rect = targetItem.tabsEl.getBoundingClientRect()
               if (isVertical) {
-                dropLeft = rect.left + 4
+                dropLeft = rect.left - 4
                 dropTop = rect.top + 8
                 dropWidth = rect.width - 8

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:312:27
               const rect = targetItem.tabsEl.getBoundingClientRect()
               if (isVertical) {
                 dropLeft = rect.left + 4
-                dropTop = rect.top + 8
+                dropTop = rect.top - 8
                 dropWidth = rect.width - 8
                 dropHeight = 2

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:313:29
               if (isVertical) {
                 dropLeft = rect.left + 4
                 dropTop = rect.top + 8
-                dropWidth = rect.width - 8
+                dropWidth = rect.width + 8
                 dropHeight = 2
               } else {

[NoCoverage] BlockStatement
src/managers/DragManager.js:315:22
                 dropTop = rect.top + 8
                 dropWidth = rect.width - 8
                 dropHeight = 2
-              } else {
-                dropLeft = rect.left + 8
-                dropTop = rect.top + 4
-                dropWidth = 2
-                dropHeight = rect.height - 8
-              }
+              } else {}
             }
           }

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:316:28
                 dropWidth = rect.width - 8
                 dropHeight = 2
               } else {
-                dropLeft = rect.left + 8
+                dropLeft = rect.left - 8
                 dropTop = rect.top + 4
                 dropWidth = 2

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:317:27
                 dropHeight = 2
               } else {
                 dropLeft = rect.left + 8
-                dropTop = rect.top + 4
+                dropTop = rect.top - 4
                 dropWidth = 2
                 dropHeight = rect.height - 8

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:319:30
                 dropLeft = rect.left + 8
                 dropTop = rect.top + 4
                 dropWidth = 2
-                dropHeight = rect.height - 8
+                dropHeight = rect.height + 8
               }
             }

[NoCoverage] BlockStatement
src/managers/DragManager.js:323:16
               }
             }
           }
-        } else {
-          const rect = targetItem.tabsEl.getBoundingClientRect()
-          if (isVertical) {
-            dropLeft = rect.left + 4
-            dropTop = rect.top + 8
-            dropWidth = rect.width - 8
-            dropHeight = 2
-          } else {
-            dropLeft = rect.left + 8
-            dropTop = rect.top + 4
-            dropWidth = 2
-            dropHeight = rect.height - 8
-          }
-        }
+        } else {}
 
         this.currentDropZone = { target: targetItem, edge, insertIndex: dropIdx }

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:325:15
           }
         } else {
           const rect = targetItem.tabsEl.getBoundingClientRect()
-          if (isVertical) {
+          if (true) {
             dropLeft = rect.left + 4
             dropTop = rect.top + 8

[NoCoverage] ObjectLiteral
src/managers/DragManager.js:338:32
           }
         }
 
-        this.currentDropZone = { target: targetItem, edge, insertIndex: dropIdx }
+        this.currentDropZone = {}
         this.showTabIndicator(dropLeft, dropTop, dropWidth, dropHeight)
         return

[Killed] BlockStatement
src/managers/DragManager.js:341:14
         this.currentDropZone = { target: targetItem, edge, insertIndex: dropIdx }
         this.showTabIndicator(dropLeft, dropTop, dropWidth, dropHeight)
         return
-      } else {
-        // Check center 25% box for stacking
-        const cx = pos.w / 2
-        const cy = pos.h / 2
-        if (Math.abs(pos.x - cx) < pos.w * 0.25 && Math.abs(pos.y - cy) < pos.h * 0.25) {
-          edge = 'center'
-        } else {
-          // Quadrants
-          const y1 = pos.x * (pos.h / pos.w)
-          const y2 = pos.h - pos.x * (pos.h / pos.w)
-
-          if (pos.y < y1 && pos.y < y2) edge = 'top'
-          else if (pos.y > y1 && pos.y > y2) edge = 'bottom'
-          else if (pos.y > y1 && pos.y < y2) edge = 'left'
-          else if (pos.y < y1 && pos.y > y2) edge = 'right'
-        }
-      }
+      } else {}
     } else {
       return this.hideIndicator()
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "center"

[Survived] ArithmeticOperator
src/managers/DragManager.js:343:20
         return
       } else {
         // Check center 25% box for stacking
-        const cx = pos.w / 2
+        const cx = pos.w * 2
         const cy = pos.h / 2
         if (Math.abs(pos.x - cx) < pos.w * 0.25 && Math.abs(pos.y - cy) < pos.h * 0.25) {

[Survived] ArithmeticOperator
src/managers/DragManager.js:344:20
       } else {
         // Check center 25% box for stacking
         const cx = pos.w / 2
-        const cy = pos.h / 2
+        const cy = pos.h * 2
         if (Math.abs(pos.x - cx) < pos.w * 0.25 && Math.abs(pos.y - cy) < pos.h * 0.25) {
           edge = 'center'

[Killed] EqualityOperator
src/managers/DragManager.js:345:52
         // Check center 25% box for stacking
         const cx = pos.w / 2
         const cy = pos.h / 2
-        if (Math.abs(pos.x - cx) < pos.w * 0.25 && Math.abs(pos.y - cy) < pos.h * 0.25) {
+        if (Math.abs(pos.x - cx) < pos.w * 0.25 && Math.abs(pos.y - cy) >= pos.h * 0.25) {
           edge = 'center'
         } else {
killedBy: DragManager Integration Tests splitting a stack vertically (bottom side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom"
Received: "center"

[Killed] ArithmeticOperator
src/managers/DragManager.js:345:75
         // Check center 25% box for stacking
         const cx = pos.w / 2
         const cy = pos.h / 2
-        if (Math.abs(pos.x - cx) < pos.w * 0.25 && Math.abs(pos.y - cy) < pos.h * 0.25) {
+        if (Math.abs(pos.x - cx) < pos.w * 0.25 && Math.abs(pos.y - cy) < pos.h / 0.25) {
           edge = 'center'
         } else {
killedBy: DragManager Integration Tests splitting a stack vertically (bottom side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom"
Received: "center"

[Killed] BlockStatement
src/managers/DragManager.js:347:16
         const cy = pos.h / 2
         if (Math.abs(pos.x - cx) < pos.w * 0.25 && Math.abs(pos.y - cy) < pos.h * 0.25) {
           edge = 'center'
-        } else {
-          // Quadrants
-          const y1 = pos.x * (pos.h / pos.w)
-          const y2 = pos.h - pos.x * (pos.h / pos.w)
-
-          if (pos.y < y1 && pos.y < y2) edge = 'top'
-          else if (pos.y > y1 && pos.y > y2) edge = 'bottom'
-          else if (pos.y > y1 && pos.y < y2) edge = 'left'
-          else if (pos.y < y1 && pos.y > y2) edge = 'right'
-        }
+        } else {}
       }
     } else {
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "center"

[Killed] ArithmeticOperator
src/managers/DragManager.js:349:31
           edge = 'center'
         } else {
           // Quadrants
-          const y1 = pos.x * (pos.h / pos.w)
+          const y1 = pos.x * (pos.h * pos.w)
           const y2 = pos.h - pos.x * (pos.h / pos.w)
 
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "top"

[Survived] ArithmeticOperator
src/managers/DragManager.js:349:22
           edge = 'center'
         } else {
           // Quadrants
-          const y1 = pos.x * (pos.h / pos.w)
+          const y1 = pos.x / (pos.h / pos.w)
           const y2 = pos.h - pos.x * (pos.h / pos.w)
 

[Killed] ArithmeticOperator
src/managers/DragManager.js:350:22
         } else {
           // Quadrants
           const y1 = pos.x * (pos.h / pos.w)
-          const y2 = pos.h - pos.x * (pos.h / pos.w)
+          const y2 = pos.h + pos.x * (pos.h / pos.w)
 
           if (pos.y < y1 && pos.y < y2) edge = 'top'
killedBy: DragManager Integration Tests splitting a stack vertically (bottom side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom"
Received: "left"

[Killed] ArithmeticOperator
src/managers/DragManager.js:350:39
         } else {
           // Quadrants
           const y1 = pos.x * (pos.h / pos.w)
-          const y2 = pos.h - pos.x * (pos.h / pos.w)
+          const y2 = pos.h - pos.x * (pos.h * pos.w)
 
           if (pos.y < y1 && pos.y < y2) edge = 'top'
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "bottom"

[Killed] LogicalOperator
src/managers/DragManager.js:352:15
           const y1 = pos.x * (pos.h / pos.w)
           const y2 = pos.h - pos.x * (pos.h / pos.w)
 
-          if (pos.y < y1 && pos.y < y2) edge = 'top'
+          if (pos.y < y1 || pos.y < y2) edge = 'top'
           else if (pos.y > y1 && pos.y > y2) edge = 'bottom'
           else if (pos.y > y1 && pos.y < y2) edge = 'left'
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "top"

[Killed] EqualityOperator
src/managers/DragManager.js:352:15
           const y1 = pos.x * (pos.h / pos.w)
           const y2 = pos.h - pos.x * (pos.h / pos.w)
 
-          if (pos.y < y1 && pos.y < y2) edge = 'top'
+          if (pos.y >= y1 && pos.y < y2) edge = 'top'
           else if (pos.y > y1 && pos.y > y2) edge = 'bottom'
           else if (pos.y > y1 && pos.y < y2) edge = 'left'
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "top"

[Killed] ConditionalExpression
src/managers/DragManager.js:353:20
           const y2 = pos.h - pos.x * (pos.h / pos.w)
 
           if (pos.y < y1 && pos.y < y2) edge = 'top'
-          else if (pos.y > y1 && pos.y > y2) edge = 'bottom'
+          else if (false) edge = 'bottom'
           else if (pos.y > y1 && pos.y < y2) edge = 'left'
           else if (pos.y < y1 && pos.y > y2) edge = 'right'
killedBy: DragManager Integration Tests splitting a stack vertically (bottom side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom"
Received: "center"

[Killed] EqualityOperator
src/managers/DragManager.js:353:20
           const y2 = pos.h - pos.x * (pos.h / pos.w)
 
           if (pos.y < y1 && pos.y < y2) edge = 'top'
-          else if (pos.y > y1 && pos.y > y2) edge = 'bottom'
+          else if (pos.y <= y1 && pos.y > y2) edge = 'bottom'
           else if (pos.y > y1 && pos.y < y2) edge = 'left'
           else if (pos.y < y1 && pos.y > y2) edge = 'right'
killedBy: DragManager Integration Tests splitting a stack vertically (bottom side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom"
Received: "center"

[Killed] EqualityOperator
src/managers/DragManager.js:354:20
 
           if (pos.y < y1 && pos.y < y2) edge = 'top'
           else if (pos.y > y1 && pos.y > y2) edge = 'bottom'
-          else if (pos.y > y1 && pos.y < y2) edge = 'left'
+          else if (pos.y <= y1 && pos.y < y2) edge = 'left'
           else if (pos.y < y1 && pos.y > y2) edge = 'right'
         }
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "center"

[Killed] ConditionalExpression
src/managers/DragManager.js:354:20
 
           if (pos.y < y1 && pos.y < y2) edge = 'top'
           else if (pos.y > y1 && pos.y > y2) edge = 'bottom'
-          else if (pos.y > y1 && pos.y < y2) edge = 'left'
+          else if (false) edge = 'left'
           else if (pos.y < y1 && pos.y > y2) edge = 'right'
         }
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "center"

[NoCoverage] EqualityOperator
src/managers/DragManager.js:355:20
           if (pos.y < y1 && pos.y < y2) edge = 'top'
           else if (pos.y > y1 && pos.y > y2) edge = 'bottom'
           else if (pos.y > y1 && pos.y < y2) edge = 'left'
-          else if (pos.y < y1 && pos.y > y2) edge = 'right'
+          else if (pos.y >= y1 && pos.y > y2) edge = 'right'
         }
       }

[NoCoverage] EqualityOperator
src/managers/DragManager.js:355:20
           if (pos.y < y1 && pos.y < y2) edge = 'top'
           else if (pos.y > y1 && pos.y > y2) edge = 'bottom'
           else if (pos.y > y1 && pos.y < y2) edge = 'left'
-          else if (pos.y < y1 && pos.y > y2) edge = 'right'
+          else if (pos.y <= y1 && pos.y > y2) edge = 'right'
         }
       }

[NoCoverage] BlockStatement
src/managers/DragManager.js:358:12
           else if (pos.y < y1 && pos.y > y2) edge = 'right'
         }
       }
-    } else {
-      return this.hideIndicator()
-    }
+    } else {}
 
     this.currentDropZone = { target: targetItem, edge }

[NoCoverage] BlockStatement
src/managers/DragManager.js:366:33
     this.showIndicator(targetItem.element, edge)
   }
 
-  showTabIndicator (l, t, w, h) {
-    this.indicator.style.display = 'none'
-    this.indicator.classList.remove('visible')
-
-    this.tabIndicator.style.top = t + 'px'
-    this.tabIndicator.style.left = l + 'px'
-    this.tabIndicator.style.width = w + 'px'
-    this.tabIndicator.style.height = h + 'px'
-    this.tabIndicator.style.display = 'block'
-
-    setTimeout(() => this.tabIndicator.classList.add('visible'), 10)
-  }
+  showTabIndicator (l, t, w, h) {}
 
   showIndicator (element, edge) {

[NoCoverage] StringLiteral
src/managers/DragManager.js:370:39
     this.indicator.style.display = 'none'
     this.indicator.classList.remove('visible')
 
-    this.tabIndicator.style.top = t + 'px'
+    this.tabIndicator.style.top = t + ""
     this.tabIndicator.style.left = l + 'px'
     this.tabIndicator.style.width = w + 'px'

[NoCoverage] StringLiteral
src/managers/DragManager.js:371:40
     this.indicator.classList.remove('visible')
 
     this.tabIndicator.style.top = t + 'px'
-    this.tabIndicator.style.left = l + 'px'
+    this.tabIndicator.style.left = l + ""
     this.tabIndicator.style.width = w + 'px'
     this.tabIndicator.style.height = h + 'px'

[NoCoverage] ArrowFunction
src/managers/DragManager.js:376:16
     this.tabIndicator.style.height = h + 'px'
     this.tabIndicator.style.display = 'block'
 
-    setTimeout(() => this.tabIndicator.classList.add('visible'), 10)
+    setTimeout(() => undefined, 10)
   }
 

[Survived] BlockStatement
src/managers/DragManager.js:379:33
     setTimeout(() => this.tabIndicator.classList.add('visible'), 10)
   }
 
-  showIndicator (element, edge) {
-    if (this.tabIndicator) {
-      this.tabIndicator.style.display = 'none'
-      this.tabIndicator.classList.remove('visible')
-    }
-
-    const rect = element.getBoundingClientRect()
-    let t = rect.top; let l = rect.left; let w = rect.width; let h = rect.height
-
-    if (edge === 'top') h = h / 2
-    if (edge === 'bottom') { t = rect.bottom - (h / 2); h = h / 2 }
-    if (edge === 'left') w = w / 2
-    if (edge === 'right') { l = rect.right - (w / 2); w = w / 2 }
-
-    this.indicator.style.top = t + 'px'
-    this.indicator.style.left = l + 'px'
-    this.indicator.style.width = w + 'px'
-    this.indicator.style.height = h + 'px'
-    this.indicator.style.display = 'block'
-
-    // Small delay for CSS transition
-    setTimeout(() => this.indicator.classList.add('visible'), 10)
-  }
+  showIndicator (element, edge) {}
 
   hideIndicator () {

[Survived] ConditionalExpression
src/managers/DragManager.js:380:9
   }
 
   showIndicator (element, edge) {
-    if (this.tabIndicator) {
+    if (false) {
       this.tabIndicator.style.display = 'none'
       this.tabIndicator.classList.remove('visible')

[Survived] BlockStatement
src/managers/DragManager.js:380:28
   }
 
   showIndicator (element, edge) {
-    if (this.tabIndicator) {
-      this.tabIndicator.style.display = 'none'
-      this.tabIndicator.classList.remove('visible')
-    }
+    if (this.tabIndicator) {}
 
     const rect = element.getBoundingClientRect()

[Survived] StringLiteral
src/managers/DragManager.js:381:41
 
   showIndicator (element, edge) {
     if (this.tabIndicator) {
-      this.tabIndicator.style.display = 'none'
+      this.tabIndicator.style.display = ""
       this.tabIndicator.classList.remove('visible')
     }

[Killed] StringLiteral
src/managers/DragManager.js:382:42
   showIndicator (element, edge) {
     if (this.tabIndicator) {
       this.tabIndicator.style.display = 'none'
-      this.tabIndicator.classList.remove('visible')
+      this.tabIndicator.classList.remove("")
     }
 
statusReason: SyntaxError: The token provided must not be empty.

[Survived] ConditionalExpression
src/managers/DragManager.js:388:9
     const rect = element.getBoundingClientRect()
     let t = rect.top; let l = rect.left; let w = rect.width; let h = rect.height
 
-    if (edge === 'top') h = h / 2
+    if (false) h = h / 2
     if (edge === 'bottom') { t = rect.bottom - (h / 2); h = h / 2 }
     if (edge === 'left') w = w / 2

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:388:29
     const rect = element.getBoundingClientRect()
     let t = rect.top; let l = rect.left; let w = rect.width; let h = rect.height
 
-    if (edge === 'top') h = h / 2
+    if (edge === 'top') h = h * 2
     if (edge === 'bottom') { t = rect.bottom - (h / 2); h = h / 2 }
     if (edge === 'left') w = w / 2

[Survived] ArithmeticOperator
src/managers/DragManager.js:389:49
     let t = rect.top; let l = rect.left; let w = rect.width; let h = rect.height
 
     if (edge === 'top') h = h / 2
-    if (edge === 'bottom') { t = rect.bottom - (h / 2); h = h / 2 }
+    if (edge === 'bottom') { t = rect.bottom - (h * 2); h = h / 2 }
     if (edge === 'left') w = w / 2
     if (edge === 'right') { l = rect.right - (w / 2); w = w / 2 }

[Survived] ConditionalExpression
src/managers/DragManager.js:389:9
     let t = rect.top; let l = rect.left; let w = rect.width; let h = rect.height
 
     if (edge === 'top') h = h / 2
-    if (edge === 'bottom') { t = rect.bottom - (h / 2); h = h / 2 }
+    if (true) { t = rect.bottom - (h / 2); h = h / 2 }
     if (edge === 'left') w = w / 2
     if (edge === 'right') { l = rect.right - (w / 2); w = w / 2 }

[Survived] ArithmeticOperator
src/managers/DragManager.js:390:30
 
     if (edge === 'top') h = h / 2
     if (edge === 'bottom') { t = rect.bottom - (h / 2); h = h / 2 }
-    if (edge === 'left') w = w / 2
+    if (edge === 'left') w = w * 2
     if (edge === 'right') { l = rect.right - (w / 2); w = w / 2 }
 

[Survived] ConditionalExpression
src/managers/DragManager.js:390:9
 
     if (edge === 'top') h = h / 2
     if (edge === 'bottom') { t = rect.bottom - (h / 2); h = h / 2 }
-    if (edge === 'left') w = w / 2
+    if (false) w = w / 2
     if (edge === 'right') { l = rect.right - (w / 2); w = w / 2 }
 

[NoCoverage] BlockStatement
src/managers/DragManager.js:391:27
     if (edge === 'top') h = h / 2
     if (edge === 'bottom') { t = rect.bottom - (h / 2); h = h / 2 }
     if (edge === 'left') w = w / 2
-    if (edge === 'right') { l = rect.right - (w / 2); w = w / 2 }
+    if (edge === 'right') {}
 
     this.indicator.style.top = t + 'px'

[Survived] ConditionalExpression
src/managers/DragManager.js:391:9
     if (edge === 'top') h = h / 2
     if (edge === 'bottom') { t = rect.bottom - (h / 2); h = h / 2 }
     if (edge === 'left') w = w / 2
-    if (edge === 'right') { l = rect.right - (w / 2); w = w / 2 }
+    if (false) { l = rect.right - (w / 2); w = w / 2 }
 
     this.indicator.style.top = t + 'px'

[Survived] StringLiteral
src/managers/DragManager.js:394:37
     if (edge === 'right') { l = rect.right - (w / 2); w = w / 2 }
 
     this.indicator.style.top = t + 'px'
-    this.indicator.style.left = l + 'px'
+    this.indicator.style.left = l + ""
     this.indicator.style.width = w + 'px'
     this.indicator.style.height = h + 'px'

[Survived] ArrowFunction
src/managers/DragManager.js:400:16
     this.indicator.style.display = 'block'
 
     // Small delay for CSS transition
-    setTimeout(() => this.indicator.classList.add('visible'), 10)
+    setTimeout(() => undefined, 10)
   }
 

[NoCoverage] StringLiteral
src/managers/DragManager.js:400:51
     this.indicator.style.display = 'block'
 
     // Small delay for CSS transition
-    setTimeout(() => this.indicator.classList.add('visible'), 10)
+    setTimeout(() => this.indicator.classList.add(""), 10)
   }
 

[Survived] BlockStatement
src/managers/DragManager.js:403:20
     setTimeout(() => this.indicator.classList.add('visible'), 10)
   }
 
-  hideIndicator () {
-    this.indicator.style.display = 'none'
-    this.indicator.classList.remove('visible')
-    if (this.tabIndicator) {
-      this.tabIndicator.style.display = 'none'
-      this.tabIndicator.classList.remove('visible')
-    }
-    this.currentDropZone = null
-  }
+  hideIndicator () {}
 
   executeDrop () {

[Survived] StringLiteral
src/managers/DragManager.js:404:36
   }
 
   hideIndicator () {
-    this.indicator.style.display = 'none'
+    this.indicator.style.display = ""
     this.indicator.classList.remove('visible')
     if (this.tabIndicator) {

[Survived] ConditionalExpression
src/managers/DragManager.js:406:9
   hideIndicator () {
     this.indicator.style.display = 'none'
     this.indicator.classList.remove('visible')
-    if (this.tabIndicator) {
+    if (false) {
       this.tabIndicator.style.display = 'none'
       this.tabIndicator.classList.remove('visible')

[Survived] ConditionalExpression
src/managers/DragManager.js:406:9
   hideIndicator () {
     this.indicator.style.display = 'none'
     this.indicator.classList.remove('visible')
-    if (this.tabIndicator) {
+    if (true) {
       this.tabIndicator.style.display = 'none'
       this.tabIndicator.classList.remove('visible')

[Survived] BooleanLiteral
src/managers/DragManager.js:417:23
     const { target, edge } = this.currentDropZone
     const newItemConfig = this.dragItem
 
-    let adjustIndex = false
+    let adjustIndex = true
     // If it's a dragged tab, we need to remove it from the old stack first
     if (this.sourceType === 'tab') {

[Killed] BlockStatement
src/managers/DragManager.js:419:36
 
     let adjustIndex = false
     // If it's a dragged tab, we need to remove it from the old stack first
-    if (this.sourceType === 'tab') {
-      const oldComp = this.sourceStack.children.find(c => c.config === newItemConfig)
-      if (oldComp) {
-        oldComp.emit('willMove', { source: this.sourceStack, target })
-        const oldIndex = this.sourceStack.children.indexOf(oldComp)
-        if (this.sourceStack === target && edge === 'tab_insert' && oldIndex < this.currentDropZone.insertIndex) {
-          adjustIndex = true
-        }
-        this.sourceStack.removeChild(oldComp)
-        // If source stack is empty, it needs to be cleaned up
-        if (this.sourceStack.children.length === 0) {
-          this.layoutManager._cleanupEmptyStack(this.sourceStack)
-        }
-      }
-    } else {
+    if (this.sourceType === 'tab') {} else {
       // It's a new external config. We need to create it.
       // It's already just a config object.
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
src/managers/DragManager.js:419:9
 
     let adjustIndex = false
     // If it's a dragged tab, we need to remove it from the old stack first
-    if (this.sourceType === 'tab') {
+    if (false) {
       const oldComp = this.sourceStack.children.find(c => c.config === newItemConfig)
       if (oldComp) {
statusReason: Error: expect(received).toBeNull()

[Killed] EqualityOperator
src/managers/DragManager.js:420:59
     let adjustIndex = false
     // If it's a dragged tab, we need to remove it from the old stack first
     if (this.sourceType === 'tab') {
-      const oldComp = this.sourceStack.children.find(c => c.config === newItemConfig)
+      const oldComp = this.sourceStack.children.find(c => c.config !== newItemConfig)
       if (oldComp) {
         oldComp.emit('willMove', { source: this.sourceStack, target })
statusReason: Error: expect(received).toBeNull()

[Killed] ArrowFunction
src/managers/DragManager.js:420:54
     let adjustIndex = false
     // If it's a dragged tab, we need to remove it from the old stack first
     if (this.sourceType === 'tab') {
-      const oldComp = this.sourceStack.children.find(c => c.config === newItemConfig)
+      const oldComp = this.sourceStack.children.find(() => undefined)
       if (oldComp) {
         oldComp.emit('willMove', { source: this.sourceStack, target })
statusReason: Error: expect(received).toBeNull()
