[Killed] ConditionalExpression
src/managers/DragManager.js:421:11
     // If it's a dragged tab, we need to remove it from the old stack first
     if (this.sourceType === 'tab') {
       const oldComp = this.sourceStack.children.find(c => c.config === newItemConfig)
-      if (oldComp) {
+      if (false) {
         oldComp.emit('willMove', { source: this.sourceStack, target })
         const oldIndex = this.sourceStack.children.indexOf(oldComp)
statusReason: Error: expect(received).toBeNull()

[Killed] BlockStatement
src/managers/DragManager.js:421:20
     // If it's a dragged tab, we need to remove it from the old stack first
     if (this.sourceType === 'tab') {
       const oldComp = this.sourceStack.children.find(c => c.config === newItemConfig)
-      if (oldComp) {
-        oldComp.emit('willMove', { source: this.sourceStack, target })
-        const oldIndex = this.sourceStack.children.indexOf(oldComp)
-        if (this.sourceStack === target && edge === 'tab_insert' && oldIndex < this.currentDropZone.insertIndex) {
-          adjustIndex = true
-        }
-        this.sourceStack.removeChild(oldComp)
-        // If source stack is empty, it needs to be cleaned up
-        if (this.sourceStack.children.length === 0) {
-          this.layoutManager._cleanupEmptyStack(this.sourceStack)
-        }
-      }
+      if (oldComp) {}
     } else {
       // It's a new external config. We need to create it.
statusReason: Error: expect(received).toBeNull()

[NoCoverage] BlockStatement
src/managers/DragManager.js:424:114
       if (oldComp) {
         oldComp.emit('willMove', { source: this.sourceStack, target })
         const oldIndex = this.sourceStack.children.indexOf(oldComp)
-        if (this.sourceStack === target && edge === 'tab_insert' && oldIndex < this.currentDropZone.insertIndex) {
-          adjustIndex = true
-        }
+        if (this.sourceStack === target && edge === 'tab_insert' && oldIndex < this.currentDropZone.insertIndex) {}
         this.sourceStack.removeChild(oldComp)
         // If source stack is empty, it needs to be cleaned up

[NoCoverage] EqualityOperator
src/managers/DragManager.js:424:69
       if (oldComp) {
         oldComp.emit('willMove', { source: this.sourceStack, target })
         const oldIndex = this.sourceStack.children.indexOf(oldComp)
-        if (this.sourceStack === target && edge === 'tab_insert' && oldIndex < this.currentDropZone.insertIndex) {
+        if (this.sourceStack === target && edge === 'tab_insert' && oldIndex <= this.currentDropZone.insertIndex) {
           adjustIndex = true
         }

[NoCoverage] BooleanLiteral
src/managers/DragManager.js:425:25
         oldComp.emit('willMove', { source: this.sourceStack, target })
         const oldIndex = this.sourceStack.children.indexOf(oldComp)
         if (this.sourceStack === target && edge === 'tab_insert' && oldIndex < this.currentDropZone.insertIndex) {
-          adjustIndex = true
+          adjustIndex = false
         }
         this.sourceStack.removeChild(oldComp)

[Killed] EqualityOperator
src/managers/DragManager.js:429:13
         }
         this.sourceStack.removeChild(oldComp)
         // If source stack is empty, it needs to be cleaned up
-        if (this.sourceStack.children.length === 0) {
+        if (this.sourceStack.children.length !== 0) {
           this.layoutManager._cleanupEmptyStack(this.sourceStack)
         }
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
src/managers/DragManager.js:429:13
         }
         this.sourceStack.removeChild(oldComp)
         // If source stack is empty, it needs to be cleaned up
-        if (this.sourceStack.children.length === 0) {
+        if (false) {
           this.layoutManager._cleanupEmptyStack(this.sourceStack)
         }
statusReason: Error: expect(received).toBeNull()

[Killed] EqualityOperator
src/managers/DragManager.js:441:9
 
     let newComp
 
-    if (target === 'root') {
+    if (target !== 'root') {
       const row = new RowItem({ type: 'row' }, this.layoutManager)
       const newStack = new StackItem({ type: 'stack', tabPosition: newItemConfig.tabPosition }, this.layoutManager)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
src/managers/DragManager.js:441:9
 
     let newComp
 
-    if (target === 'root') {
+    if (true) {
       const row = new RowItem({ type: 'row' }, this.layoutManager)
       const newStack = new StackItem({ type: 'stack', tabPosition: newItemConfig.tabPosition }, this.layoutManager)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[NoCoverage] ObjectLiteral
src/managers/DragManager.js:442:31
     let newComp
 
     if (target === 'root') {
-      const row = new RowItem({ type: 'row' }, this.layoutManager)
+      const row = new RowItem({}, this.layoutManager)
       const newStack = new StackItem({ type: 'stack', tabPosition: newItemConfig.tabPosition }, this.layoutManager)
       newComp = new ComponentItem(newItemConfig, this.layoutManager)

[NoCoverage] StringLiteral
src/managers/DragManager.js:448:50
       newStack.addChild(newComp)
       row.addChild(newStack)
       this.layoutManager.root = row
-      this.layoutManager.rootElement.innerHTML = ''
+      this.layoutManager.rootElement.innerHTML = "Stryker was here!"
       this.layoutManager.rootElement.appendChild(row.element)
       this.layoutManager.updateLayout()

[Killed] ConditionalExpression
src/managers/DragManager.js:451:16
       this.layoutManager.rootElement.innerHTML = ''
       this.layoutManager.rootElement.appendChild(row.element)
       this.layoutManager.updateLayout()
-    } else if (edge === 'center') {
+    } else if (false) {
       // Add tab to existing stack
       newComp = new ComponentItem(newItemConfig, this.layoutManager)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
src/managers/DragManager.js:451:16
       this.layoutManager.rootElement.innerHTML = ''
       this.layoutManager.rootElement.appendChild(row.element)
       this.layoutManager.updateLayout()
-    } else if (edge === 'center') {
+    } else if (true) {
       // Add tab to existing stack
       newComp = new ComponentItem(newItemConfig, this.layoutManager)
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "row"
Received: "stack"

[Killed] ConditionalExpression
src/managers/DragManager.js:455:16
       // Add tab to existing stack
       newComp = new ComponentItem(newItemConfig, this.layoutManager)
       target.addChild(newComp)
-    } else if (edge === 'tab_insert') {
+    } else if (true) {
       newComp = new ComponentItem(newItemConfig, this.layoutManager)
       let idx = this.currentDropZone.insertIndex
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "row"
Received: "stack"

[Killed] EqualityOperator
src/managers/DragManager.js:455:16
       // Add tab to existing stack
       newComp = new ComponentItem(newItemConfig, this.layoutManager)
       target.addChild(newComp)
-    } else if (edge === 'tab_insert') {
+    } else if (edge !== 'tab_insert') {
       newComp = new ComponentItem(newItemConfig, this.layoutManager)
       let idx = this.currentDropZone.insertIndex
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "row"
Received: "stack"

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:458:11
     } else if (edge === 'tab_insert') {
       newComp = new ComponentItem(newItemConfig, this.layoutManager)
       let idx = this.currentDropZone.insertIndex
-      if (adjustIndex) idx--
+      if (false) idx--
       target.addChild(newComp, idx)
     } else {

[NoCoverage] UpdateOperator
src/managers/DragManager.js:458:24
     } else if (edge === 'tab_insert') {
       newComp = new ComponentItem(newItemConfig, this.layoutManager)
       let idx = this.currentDropZone.insertIndex
-      if (adjustIndex) idx--
+      if (adjustIndex) idx++
       target.addChild(newComp, idx)
     } else {

[Killed] ConditionalExpression
src/managers/DragManager.js:462:24
       target.addChild(newComp, idx)
     } else {
       // Split
-      const isHoriz = (edge === 'left' || edge === 'right')
+      const isHoriz = (true)
       const isFirst = (edge === 'left' || edge === 'top')
 
killedBy: DragManager Integration Tests splitting a stack vertically (bottom side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "column"
Received: "row"

[Killed] LogicalOperator
src/managers/DragManager.js:462:24
       target.addChild(newComp, idx)
     } else {
       // Split
-      const isHoriz = (edge === 'left' || edge === 'right')
+      const isHoriz = (edge === 'left' && edge === 'right')
       const isFirst = (edge === 'left' || edge === 'top')
 
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "row"
Received: "column"

[Killed] EqualityOperator
src/managers/DragManager.js:463:24
     } else {
       // Split
       const isHoriz = (edge === 'left' || edge === 'right')
-      const isFirst = (edge === 'left' || edge === 'top')
+      const isFirst = (edge !== 'left' || edge === 'top')
 
       // We need to insert a new Row or Column conceptually, or replace target in its parent
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "new-comp"
Received: "c1"

[Killed] EqualityOperator
src/managers/DragManager.js:463:43
     } else {
       // Split
       const isHoriz = (edge === 'left' || edge === 'right')
-      const isFirst = (edge === 'left' || edge === 'top')
+      const isFirst = (edge === 'left' || edge !== 'top')
 
       // We need to insert a new Row or Column conceptually, or replace target in its parent
killedBy: DragManager Integration Tests splitting a stack vertically (bottom side)
statusReason: TypeError: Cannot read private member #channel from an object whose class did not declare it

[Survived] StringLiteral
src/managers/DragManager.js:468:46
       // We need to insert a new Row or Column conceptually, or replace target in its parent
       // For simplicity: target is a Stack. Its parent is Row or Col.
       const parent = target.parent
-      const newStack = new StackItem({ type: 'stack', tabPosition: newItemConfig.tabPosition }, this.layoutManager)
+      const newStack = new StackItem({ type: "", tabPosition: newItemConfig.tabPosition }, this.layoutManager)
       newComp = new ComponentItem(newItemConfig, this.layoutManager)
       newStack.addChild(newComp)

[Killed] ConditionalExpression
src/managers/DragManager.js:472:11
       newComp = new ComponentItem(newItemConfig, this.layoutManager)
       newStack.addChild(newComp)
 
-      if (parent instanceof RowItem && isHoriz) {
+      if (true) {
         // Split row
         const index = parent.children.indexOf(target)
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: TypeError: Cannot read properties of null (reading 'children')

[Killed] LogicalOperator
src/managers/DragManager.js:472:11
       newComp = new ComponentItem(newItemConfig, this.layoutManager)
       newStack.addChild(newComp)
 
-      if (parent instanceof RowItem && isHoriz) {
+      if (parent instanceof RowItem || isHoriz) {
         // Split row
         const index = parent.children.indexOf(target)
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: TypeError: Cannot read properties of null (reading 'children')

[NoCoverage] LogicalOperator
src/managers/DragManager.js:475:28
       if (parent instanceof RowItem && isHoriz) {
         // Split row
         const index = parent.children.indexOf(target)
-        const targetSize = target.size ?? 50
+        const targetSize = target.size && 50
 
         if (typeof targetSize === 'number') {

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:477:13
         const index = parent.children.indexOf(target)
         const targetSize = target.size ?? 50
 
-        if (typeof targetSize === 'number') {
+        if (false) {
           target.size = targetSize / 2
           newStack.size = targetSize / 2

[NoCoverage] EqualityOperator
src/managers/DragManager.js:477:13
         const index = parent.children.indexOf(target)
         const targetSize = target.size ?? 50
 
-        if (typeof targetSize === 'number') {
+        if (typeof targetSize !== 'number') {
           target.size = targetSize / 2
           newStack.size = targetSize / 2

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:478:25
         const targetSize = target.size ?? 50
 
         if (typeof targetSize === 'number') {
-          target.size = targetSize / 2
+          target.size = targetSize * 2
           newStack.size = targetSize / 2
         } else {

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:479:27
 
         if (typeof targetSize === 'number') {
           target.size = targetSize / 2
-          newStack.size = targetSize / 2
+          newStack.size = targetSize * 2
         } else {
           const parsed = Utils.parseSize(targetSize)

[NoCoverage] BlockStatement
src/managers/DragManager.js:480:16
         if (typeof targetSize === 'number') {
           target.size = targetSize / 2
           newStack.size = targetSize / 2
-        } else {
-          const parsed = Utils.parseSize(targetSize)
-          target.size = (parsed.value / 2) + parsed.unit
-          newStack.size = (parsed.value / 2) + parsed.unit
-        }
+        } else {}
         parent.addChild(newStack, isFirst ? index : index + 1)
       } else if (parent instanceof ColumnItem && !isHoriz) {

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:482:26
           newStack.size = targetSize / 2
         } else {
           const parsed = Utils.parseSize(targetSize)
-          target.size = (parsed.value / 2) + parsed.unit
+          target.size = (parsed.value * 2) + parsed.unit
           newStack.size = (parsed.value / 2) + parsed.unit
         }

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:482:25
           newStack.size = targetSize / 2
         } else {
           const parsed = Utils.parseSize(targetSize)
-          target.size = (parsed.value / 2) + parsed.unit
+          target.size = parsed.value / 2 - parsed.unit
           newStack.size = (parsed.value / 2) + parsed.unit
         }

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:483:28
         } else {
           const parsed = Utils.parseSize(targetSize)
           target.size = (parsed.value / 2) + parsed.unit
-          newStack.size = (parsed.value / 2) + parsed.unit
+          newStack.size = (parsed.value * 2) + parsed.unit
         }
         parent.addChild(newStack, isFirst ? index : index + 1)

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:483:27
         } else {
           const parsed = Utils.parseSize(targetSize)
           target.size = (parsed.value / 2) + parsed.unit
-          newStack.size = (parsed.value / 2) + parsed.unit
+          newStack.size = parsed.value / 2 - parsed.unit
         }
         parent.addChild(newStack, isFirst ? index : index + 1)

[NoCoverage] ArithmeticOperator
src/managers/DragManager.js:485:53
           target.size = (parsed.value / 2) + parsed.unit
           newStack.size = (parsed.value / 2) + parsed.unit
         }
-        parent.addChild(newStack, isFirst ? index : index + 1)
+        parent.addChild(newStack, isFirst ? index : index - 1)
       } else if (parent instanceof ColumnItem && !isHoriz) {
         // Split column

[Killed] ConditionalExpression
src/managers/DragManager.js:486:18
           newStack.size = (parsed.value / 2) + parsed.unit
         }
         parent.addChild(newStack, isFirst ? index : index + 1)
-      } else if (parent instanceof ColumnItem && !isHoriz) {
+      } else if (true) {
         // Split column
         const index = parent.children.indexOf(target)
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: TypeError: Cannot read properties of null (reading 'children')

[Killed] LogicalOperator
src/managers/DragManager.js:486:18
           newStack.size = (parsed.value / 2) + parsed.unit
         }
         parent.addChild(newStack, isFirst ? index : index + 1)
-      } else if (parent instanceof ColumnItem && !isHoriz) {
+      } else if (parent instanceof ColumnItem || !isHoriz) {
         // Split column
         const index = parent.children.indexOf(target)
killedBy: DragManager Integration Tests splitting a stack vertically (bottom side)
statusReason: TypeError: Cannot read properties of null (reading 'children')

[NoCoverage] BlockStatement
src/managers/DragManager.js:491:45
         const index = parent.children.indexOf(target)
         const targetSize = target.size ?? 50
 
-        if (typeof targetSize === 'number') {
-          target.size = targetSize / 2
-          newStack.size = targetSize / 2
-        } else {
+        if (typeof targetSize === 'number') {} else {
           const parsed = Utils.parseSize(targetSize)
           target.size = (parsed.value / 2) + parsed.unit

[NoCoverage] ConditionalExpression
src/managers/DragManager.js:491:13
         const index = parent.children.indexOf(target)
         const targetSize = target.size ?? 50
 
-        if (typeof targetSize === 'number') {
+        if (true) {
           target.size = targetSize / 2
           newStack.size = targetSize / 2

[Killed] BlockStatement
src/managers/DragManager.js:500:14
           newStack.size = (parsed.value / 2) + parsed.unit
         }
         parent.addChild(newStack, isFirst ? index : index + 1)
-      } else {
-        // Need to wrap target in a new Row/Col
-        const WrapperType = isHoriz ? RowItem : ColumnItem
-        const wrapper = new WrapperType({ type: isHoriz ? 'row' : 'column' }, this.layoutManager)
-
-        if (parent) {
-          const pIndex = parent.children.indexOf(target)
-          wrapper.size = target.size
-          target.size = 50
-          newStack.size = 50
-
-          // Swap target with wrapper in parent
-          parent.replaceChild(target, wrapper, pIndex)
-        } else {
-          // Splitting the root item
-          this.layoutManager.root = wrapper
-          this.layoutManager.rootElement.innerHTML = ''
-          this.layoutManager.rootElement.appendChild(wrapper.element)
-          target.size = 50
-          newStack.size = 50
-        }
-
-        wrapper.addChild(isFirst ? newStack : target)
-        wrapper.addChild(isFirst ? target : newStack)
-      }
+      } else {}
 
       // Triggers resize
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "row"
Received: "stack"

[Survived] ObjectLiteral
src/managers/DragManager.js:503:41
       } else {
         // Need to wrap target in a new Row/Col
         const WrapperType = isHoriz ? RowItem : ColumnItem
-        const wrapper = new WrapperType({ type: isHoriz ? 'row' : 'column' }, this.layoutManager)
+        const wrapper = new WrapperType({}, this.layoutManager)
 
         if (parent) {

[Survived] StringLiteral
src/managers/DragManager.js:503:59
       } else {
         // Need to wrap target in a new Row/Col
         const WrapperType = isHoriz ? RowItem : ColumnItem
-        const wrapper = new WrapperType({ type: isHoriz ? 'row' : 'column' }, this.layoutManager)
+        const wrapper = new WrapperType({ type: isHoriz ? "" : 'column' }, this.layoutManager)
 
         if (parent) {

[Killed] ConditionalExpression
src/managers/DragManager.js:505:13
         const WrapperType = isHoriz ? RowItem : ColumnItem
         const wrapper = new WrapperType({ type: isHoriz ? 'row' : 'column' }, this.layoutManager)
 
-        if (parent) {
+        if (true) {
           const pIndex = parent.children.indexOf(target)
           wrapper.size = target.size
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: TypeError: Cannot read properties of null (reading 'children')

[Survived] ConditionalExpression
src/managers/DragManager.js:505:13
         const WrapperType = isHoriz ? RowItem : ColumnItem
         const wrapper = new WrapperType({ type: isHoriz ? 'row' : 'column' }, this.layoutManager)
 
-        if (parent) {
+        if (false) {
           const pIndex = parent.children.indexOf(target)
           wrapper.size = target.size

[Killed] BlockStatement
src/managers/DragManager.js:513:16
 
           // Swap target with wrapper in parent
           parent.replaceChild(target, wrapper, pIndex)
-        } else {
-          // Splitting the root item
-          this.layoutManager.root = wrapper
-          this.layoutManager.rootElement.innerHTML = ''
-          this.layoutManager.rootElement.appendChild(wrapper.element)
-          target.size = 50
-          newStack.size = 50
-        }
+        } else {}
 
         wrapper.addChild(isFirst ? newStack : target)
killedBy: DragManager Integration Tests splitting a stack horizontally (left side)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "row"
Received: "stack"

[Survived] StringLiteral
src/managers/DragManager.js:516:54
         } else {
           // Splitting the root item
           this.layoutManager.root = wrapper
-          this.layoutManager.rootElement.innerHTML = ''
+          this.layoutManager.rootElement.innerHTML = "Stryker was here!"
           this.layoutManager.rootElement.appendChild(wrapper.element)
           target.size = 50

[Survived] BlockStatement
src/managers/DragManager.js:530:47
       this.layoutManager.updateLayout()
     }
 
-    if (this.sourceType === 'tab' && newComp) {
-      newComp.emit('didMove', { source: this.sourceStack, target: newComp.parent })
-      newComp.emit('move')
-    }
+    if (this.sourceType === 'tab' && newComp) {}
   }
 }

[Survived] LogicalOperator
src/managers/DragManager.js:530:9
       this.layoutManager.updateLayout()
     }
 
-    if (this.sourceType === 'tab' && newComp) {
+    if (this.sourceType === 'tab' || newComp) {
       newComp.emit('didMove', { source: this.sourceStack, target: newComp.parent })
       newComp.emit('move')

[Survived] ObjectLiteral
src/managers/DragManager.js:531:31
     }
 
     if (this.sourceType === 'tab' && newComp) {
-      newComp.emit('didMove', { source: this.sourceStack, target: newComp.parent })
+      newComp.emit('didMove', {})
       newComp.emit('move')
     }

[Survived] StringLiteral
src/managers/DragManager.js:532:20
 
     if (this.sourceType === 'tab' && newComp) {
       newComp.emit('didMove', { source: this.sourceStack, target: newComp.parent })
-      newComp.emit('move')
+      newComp.emit("")
     }
   }
