[Survived] ObjectLiteral
src/LayoutManager.js:18:35
     this.container = container
     this.componentFactories = {}
     this.root = null
-    this.settings = Object.assign({
-      onlyResizeActiveTabs: true,
-      enableMinimize: true,
-      enablePreview: false,
-      enablePopout: false
-    }, config && config.settings ? config.settings : {}, options)
+    this.settings = Object.assign({}, config && config.settings ? config.settings : {}, options)
 
     // Create root DOM element

[Survived] BooleanLiteral
src/LayoutManager.js:19:29
     this.componentFactories = {}
     this.root = null
     this.settings = Object.assign({
-      onlyResizeActiveTabs: true,
+      onlyResizeActiveTabs: false,
       enableMinimize: true,
       enablePreview: false,

[Survived] BooleanLiteral
src/LayoutManager.js:20:23
     this.root = null
     this.settings = Object.assign({
       onlyResizeActiveTabs: true,
-      enableMinimize: true,
+      enableMinimize: false,
       enablePreview: false,
       enablePopout: false

[Survived] BooleanLiteral
src/LayoutManager.js:21:22
     this.settings = Object.assign({
       onlyResizeActiveTabs: true,
       enableMinimize: true,
-      enablePreview: false,
+      enablePreview: true,
       enablePopout: false
     }, config && config.settings ? config.settings : {}, options)

[Survived] BooleanLiteral
src/LayoutManager.js:22:21
       onlyResizeActiveTabs: true,
       enableMinimize: true,
       enablePreview: false,
-      enablePopout: false
+      enablePopout: true
     }, config && config.settings ? config.settings : {}, options)
 

[Killed] LogicalOperator
src/LayoutManager.js:23:8
       enableMinimize: true,
       enablePreview: false,
       enablePopout: false
-    }, config && config.settings ? config.settings : {}, options)
+    }, config || config.settings ? config.settings : {}, options)
 
     // Create root DOM element
killedBy: PopoutManager Unit Tests LayoutManager has PopoutManager initialized when enabled
statusReason: TypeError: Cannot read properties of null (reading 'settings')

[Killed] ConditionalExpression
src/LayoutManager.js:23:8
       enableMinimize: true,
       enablePreview: false,
       enablePopout: false
-    }, config && config.settings ? config.settings : {}, options)
+    }, true ? config.settings : {}, options)
 
     // Create root DOM element
killedBy: PopoutManager Unit Tests LayoutManager has PopoutManager initialized when enabled
statusReason: TypeError: Cannot read properties of null (reading 'settings')

[Killed] StringLiteral
src/LayoutManager.js:26:51
     }, config && config.settings ? config.settings : {}, options)
 
     // Create root DOM element
-    this.rootElement = Utils.createElement('div', 'tulweb-root', container)
+    this.rootElement = Utils.createElement('div', "", container)
 
     // Add toast container
killedBy: LayoutManager initializes with a container
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] StringLiteral
src/LayoutManager.js:26:44
     }, config && config.settings ? config.settings : {}, options)
 
     // Create root DOM element
-    this.rootElement = Utils.createElement('div', 'tulweb-root', container)
+    this.rootElement = Utils.createElement("", 'tulweb-root', container)
 
     // Add toast container
killedBy: PopoutManager Unit Tests LayoutManager has PopoutManager initialized when enabled
statusReason: InvalidCharacterError: "" did not match the Name production

[Survived] StringLiteral
src/LayoutManager.js:29:54
     this.rootElement = Utils.createElement('div', 'tulweb-root', container)
 
     // Add toast container
-    this.toastContainer = Utils.createElement('div', 'tulweb-toast-container', document.body)
+    this.toastContainer = Utils.createElement('div', "", document.body)
 
     this.activeStack = null

[Killed] BlockStatement
src/LayoutManager.js:38:17
     // Initialize popout manager
     this.popoutManager = new PopoutManager(this)
 
-    if (config) {
-      this.loadLayout(config)
-    }
+    if (config) {}
 
     // Handle window resize with debounce
killedBy: LayoutManager loads a simple layout
statusReason: Error: expect(received).not.toBeNull()

Received: null

[NoCoverage] BlockStatement
src/LayoutManager.js:44:34
 
     // Handle window resize with debounce
     this._resizeTimeout = null
-    this._onWindowResize = () => {
-      clearTimeout(this._resizeTimeout)
-      this._resizeTimeout = setTimeout(() => {
-        this.updateLayout()
-      }, 100)
-    }
+    this._onWindowResize = () => {}
     window.addEventListener('resize', this._onWindowResize)
 

[NoCoverage] BlockStatement
src/LayoutManager.js:46:46
     this._resizeTimeout = null
     this._onWindowResize = () => {
       clearTimeout(this._resizeTimeout)
-      this._resizeTimeout = setTimeout(() => {
-        this.updateLayout()
-      }, 100)
+      this._resizeTimeout = setTimeout(() => {}, 100)
     }
     window.addEventListener('resize', this._onWindowResize)

[NoCoverage] BlockStatement
src/LayoutManager.js:54:30
 
     // Scope keyboard handling to root element for multi-instance support
     this.rootElement.setAttribute('tabindex', '-1')
-    this._onKeyDown = (e) => {
-      this.handleGlobalKeydown(e)
-    }
+    this._onKeyDown = (e) => {}
     this.rootElement.addEventListener('keydown', this._onKeyDown)
   }

[Killed] BlockStatement
src/LayoutManager.js:60:14
     this.rootElement.addEventListener('keydown', this._onKeyDown)
   }
 
-  destroy () {
-    window.removeEventListener('resize', this._onWindowResize)
-    if (this.rootElement) {
-      this.rootElement.removeEventListener('keydown', this._onKeyDown)
-    }
-    if (this.popoutManager) {
-      this.popoutManager.destroy()
-    }
-    if (this.root) this.root.destroy()
-    if (this.rootElement && this.rootElement.parentElement) {
-      this.rootElement.parentElement.removeChild(this.rootElement)
-    }
-    if (this.toastContainer && this.toastContainer.parentElement) {
-      this.toastContainer.parentElement.removeChild(this.toastContainer)
-    }
-    if (this.dragManager) {
-      this.dragManager.destroy()
-    }
-    if (this.contextMenu) {
-      this.contextMenu.destroy()
-    }
-  }
+  destroy () {}
 
   registerComponent (name, factoryMethod) {
killedBy: LayoutManager destroy() cleans up the root element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "<div class=\"tulweb-root\" tabindex=\"-1\"></div>"

[Survived] StringLiteral
src/LayoutManager.js:61:32
   }
 
   destroy () {
-    window.removeEventListener('resize', this._onWindowResize)
+    window.removeEventListener("", this._onWindowResize)
     if (this.rootElement) {
       this.rootElement.removeEventListener('keydown', this._onKeyDown)

[Survived] BlockStatement
src/LayoutManager.js:62:27
 
   destroy () {
     window.removeEventListener('resize', this._onWindowResize)
-    if (this.rootElement) {
-      this.rootElement.removeEventListener('keydown', this._onKeyDown)
-    }
+    if (this.rootElement) {}
     if (this.popoutManager) {
       this.popoutManager.destroy()

[Survived] ConditionalExpression
src/LayoutManager.js:62:9
 
   destroy () {
     window.removeEventListener('resize', this._onWindowResize)
-    if (this.rootElement) {
+    if (true) {
       this.rootElement.removeEventListener('keydown', this._onKeyDown)
     }

[Survived] ConditionalExpression
src/LayoutManager.js:65:9
     if (this.rootElement) {
       this.rootElement.removeEventListener('keydown', this._onKeyDown)
     }
-    if (this.popoutManager) {
+    if (true) {
       this.popoutManager.destroy()
     }

[Survived] ConditionalExpression
src/LayoutManager.js:65:9
     if (this.rootElement) {
       this.rootElement.removeEventListener('keydown', this._onKeyDown)
     }
-    if (this.popoutManager) {
+    if (false) {
       this.popoutManager.destroy()
     }

[Killed] ConditionalExpression
src/LayoutManager.js:68:9
     if (this.popoutManager) {
       this.popoutManager.destroy()
     }
-    if (this.root) this.root.destroy()
+    if (true) this.root.destroy()
     if (this.rootElement && this.rootElement.parentElement) {
       this.rootElement.parentElement.removeChild(this.rootElement)
killedBy: PopoutManager Unit Tests LayoutManager has PopoutManager initialized when enabled
statusReason: TypeError: Cannot read properties of null (reading 'destroy')

[Survived] ConditionalExpression
src/LayoutManager.js:68:9
     if (this.popoutManager) {
       this.popoutManager.destroy()
     }
-    if (this.root) this.root.destroy()
+    if (false) this.root.destroy()
     if (this.rootElement && this.rootElement.parentElement) {
       this.rootElement.parentElement.removeChild(this.rootElement)

[Killed] BlockStatement
src/LayoutManager.js:69:61
       this.popoutManager.destroy()
     }
     if (this.root) this.root.destroy()
-    if (this.rootElement && this.rootElement.parentElement) {
-      this.rootElement.parentElement.removeChild(this.rootElement)
-    }
+    if (this.rootElement && this.rootElement.parentElement) {}
     if (this.toastContainer && this.toastContainer.parentElement) {
       this.toastContainer.parentElement.removeChild(this.toastContainer)
killedBy: LayoutManager destroy() cleans up the root element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "<div class=\"tulweb-root\" tabindex=\"-1\"></div>"

[Killed] ConditionalExpression
src/LayoutManager.js:69:9
       this.popoutManager.destroy()
     }
     if (this.root) this.root.destroy()
-    if (this.rootElement && this.rootElement.parentElement) {
+    if (false) {
       this.rootElement.parentElement.removeChild(this.rootElement)
     }
killedBy: LayoutManager destroy() cleans up the root element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "<div class=\"tulweb-root\" tabindex=\"-1\"></div>"

[Survived] ConditionalExpression
src/LayoutManager.js:72:9
     if (this.rootElement && this.rootElement.parentElement) {
       this.rootElement.parentElement.removeChild(this.rootElement)
     }
-    if (this.toastContainer && this.toastContainer.parentElement) {
+    if (false) {
       this.toastContainer.parentElement.removeChild(this.toastContainer)
     }

[Survived] ConditionalExpression
src/LayoutManager.js:72:9
     if (this.rootElement && this.rootElement.parentElement) {
       this.rootElement.parentElement.removeChild(this.rootElement)
     }
-    if (this.toastContainer && this.toastContainer.parentElement) {
+    if (true) {
       this.toastContainer.parentElement.removeChild(this.toastContainer)
     }

[Survived] ConditionalExpression
src/LayoutManager.js:75:9
     if (this.toastContainer && this.toastContainer.parentElement) {
       this.toastContainer.parentElement.removeChild(this.toastContainer)
     }
-    if (this.dragManager) {
+    if (true) {
       this.dragManager.destroy()
     }

[Survived] BlockStatement
src/LayoutManager.js:75:27
     if (this.toastContainer && this.toastContainer.parentElement) {
       this.toastContainer.parentElement.removeChild(this.toastContainer)
     }
-    if (this.dragManager) {
-      this.dragManager.destroy()
-    }
+    if (this.dragManager) {}
     if (this.contextMenu) {
       this.contextMenu.destroy()

[Killed] ConditionalExpression
src/LayoutManager.js:78:9
     if (this.dragManager) {
       this.dragManager.destroy()
     }
-    if (this.contextMenu) {
+    if (true) {
       this.contextMenu.destroy()
     }
killedBy: PopoutManager Unit Tests LayoutManager has PopoutManager initialized when enabled
statusReason: TypeError: Cannot read properties of undefined (reading 'destroy')

[NoCoverage] BlockStatement
src/LayoutManager.js:78:27
     if (this.dragManager) {
       this.dragManager.destroy()
     }
-    if (this.contextMenu) {
-      this.contextMenu.destroy()
-    }
+    if (this.contextMenu) {}
   }
 

[Killed] BlockStatement
src/LayoutManager.js:83:43
     }
   }
 
-  registerComponent (name, factoryMethod) {
-    this.componentFactories[name] = factoryMethod
-  }
+  registerComponent (name, factoryMethod) {}
 
   createDragSource (element, itemConfig) {
killedBy: LayoutManager registers components correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: [Function factory]
Received: undefined

[NoCoverage] BlockStatement
src/LayoutManager.js:87:42
     this.componentFactories[name] = factoryMethod
   }
 
-  createDragSource (element, itemConfig) {
-    return new DragSource(element, itemConfig, this)
-  }
+  createDragSource (element, itemConfig) {}
 
   loadLayout (config) {

[Killed] BlockStatement
src/LayoutManager.js:91:23
     return new DragSource(element, itemConfig, this)
   }
 
-  loadLayout (config) {
-    if (!config) throw new Error('Layout config is required')
-
-    // Basic Validation (Tier 3)
-    if (config.content && !Array.isArray(config.content)) {
-      throw new Error("Invalid config: 'content' must be an array")
-    }
-
-    this.rootElement.innerHTML = ''
-    if (config.settings) {
-      this.settings = Object.assign(this.settings, config.settings)
-    }
-    if (!config.content || !Array.isArray(config.content) || config.content.length === 0) {
-      this.root = null
-      this.renderEmptyState()
-      return
-    }
-
-    // Config usually wraps in Row or Column.
-    this.root = this._buildObjectTree(config.content[0])
-    this.rootElement.appendChild(this.root.element)
-    this.root.updateLayout()
-  }
+  loadLayout (config) {}
 
   _buildObjectTree (config) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/LayoutManager.js:92:9
   }
 
   loadLayout (config) {
-    if (!config) throw new Error('Layout config is required')
+    if (true) throw new Error('Layout config is required')
 
     // Basic Validation (Tier 3)
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: Layout config is required

[Killed] BooleanLiteral
src/LayoutManager.js:92:9
   }
 
   loadLayout (config) {
-    if (!config) throw new Error('Layout config is required')
+    if (config) throw new Error('Layout config is required')
 
     // Basic Validation (Tier 3)
killedBy: LayoutManager loads a simple layout
statusReason: Error: Layout config is required

[Killed] BooleanLiteral
src/LayoutManager.js:95:27
     if (!config) throw new Error('Layout config is required')
 
     // Basic Validation (Tier 3)
-    if (config.content && !Array.isArray(config.content)) {
+    if (config.content && Array.isArray(config.content)) {
       throw new Error("Invalid config: 'content' must be an array")
     }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: Invalid config: 'content' must be an array

[Killed] ConditionalExpression
src/LayoutManager.js:95:9
     if (!config) throw new Error('Layout config is required')
 
     // Basic Validation (Tier 3)
-    if (config.content && !Array.isArray(config.content)) {
+    if (true) {
       throw new Error("Invalid config: 'content' must be an array")
     }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: Invalid config: 'content' must be an array

[Survived] StringLiteral
src/LayoutManager.js:99:34
       throw new Error("Invalid config: 'content' must be an array")
     }
 
-    this.rootElement.innerHTML = ''
+    this.rootElement.innerHTML = "Stryker was here!"
     if (config.settings) {
       this.settings = Object.assign(this.settings, config.settings)

[Survived] ConditionalExpression
src/LayoutManager.js:100:9
     }
 
     this.rootElement.innerHTML = ''
-    if (config.settings) {
+    if (false) {
       this.settings = Object.assign(this.settings, config.settings)
     }

[Survived] ConditionalExpression
src/LayoutManager.js:100:9
     }
 
     this.rootElement.innerHTML = ''
-    if (config.settings) {
+    if (true) {
       this.settings = Object.assign(this.settings, config.settings)
     }

[Killed] BooleanLiteral
src/LayoutManager.js:103:28
     if (config.settings) {
       this.settings = Object.assign(this.settings, config.settings)
     }
-    if (!config.content || !Array.isArray(config.content) || config.content.length === 0) {
+    if (!config.content || Array.isArray(config.content) || config.content.length === 0) {
       this.root = null
       this.renderEmptyState()
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] EqualityOperator
src/LayoutManager.js:103:62
     if (config.settings) {
       this.settings = Object.assign(this.settings, config.settings)
     }
-    if (!config.content || !Array.isArray(config.content) || config.content.length === 0) {
+    if (!config.content || !Array.isArray(config.content) || config.content.length !== 0) {
       this.root = null
       this.renderEmptyState()
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BooleanLiteral
src/LayoutManager.js:116:9
   }
 
   _buildObjectTree (config) {
-    if (!config) return null
+    if (config) return null
     let item
 
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of null (reading 'element')

[Killed] ConditionalExpression
src/LayoutManager.js:116:9
   }
 
   _buildObjectTree (config) {
-    if (!config) return null
+    if (true) return null
     let item
 
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of null (reading 'element')

[Killed] EqualityOperator
src/LayoutManager.js:119:9
     if (!config) return null
     let item
 
-    if (config.type === 'row') {
+    if (config.type !== 'row') {
       item = new RowItem(config, this)
     } else if (config.type === 'column') {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'element')

[Killed] BlockStatement
src/LayoutManager.js:119:32
     if (!config) return null
     let item
 
-    if (config.type === 'row') {
-      item = new RowItem(config, this)
-    } else if (config.type === 'column') {
+    if (config.type === 'row') {} else if (config.type === 'column') {
       item = new ColumnItem(config, this)
     } else if (config.type === 'stack') {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'element')

[Killed] EqualityOperator
src/LayoutManager.js:121:16
 
     if (config.type === 'row') {
       item = new RowItem(config, this)
-    } else if (config.type === 'column') {
+    } else if (config.type !== 'column') {
       item = new ColumnItem(config, this)
     } else if (config.type === 'stack') {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/LayoutManager.js:121:16
 
     if (config.type === 'row') {
       item = new RowItem(config, this)
-    } else if (config.type === 'column') {
+    } else if (true) {
       item = new ColumnItem(config, this)
     } else if (config.type === 'stack') {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/LayoutManager.js:123:16
       item = new RowItem(config, this)
     } else if (config.type === 'column') {
       item = new ColumnItem(config, this)
-    } else if (config.type === 'stack') {
+    } else if (true) {
       item = new StackItem(config, this)
     } else if (config.type === 'component') {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: child.renderAppContent is not a function

[Killed] EqualityOperator
src/LayoutManager.js:123:16
       item = new RowItem(config, this)
     } else if (config.type === 'column') {
       item = new ColumnItem(config, this)
-    } else if (config.type === 'stack') {
+    } else if (config.type !== 'stack') {
       item = new StackItem(config, this)
     } else if (config.type === 'component') {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/LayoutManager.js:125:45
       item = new ColumnItem(config, this)
     } else if (config.type === 'stack') {
       item = new StackItem(config, this)
-    } else if (config.type === 'component') {
-      return new ComponentItem(config, this)
-    }
+    } else if (config.type === 'component') {}
 
     // Recursively build children for container items
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

[Killed] EqualityOperator
src/LayoutManager.js:125:16
       item = new ColumnItem(config, this)
     } else if (config.type === 'stack') {
       item = new StackItem(config, this)
-    } else if (config.type === 'component') {
+    } else if (config.type !== 'component') {
       return new ComponentItem(config, this)
     }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
src/LayoutManager.js:130:9
     }
 
     // Recursively build children for container items
-    if (item && config.content && Array.isArray(config.content)) {
+    if (false) {
       config.content.forEach(childConfig => {
         const child = this._buildObjectTree(childConfig)
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/LayoutManager.js:130:66
     }
 
     // Recursively build children for container items
-    if (item && config.content && Array.isArray(config.content)) {
-      config.content.forEach(childConfig => {
-        const child = this._buildObjectTree(childConfig)
-        if (child) {
-          item.addChild(child, undefined, true)
-        }
-      })
-    }
+    if (item && config.content && Array.isArray(config.content)) {}
 
     return item
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/LayoutManager.js:131:45
 
     // Recursively build children for container items
     if (item && config.content && Array.isArray(config.content)) {
-      config.content.forEach(childConfig => {
-        const child = this._buildObjectTree(childConfig)
-        if (child) {
-          item.addChild(child, undefined, true)
-        }
-      })
+      config.content.forEach(childConfig => {})
     }
 
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/LayoutManager.js:133:13
     if (item && config.content && Array.isArray(config.content)) {
       config.content.forEach(childConfig => {
         const child = this._buildObjectTree(childConfig)
-        if (child) {
+        if (false) {
           item.addChild(child, undefined, true)
         }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/LayoutManager.js:133:20
     if (item && config.content && Array.isArray(config.content)) {
       config.content.forEach(childConfig => {
         const child = this._buildObjectTree(childConfig)
-        if (child) {
-          item.addChild(child, undefined, true)
-        }
+        if (child) {}
       })
     }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] BooleanLiteral
src/LayoutManager.js:134:43
       config.content.forEach(childConfig => {
         const child = this._buildObjectTree(childConfig)
         if (child) {
-          item.addChild(child, undefined, true)
+          item.addChild(child, undefined, false)
         }
       })

[NoCoverage] BlockStatement
src/LayoutManager.js:142:46
     return item
   }
 
-  showContextMenu (evt, stack, child, index) {
-    if (this.contextMenu) {
-      this.contextMenu.destroy()
-    }
-    this.contextMenu = new ContextMenu(this, evt, stack, child, index)
-  }
+  showContextMenu (evt, stack, child, index) {}
 
   handleGlobalKeydown (e) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:143:9
   }
 
   showContextMenu (evt, stack, child, index) {
-    if (this.contextMenu) {
+    if (true) {
       this.contextMenu.destroy()
     }

[NoCoverage] ConditionalExpression
src/LayoutManager.js:143:9
   }
 
   showContextMenu (evt, stack, child, index) {
-    if (this.contextMenu) {
+    if (false) {
       this.contextMenu.destroy()
     }

[NoCoverage] LogicalOperator
src/LayoutManager.js:150:9
   }
 
   handleGlobalKeydown (e) {
-    if (e.ctrlKey || e.metaKey) {
+    if (e.ctrlKey && e.metaKey) {
       if (e.key.toLowerCase() === 's') {
         e.preventDefault()

[NoCoverage] BlockStatement
src/LayoutManager.js:150:33
   }
 
   handleGlobalKeydown (e) {
-    if (e.ctrlKey || e.metaKey) {
-      if (e.key.toLowerCase() === 's') {
-        e.preventDefault()
-        // Emit an event so applications can handle save in their own way
-        this.emit('saveRequested')
-      }
-      if (e.key.toLowerCase() === 'w') {
-        let active = this.activeStack
-        if (!active) {
-          const stacks = this.getAllStacks()
-            .filter(s => s.children.length > 0)
-          if (stacks.length > 0) active = stacks[0]
-        }
-        if (active && active.children.length > 0) {
-          e.preventDefault()
-          const idx = active.activeChildIndex
-          const child = active.children[idx]
-          child.destroy()
-        }
-      }
-    }
+    if (e.ctrlKey || e.metaKey) {}
     if (e.altKey) {
       if (['ArrowRight', 'ArrowLeft', 'ArrowUp', 'ArrowDown'].includes(e.key)) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:151:11
 
   handleGlobalKeydown (e) {
     if (e.ctrlKey || e.metaKey) {
-      if (e.key.toLowerCase() === 's') {
+      if (true) {
         e.preventDefault()
         // Emit an event so applications can handle save in their own way

[NoCoverage] MethodExpression
src/LayoutManager.js:151:11
 
   handleGlobalKeydown (e) {
     if (e.ctrlKey || e.metaKey) {
-      if (e.key.toLowerCase() === 's') {
+      if (e.key.toUpperCase() === 's') {
         e.preventDefault()
         // Emit an event so applications can handle save in their own way

[NoCoverage] MethodExpression
src/LayoutManager.js:156:11
         // Emit an event so applications can handle save in their own way
         this.emit('saveRequested')
       }
-      if (e.key.toLowerCase() === 'w') {
+      if (e.key.toUpperCase() === 'w') {
         let active = this.activeStack
         if (!active) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:156:11
         // Emit an event so applications can handle save in their own way
         this.emit('saveRequested')
       }
-      if (e.key.toLowerCase() === 'w') {
+      if (false) {
         let active = this.activeStack
         if (!active) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:158:13
       }
       if (e.key.toLowerCase() === 'w') {
         let active = this.activeStack
-        if (!active) {
+        if (false) {
           const stacks = this.getAllStacks()
             .filter(s => s.children.length > 0)

[NoCoverage] ConditionalExpression
src/LayoutManager.js:158:13
       }
       if (e.key.toLowerCase() === 'w') {
         let active = this.activeStack
-        if (!active) {
+        if (true) {
           const stacks = this.getAllStacks()
             .filter(s => s.children.length > 0)

[NoCoverage] MethodExpression
src/LayoutManager.js:159:26
       if (e.key.toLowerCase() === 'w') {
         let active = this.activeStack
         if (!active) {
-          const stacks = this.getAllStacks()
-            .filter(s => s.children.length > 0)
+          const stacks = this.getAllStacks()
           if (stacks.length > 0) active = stacks[0]
         }

[NoCoverage] EqualityOperator
src/LayoutManager.js:160:26
         let active = this.activeStack
         if (!active) {
           const stacks = this.getAllStacks()
-            .filter(s => s.children.length > 0)
+            .filter(s => s.children.length <= 0)
           if (stacks.length > 0) active = stacks[0]
         }
