[NoCoverage] ConditionalExpression
src/LayoutManager.js:160:26
         let active = this.activeStack
         if (!active) {
           const stacks = this.getAllStacks()
-            .filter(s => s.children.length > 0)
+            .filter(s => false)
           if (stacks.length > 0) active = stacks[0]
         }

[NoCoverage] ConditionalExpression
src/LayoutManager.js:161:15
         if (!active) {
           const stacks = this.getAllStacks()
             .filter(s => s.children.length > 0)
-          if (stacks.length > 0) active = stacks[0]
+          if (false) active = stacks[0]
         }
         if (active && active.children.length > 0) {

[NoCoverage] EqualityOperator
src/LayoutManager.js:161:15
         if (!active) {
           const stacks = this.getAllStacks()
             .filter(s => s.children.length > 0)
-          if (stacks.length > 0) active = stacks[0]
+          if (stacks.length >= 0) active = stacks[0]
         }
         if (active && active.children.length > 0) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:163:13
             .filter(s => s.children.length > 0)
           if (stacks.length > 0) active = stacks[0]
         }
-        if (active && active.children.length > 0) {
+        if (true) {
           e.preventDefault()
           const idx = active.activeChildIndex

[NoCoverage] ConditionalExpression
src/LayoutManager.js:163:23
             .filter(s => s.children.length > 0)
           if (stacks.length > 0) active = stacks[0]
         }
-        if (active && active.children.length > 0) {
+        if (active && true) {
           e.preventDefault()
           const idx = active.activeChildIndex

[NoCoverage] BlockStatement
src/LayoutManager.js:171:19
         }
       }
     }
-    if (e.altKey) {
-      if (['ArrowRight', 'ArrowLeft', 'ArrowUp', 'ArrowDown'].includes(e.key)) {
-        e.preventDefault()
-        this.navigateFocus(e.key)
-      }
-    }
+    if (e.altKey) {}
   }
 

[NoCoverage] ConditionalExpression
src/LayoutManager.js:171:9
         }
       }
     }
-    if (e.altKey) {
+    if (true) {
       if (['ArrowRight', 'ArrowLeft', 'ArrowUp', 'ArrowDown'].includes(e.key)) {
         e.preventDefault()

[NoCoverage] ConditionalExpression
src/LayoutManager.js:172:11
       }
     }
     if (e.altKey) {
-      if (['ArrowRight', 'ArrowLeft', 'ArrowUp', 'ArrowDown'].includes(e.key)) {
+      if (true) {
         e.preventDefault()
         this.navigateFocus(e.key)

[NoCoverage] BlockStatement
src/LayoutManager.js:172:80
       }
     }
     if (e.altKey) {
-      if (['ArrowRight', 'ArrowLeft', 'ArrowUp', 'ArrowDown'].includes(e.key)) {
-        e.preventDefault()
-        this.navigateFocus(e.key)
-      }
+      if (['ArrowRight', 'ArrowLeft', 'ArrowUp', 'ArrowDown'].includes(e.key)) {}
     }
   }

[NoCoverage] LogicalOperator
src/LayoutManager.js:184:9
   }
 
   navigateFocus (key) {
-    if (!this.activeStack || !this.activeStack.element) return
+    if (!this.activeStack && !this.activeStack.element) return
     const stacks = this.getAllStacks()
 

[NoCoverage] BooleanLiteral
src/LayoutManager.js:184:9
   }
 
   navigateFocus (key) {
-    if (!this.activeStack || !this.activeStack.element) return
+    if (this.activeStack || !this.activeStack.element) return
     const stacks = this.getAllStacks()
 

[NoCoverage] ArithmeticOperator
src/LayoutManager.js:188:35
     const stacks = this.getAllStacks()
 
     const currentRect = this.activeStack.element.getBoundingClientRect()
-    const cx = currentRect.left + currentRect.width / 2
+    const cx = currentRect.left + currentRect.width * 2
     const cy = currentRect.top + currentRect.height / 2
 

[NoCoverage] ArithmeticOperator
src/LayoutManager.js:188:16
     const stacks = this.getAllStacks()
 
     const currentRect = this.activeStack.element.getBoundingClientRect()
-    const cx = currentRect.left + currentRect.width / 2
+    const cx = currentRect.left - currentRect.width / 2
     const cy = currentRect.top + currentRect.height / 2
 

[NoCoverage] ArithmeticOperator
src/LayoutManager.js:189:16
 
     const currentRect = this.activeStack.element.getBoundingClientRect()
     const cx = currentRect.left + currentRect.width / 2
-    const cy = currentRect.top + currentRect.height / 2
+    const cy = currentRect.top - currentRect.height / 2
 
     let bestStack = null

[NoCoverage] ArithmeticOperator
src/LayoutManager.js:189:34
 
     const currentRect = this.activeStack.element.getBoundingClientRect()
     const cx = currentRect.left + currentRect.width / 2
-    const cy = currentRect.top + currentRect.height / 2
+    const cy = currentRect.top + currentRect.height * 2
 
     let bestStack = null

[NoCoverage] BlockStatement
src/LayoutManager.js:194:25
     let bestStack = null
     let bestDist = Infinity
 
-    stacks.forEach(s => {
-      if (s === this.activeStack) return
-      const r = s.element.getBoundingClientRect()
-      const tx = r.left + r.width / 2
-      const ty = r.top + r.height / 2
-
-      let valid = false
-      if (key === 'ArrowRight' && tx > cx) valid = true
-      if (key === 'ArrowLeft' && tx < cx) valid = true
-      if (key === 'ArrowDown' && ty > cy) valid = true
-      if (key === 'ArrowUp' && ty < cy) valid = true
-
-      if (valid) {
-        const dist = Math.pow(tx - cx, 2) + Math.pow(ty - cy, 2)
-        if (dist < bestDist) {
-          bestDist = dist
-          bestStack = s
-        }
-      }
-    })
+    stacks.forEach(s => {})
 
     if (bestStack) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:195:11
     let bestDist = Infinity
 
     stacks.forEach(s => {
-      if (s === this.activeStack) return
+      if (true) return
       const r = s.element.getBoundingClientRect()
       const tx = r.left + r.width / 2

[NoCoverage] EqualityOperator
src/LayoutManager.js:195:11
     let bestDist = Infinity
 
     stacks.forEach(s => {
-      if (s === this.activeStack) return
+      if (s !== this.activeStack) return
       const r = s.element.getBoundingClientRect()
       const tx = r.left + r.width / 2

[NoCoverage] ArithmeticOperator
src/LayoutManager.js:197:18
     stacks.forEach(s => {
       if (s === this.activeStack) return
       const r = s.element.getBoundingClientRect()
-      const tx = r.left + r.width / 2
+      const tx = r.left - r.width / 2
       const ty = r.top + r.height / 2
 

[NoCoverage] ArithmeticOperator
src/LayoutManager.js:197:27
     stacks.forEach(s => {
       if (s === this.activeStack) return
       const r = s.element.getBoundingClientRect()
-      const tx = r.left + r.width / 2
+      const tx = r.left + r.width * 2
       const ty = r.top + r.height / 2
 

[NoCoverage] ArithmeticOperator
src/LayoutManager.js:198:26
       if (s === this.activeStack) return
       const r = s.element.getBoundingClientRect()
       const tx = r.left + r.width / 2
-      const ty = r.top + r.height / 2
+      const ty = r.top + r.height * 2
 
       let valid = false

[NoCoverage] ArithmeticOperator
src/LayoutManager.js:198:18
       if (s === this.activeStack) return
       const r = s.element.getBoundingClientRect()
       const tx = r.left + r.width / 2
-      const ty = r.top + r.height / 2
+      const ty = r.top - r.height / 2
 
       let valid = false

[NoCoverage] BooleanLiteral
src/LayoutManager.js:200:19
       const tx = r.left + r.width / 2
       const ty = r.top + r.height / 2
 
-      let valid = false
+      let valid = true
       if (key === 'ArrowRight' && tx > cx) valid = true
       if (key === 'ArrowLeft' && tx < cx) valid = true

[NoCoverage] ConditionalExpression
src/LayoutManager.js:201:11
       const ty = r.top + r.height / 2
 
       let valid = false
-      if (key === 'ArrowRight' && tx > cx) valid = true
+      if (false) valid = true
       if (key === 'ArrowLeft' && tx < cx) valid = true
       if (key === 'ArrowDown' && ty > cy) valid = true

[NoCoverage] EqualityOperator
src/LayoutManager.js:201:35
       const ty = r.top + r.height / 2
 
       let valid = false
-      if (key === 'ArrowRight' && tx > cx) valid = true
+      if (key === 'ArrowRight' && tx <= cx) valid = true
       if (key === 'ArrowLeft' && tx < cx) valid = true
       if (key === 'ArrowDown' && ty > cy) valid = true

[NoCoverage] EqualityOperator
src/LayoutManager.js:202:34
 
       let valid = false
       if (key === 'ArrowRight' && tx > cx) valid = true
-      if (key === 'ArrowLeft' && tx < cx) valid = true
+      if (key === 'ArrowLeft' && tx <= cx) valid = true
       if (key === 'ArrowDown' && ty > cy) valid = true
       if (key === 'ArrowUp' && ty < cy) valid = true

[NoCoverage] LogicalOperator
src/LayoutManager.js:202:11
 
       let valid = false
       if (key === 'ArrowRight' && tx > cx) valid = true
-      if (key === 'ArrowLeft' && tx < cx) valid = true
+      if (key === 'ArrowLeft' || tx < cx) valid = true
       if (key === 'ArrowDown' && ty > cy) valid = true
       if (key === 'ArrowUp' && ty < cy) valid = true

[NoCoverage] EqualityOperator
src/LayoutManager.js:203:34
       let valid = false
       if (key === 'ArrowRight' && tx > cx) valid = true
       if (key === 'ArrowLeft' && tx < cx) valid = true
-      if (key === 'ArrowDown' && ty > cy) valid = true
+      if (key === 'ArrowDown' && ty <= cy) valid = true
       if (key === 'ArrowUp' && ty < cy) valid = true
 

[NoCoverage] ConditionalExpression
src/LayoutManager.js:203:11
       let valid = false
       if (key === 'ArrowRight' && tx > cx) valid = true
       if (key === 'ArrowLeft' && tx < cx) valid = true
-      if (key === 'ArrowDown' && ty > cy) valid = true
+      if (true) valid = true
       if (key === 'ArrowUp' && ty < cy) valid = true
 

[NoCoverage] ConditionalExpression
src/LayoutManager.js:204:11
       if (key === 'ArrowRight' && tx > cx) valid = true
       if (key === 'ArrowLeft' && tx < cx) valid = true
       if (key === 'ArrowDown' && ty > cy) valid = true
-      if (key === 'ArrowUp' && ty < cy) valid = true
+      if (true) valid = true
 
       if (valid) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:204:11
       if (key === 'ArrowRight' && tx > cx) valid = true
       if (key === 'ArrowLeft' && tx < cx) valid = true
       if (key === 'ArrowDown' && ty > cy) valid = true
-      if (key === 'ArrowUp' && ty < cy) valid = true
+      if (true && ty < cy) valid = true
 
       if (valid) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:206:11
       if (key === 'ArrowDown' && ty > cy) valid = true
       if (key === 'ArrowUp' && ty < cy) valid = true
 
-      if (valid) {
+      if (false) {
         const dist = Math.pow(tx - cx, 2) + Math.pow(ty - cy, 2)
         if (dist < bestDist) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:206:11
       if (key === 'ArrowDown' && ty > cy) valid = true
       if (key === 'ArrowUp' && ty < cy) valid = true
 
-      if (valid) {
+      if (true) {
         const dist = Math.pow(tx - cx, 2) + Math.pow(ty - cy, 2)
         if (dist < bestDist) {

[NoCoverage] ArithmeticOperator
src/LayoutManager.js:207:54
       if (key === 'ArrowUp' && ty < cy) valid = true
 
       if (valid) {
-        const dist = Math.pow(tx - cx, 2) + Math.pow(ty - cy, 2)
+        const dist = Math.pow(tx - cx, 2) + Math.pow(ty + cy, 2)
         if (dist < bestDist) {
           bestDist = dist

[NoCoverage] ArithmeticOperator
src/LayoutManager.js:207:22
       if (key === 'ArrowUp' && ty < cy) valid = true
 
       if (valid) {
-        const dist = Math.pow(tx - cx, 2) + Math.pow(ty - cy, 2)
+        const dist = Math.pow(tx - cx, 2) - Math.pow(ty - cy, 2)
         if (dist < bestDist) {
           bestDist = dist

[NoCoverage] ConditionalExpression
src/LayoutManager.js:208:13
 
       if (valid) {
         const dist = Math.pow(tx - cx, 2) + Math.pow(ty - cy, 2)
-        if (dist < bestDist) {
+        if (false) {
           bestDist = dist
           bestStack = s

[NoCoverage] BlockStatement
src/LayoutManager.js:208:30
 
       if (valid) {
         const dist = Math.pow(tx - cx, 2) + Math.pow(ty - cy, 2)
-        if (dist < bestDist) {
-          bestDist = dist
-          bestStack = s
-        }
+        if (dist < bestDist) {}
       }
     })

[NoCoverage] ConditionalExpression
src/LayoutManager.js:215:9
       }
     })
 
-    if (bestStack) {
+    if (true) {
       this.setActiveStack(bestStack)
     }

[NoCoverage] ConditionalExpression
src/LayoutManager.js:215:9
       }
     })
 
-    if (bestStack) {
+    if (false) {
       this.setActiveStack(bestStack)
     }

[Survived] BlockStatement
src/LayoutManager.js:220:19
     }
   }
 
-  updateLayout () {
-    if (this.root) {
-      this.root.updateLayout()
-    }
-    this.emit('stateChanged')
-  }
+  updateLayout () {}
 
   toConfig () {

[Survived] ConditionalExpression
src/LayoutManager.js:221:9
   }
 
   updateLayout () {
-    if (this.root) {
+    if (true) {
       this.root.updateLayout()
     }

[Survived] BlockStatement
src/LayoutManager.js:221:20
   }
 
   updateLayout () {
-    if (this.root) {
-      this.root.updateLayout()
-    }
+    if (this.root) {}
     this.emit('stateChanged')
   }

[Killed] BlockStatement
src/LayoutManager.js:227:15
     this.emit('stateChanged')
   }
 
-  toConfig () {
-    return {
-      settings: {
-        hasHeaders: true
-      },
-      dimensions: {},
-      content: this.root ? [this.root.toConfig()] : []
-    }
-  }
+  toConfig () {}
 
   // Helper: cleans up stacks when empty, or simplifies tree
killedBy: LayoutManager toConfig() returns valid structure
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Survived] BooleanLiteral
src/LayoutManager.js:230:21
   toConfig () {
     return {
       settings: {
-        hasHeaders: true
+        hasHeaders: false
       },
       dimensions: {},

[NoCoverage] ConditionalExpression
src/LayoutManager.js:239:9
 
   // Helper: cleans up stacks when empty, or simplifies tree
   _cleanupEmptyStack (stackItem) {
-    if (stackItem.type === 'stack' && stackItem.preventEmptyClosure) return
+    if (false) return
     if (this.activeStack === stackItem) {
       this.setActiveStack(null)

[NoCoverage] EqualityOperator
src/LayoutManager.js:239:9
 
   // Helper: cleans up stacks when empty, or simplifies tree
   _cleanupEmptyStack (stackItem) {
-    if (stackItem.type === 'stack' && stackItem.preventEmptyClosure) return
+    if (stackItem.type !== 'stack' && stackItem.preventEmptyClosure) return
     if (this.activeStack === stackItem) {
       this.setActiveStack(null)

[NoCoverage] ConditionalExpression
src/LayoutManager.js:240:9
   // Helper: cleans up stacks when empty, or simplifies tree
   _cleanupEmptyStack (stackItem) {
     if (stackItem.type === 'stack' && stackItem.preventEmptyClosure) return
-    if (this.activeStack === stackItem) {
+    if (false) {
       this.setActiveStack(null)
     }

[NoCoverage] EqualityOperator
src/LayoutManager.js:240:9
   // Helper: cleans up stacks when empty, or simplifies tree
   _cleanupEmptyStack (stackItem) {
     if (stackItem.type === 'stack' && stackItem.preventEmptyClosure) return
-    if (this.activeStack === stackItem) {
+    if (this.activeStack !== stackItem) {
       this.setActiveStack(null)
     }

[NoCoverage] ConditionalExpression
src/LayoutManager.js:245:9
     }
 
     const parent = stackItem.parent
-    if (!parent) {
+    if (false) {
       // It's the root (or a detached popout).
       // Only clear the root if this item IS the root of this LayoutManager.

[NoCoverage] BooleanLiteral
src/LayoutManager.js:245:9
     }
 
     const parent = stackItem.parent
-    if (!parent) {
+    if (parent) {
       // It's the root (or a detached popout).
       // Only clear the root if this item IS the root of this LayoutManager.

[NoCoverage] LogicalOperator
src/LayoutManager.js:248:11
     if (!parent) {
       // It's the root (or a detached popout).
       // Only clear the root if this item IS the root of this LayoutManager.
-      if (stackItem === this.root && stackItem.children.length === 0) {
+      if (stackItem === this.root || stackItem.children.length === 0) {
         this.rootElement.innerHTML = ''
         this.root = null

[NoCoverage] EqualityOperator
src/LayoutManager.js:248:38
     if (!parent) {
       // It's the root (or a detached popout).
       // Only clear the root if this item IS the root of this LayoutManager.
-      if (stackItem === this.root && stackItem.children.length === 0) {
+      if (stackItem === this.root && stackItem.children.length !== 0) {
         this.rootElement.innerHTML = ''
         this.root = null

[NoCoverage] ConditionalExpression
src/LayoutManager.js:260:9
     parent.removeChild(stackItem)
 
     // If parent is now empty, clean it up recursively
-    if (parent.children.length === 0) {
+    if (true) {
       this._cleanupEmptyStack(parent)
     } else if (parent.children.length === 1 && parent !== this.root) {

[NoCoverage] BlockStatement
src/LayoutManager.js:260:39
     parent.removeChild(stackItem)
 
     // If parent is now empty, clean it up recursively
-    if (parent.children.length === 0) {
-      this._cleanupEmptyStack(parent)
-    } else if (parent.children.length === 1 && parent !== this.root) {
+    if (parent.children.length === 0) {} else if (parent.children.length === 1 && parent !== this.root) {
       // If parent is Row/Col and has only 1 child, simplify tree
       const singleChild = parent.children[0]

[NoCoverage] BlockStatement
src/LayoutManager.js:262:70
     // If parent is now empty, clean it up recursively
     if (parent.children.length === 0) {
       this._cleanupEmptyStack(parent)
-    } else if (parent.children.length === 1 && parent !== this.root) {
-      // If parent is Row/Col and has only 1 child, simplify tree
-      const singleChild = parent.children[0]
-      const grandParent = parent.parent
-
-      if (grandParent) {
-        const pIndex = grandParent.children.indexOf(parent)
-        singleChild.size = parent.size
-        grandParent.replaceChild(parent, singleChild, pIndex)
-      } else {
-        // Parent is root, replace root
-        this.root = singleChild
-        this.root.parent = null
-        this.rootElement.innerHTML = ''
-        this.rootElement.appendChild(this.root.element)
-        this.root.updateLayout()
-      }
-    }
+    } else if (parent.children.length === 1 && parent !== this.root) {}
   }
 

[NoCoverage] EqualityOperator
src/LayoutManager.js:262:16
     // If parent is now empty, clean it up recursively
     if (parent.children.length === 0) {
       this._cleanupEmptyStack(parent)
-    } else if (parent.children.length === 1 && parent !== this.root) {
+    } else if (parent.children.length !== 1 && parent !== this.root) {
       // If parent is Row/Col and has only 1 child, simplify tree
       const singleChild = parent.children[0]

[NoCoverage] BlockStatement
src/LayoutManager.js:267:24
       const singleChild = parent.children[0]
       const grandParent = parent.parent
 
-      if (grandParent) {
-        const pIndex = grandParent.children.indexOf(parent)
-        singleChild.size = parent.size
-        grandParent.replaceChild(parent, singleChild, pIndex)
-      } else {
+      if (grandParent) {} else {
         // Parent is root, replace root
         this.root = singleChild

[NoCoverage] ConditionalExpression
src/LayoutManager.js:267:11
       const singleChild = parent.children[0]
       const grandParent = parent.parent
 
-      if (grandParent) {
+      if (false) {
         const pIndex = grandParent.children.indexOf(parent)
         singleChild.size = parent.size

[NoCoverage] BlockStatement
src/LayoutManager.js:271:14
         const pIndex = grandParent.children.indexOf(parent)
         singleChild.size = parent.size
         grandParent.replaceChild(parent, singleChild, pIndex)
-      } else {
-        // Parent is root, replace root
-        this.root = singleChild
-        this.root.parent = null
-        this.rootElement.innerHTML = ''
-        this.rootElement.appendChild(this.root.element)
-        this.root.updateLayout()
-      }
+      } else {}
     }
   }

[Survived] BlockStatement
src/LayoutManager.js:282:38
     }
   }
 
-  showToast (message, type = 'info') {
-    const toast = new Toast(this.toastContainer, message, type)
-    return toast
-  }
+  showToast (message, type = 'info') {}
 
   renderEmptyState () {

[Survived] StringLiteral
src/LayoutManager.js:282:30
     }
   }
 
-  showToast (message, type = 'info') {
+  showToast (message, type = "") {
     const toast = new Toast(this.toastContainer, message, type)
     return toast

[Survived] BlockStatement
src/LayoutManager.js:287:23
     return toast
   }
 
-  renderEmptyState () {
-    if (this.root) return
-    this.rootElement.innerHTML = `
-                <div class="tulweb-empty-state">
-                    <svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2">
-                        <rect x="3" y="3" width="18" height="18" rx="2" ry="2"></rect>
-                        <line x1="9" y1="3" x2="9" y2="21"></line>
-                        <path d="M14 8h5"></path>
-                        <path d="M14 12h5"></path>
-                    </svg>
-                    <div>Workspace is empty</div>
-                    <div style="font-size: 13px; margin-top: 8px; opacity: 0.5;">Drag a component from the sidebar to get started</div>
-                </div>
-            `
-  }
+  renderEmptyState () {}
 
   setActiveStack (stack) {

[Survived] ConditionalExpression
src/LayoutManager.js:288:9
   }
 
   renderEmptyState () {
-    if (this.root) return
+    if (true) return
     this.rootElement.innerHTML = `
                 <div class="tulweb-empty-state">

[Survived] ConditionalExpression
src/LayoutManager.js:288:9
   }
 
   renderEmptyState () {
-    if (this.root) return
+    if (false) return
     this.rootElement.innerHTML = `
                 <div class="tulweb-empty-state">

[NoCoverage] BlockStatement
src/LayoutManager.js:303:26
             `
   }
 
-  setActiveStack (stack) {
-    if (this.activeStack === stack) return
-
-    if (this.activeStack && this.activeStack.element) {
-      this.activeStack.element.classList.remove('active-stack')
-      if (this.activeStack.children) {
-        const oldActive = this.activeStack.children[this.activeStack.activeChildIndex]
-        if (oldActive && oldActive._isFocused) {
-          oldActive._isFocused = false
-          oldActive.emit('defocus')
-        }
-      }
-    }
-
-    this.activeStack = stack
-
-    if (this.activeStack && this.activeStack.element && this.activeStack.children) {
-      this.activeStack.element.classList.add('active-stack')
-      const newActive = this.activeStack.children[this.activeStack.activeChildIndex]
-      if (newActive && newActive._isActive && !newActive._isFocused) {
-        newActive._isFocused = true
-        newActive.emit('focus')
-      }
-    }
-  }
+  setActiveStack (stack) {}
 
   // --- Search & Retrieval API ---

[NoCoverage] ConditionalExpression
src/LayoutManager.js:304:9
   }
 
   setActiveStack (stack) {
-    if (this.activeStack === stack) return
+    if (true) return
 
     if (this.activeStack && this.activeStack.element) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:304:9
   }
 
   setActiveStack (stack) {
-    if (this.activeStack === stack) return
+    if (false) return
 
     if (this.activeStack && this.activeStack.element) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:306:9
   setActiveStack (stack) {
     if (this.activeStack === stack) return
 
-    if (this.activeStack && this.activeStack.element) {
+    if (true) {
       this.activeStack.element.classList.remove('active-stack')
       if (this.activeStack.children) {

[NoCoverage] LogicalOperator
src/LayoutManager.js:306:9
   setActiveStack (stack) {
     if (this.activeStack === stack) return
 
-    if (this.activeStack && this.activeStack.element) {
+    if (this.activeStack || this.activeStack.element) {
       this.activeStack.element.classList.remove('active-stack')
       if (this.activeStack.children) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:308:11
 
     if (this.activeStack && this.activeStack.element) {
       this.activeStack.element.classList.remove('active-stack')
-      if (this.activeStack.children) {
+      if (true) {
         const oldActive = this.activeStack.children[this.activeStack.activeChildIndex]
         if (oldActive && oldActive._isFocused) {

[NoCoverage] BlockStatement
src/LayoutManager.js:308:38
 
     if (this.activeStack && this.activeStack.element) {
       this.activeStack.element.classList.remove('active-stack')
-      if (this.activeStack.children) {
-        const oldActive = this.activeStack.children[this.activeStack.activeChildIndex]
-        if (oldActive && oldActive._isFocused) {
-          oldActive._isFocused = false
-          oldActive.emit('defocus')
-        }
-      }
+      if (this.activeStack.children) {}
     }
 

[NoCoverage] LogicalOperator
src/LayoutManager.js:310:13
       this.activeStack.element.classList.remove('active-stack')
       if (this.activeStack.children) {
         const oldActive = this.activeStack.children[this.activeStack.activeChildIndex]
-        if (oldActive && oldActive._isFocused) {
+        if (oldActive || oldActive._isFocused) {
           oldActive._isFocused = false
           oldActive.emit('defocus')

[NoCoverage] ConditionalExpression
src/LayoutManager.js:310:13
       this.activeStack.element.classList.remove('active-stack')
       if (this.activeStack.children) {
         const oldActive = this.activeStack.children[this.activeStack.activeChildIndex]
-        if (oldActive && oldActive._isFocused) {
+        if (false) {
           oldActive._isFocused = false
           oldActive.emit('defocus')

[NoCoverage] BooleanLiteral
src/LayoutManager.js:311:34
       if (this.activeStack.children) {
         const oldActive = this.activeStack.children[this.activeStack.activeChildIndex]
         if (oldActive && oldActive._isFocused) {
-          oldActive._isFocused = false
+          oldActive._isFocused = true
           oldActive.emit('defocus')
         }

[NoCoverage] ConditionalExpression
src/LayoutManager.js:319:9
 
     this.activeStack = stack
 
-    if (this.activeStack && this.activeStack.element && this.activeStack.children) {
+    if (false) {
       this.activeStack.element.classList.add('active-stack')
       const newActive = this.activeStack.children[this.activeStack.activeChildIndex]

[NoCoverage] ConditionalExpression
src/LayoutManager.js:319:9
 
     this.activeStack = stack
 
-    if (this.activeStack && this.activeStack.element && this.activeStack.children) {
+    if (true) {
       this.activeStack.element.classList.add('active-stack')
       const newActive = this.activeStack.children[this.activeStack.activeChildIndex]

[NoCoverage] StringLiteral
src/LayoutManager.js:320:46
     this.activeStack = stack
 
     if (this.activeStack && this.activeStack.element && this.activeStack.children) {
-      this.activeStack.element.classList.add('active-stack')
+      this.activeStack.element.classList.add("")
       const newActive = this.activeStack.children[this.activeStack.activeChildIndex]
       if (newActive && newActive._isActive && !newActive._isFocused) {

[NoCoverage] LogicalOperator
src/LayoutManager.js:322:11
     if (this.activeStack && this.activeStack.element && this.activeStack.children) {
       this.activeStack.element.classList.add('active-stack')
       const newActive = this.activeStack.children[this.activeStack.activeChildIndex]
-      if (newActive && newActive._isActive && !newActive._isFocused) {
+      if (newActive && newActive._isActive || !newActive._isFocused) {
         newActive._isFocused = true
         newActive.emit('focus')

[NoCoverage] ConditionalExpression
src/LayoutManager.js:322:11
     if (this.activeStack && this.activeStack.element && this.activeStack.children) {
       this.activeStack.element.classList.add('active-stack')
       const newActive = this.activeStack.children[this.activeStack.activeChildIndex]
-      if (newActive && newActive._isActive && !newActive._isFocused) {
+      if (false) {
         newActive._isFocused = true
         newActive.emit('focus')

[NoCoverage] BooleanLiteral
src/LayoutManager.js:323:32
       this.activeStack.element.classList.add('active-stack')
       const newActive = this.activeStack.children[this.activeStack.activeChildIndex]
       if (newActive && newActive._isActive && !newActive._isFocused) {
-        newActive._isFocused = true
+        newActive._isFocused = false
         newActive.emit('focus')
       }

[NoCoverage] BlockStatement
src/LayoutManager.js:331:25
 
   // --- Search & Retrieval API ---
 
-  getComponentById (id) {
-    return this._findInTree(this.root, item => item.type === 'component' && item.id === id)
-  }
+  getComponentById (id) {}
 
   getStackById (id) {

[NoCoverage] LogicalOperator
src/LayoutManager.js:332:48
   // --- Search & Retrieval API ---
 
   getComponentById (id) {
-    return this._findInTree(this.root, item => item.type === 'component' && item.id === id)
+    return this._findInTree(this.root, item => item.type === 'component' || item.id === id)
   }
 

[NoCoverage] ArrowFunction
src/LayoutManager.js:332:40
   // --- Search & Retrieval API ---
 
   getComponentById (id) {
-    return this._findInTree(this.root, item => item.type === 'component' && item.id === id)
+    return this._findInTree(this.root, () => undefined)
   }
 
