[Killed] BlockStatement
src/LayoutManager.js:335:21
     return this._findInTree(this.root, item => item.type === 'component' && item.id === id)
   }
 
-  getStackById (id) {
-    return this._findInTree(this.root, item => item.type === 'stack' && item.id === id)
-  }
+  getStackById (id) {}
 
   getItemById (id) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] ConditionalExpression
src/LayoutManager.js:336:73
   }
 
   getStackById (id) {
-    return this._findInTree(this.root, item => item.type === 'stack' && item.id === id)
+    return this._findInTree(this.root, item => item.type === 'stack' && true)
   }
 
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

[Killed] EqualityOperator
src/LayoutManager.js:336:73
   }
 
   getStackById (id) {
-    return this._findInTree(this.root, item => item.type === 'stack' && item.id === id)
+    return this._findInTree(this.root, item => item.type === 'stack' && item.id !== id)
   }
 
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/LayoutManager.js:339:20
     return this._findInTree(this.root, item => item.type === 'stack' && item.id === id)
   }
 
-  getItemById (id) {
-    return this._findInTree(this.root, item => item.id === id)
-  }
+  getItemById (id) {}
 
   getAllStacks () {
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: TypeError: Cannot read properties of undefined (reading 'children')

[Killed] ArrowFunction
src/LayoutManager.js:340:40
   }
 
   getItemById (id) {
-    return this._findInTree(this.root, item => item.id === id)
+    return this._findInTree(this.root, () => undefined)
   }
 
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: TypeError: Cannot read properties of null (reading 'children')

[Killed] EqualityOperator
src/LayoutManager.js:340:48
   }
 
   getItemById (id) {
-    return this._findInTree(this.root, item => item.id === id)
+    return this._findInTree(this.root, item => item.id !== id)
   }
 
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[NoCoverage] BlockStatement
src/LayoutManager.js:343:19
     return this._findInTree(this.root, item => item.id === id)
   }
 
-  getAllStacks () {
-    const stacks = []
-    this._traverseTree(this.root, item => {
-      if (item.type === 'stack') stacks.push(item)
-    })
-    return stacks
-  }
+  getAllStacks () {}
 
   addComponent (stackId, config) {

[NoCoverage] BlockStatement
src/LayoutManager.js:345:43
 
   getAllStacks () {
     const stacks = []
-    this._traverseTree(this.root, item => {
-      if (item.type === 'stack') stacks.push(item)
-    })
+    this._traverseTree(this.root, item => {})
     return stacks
   }

[NoCoverage] ConditionalExpression
src/LayoutManager.js:346:11
   getAllStacks () {
     const stacks = []
     this._traverseTree(this.root, item => {
-      if (item.type === 'stack') stacks.push(item)
+      if (false) stacks.push(item)
     })
     return stacks

[NoCoverage] EqualityOperator
src/LayoutManager.js:346:11
   getAllStacks () {
     const stacks = []
     this._traverseTree(this.root, item => {
-      if (item.type === 'stack') stacks.push(item)
+      if (item.type !== 'stack') stacks.push(item)
     })
     return stacks

[NoCoverage] BlockStatement
src/LayoutManager.js:351:34
     return stacks
   }
 
-  addComponent (stackId, config) {
-    const stack = this.getStackById(stackId) || this.activeStack
-    if (!stack) {
-      throw new Error('No target stack found and no active stack available')
-    }
-    const component = this._buildObjectTree(config)
-    stack.addChild(component)
-    this.updateLayout()
-    return component
-  }
+  addComponent (stackId, config) {}
 
   removeComponent (id) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:352:19
   }
 
   addComponent (stackId, config) {
-    const stack = this.getStackById(stackId) || this.activeStack
+    const stack = false
     if (!stack) {
       throw new Error('No target stack found and no active stack available')

[NoCoverage] LogicalOperator
src/LayoutManager.js:352:19
   }
 
   addComponent (stackId, config) {
-    const stack = this.getStackById(stackId) || this.activeStack
+    const stack = this.getStackById(stackId) && this.activeStack
     if (!stack) {
       throw new Error('No target stack found and no active stack available')

[NoCoverage] BlockStatement
src/LayoutManager.js:353:17
 
   addComponent (stackId, config) {
     const stack = this.getStackById(stackId) || this.activeStack
-    if (!stack) {
-      throw new Error('No target stack found and no active stack available')
-    }
+    if (!stack) {}
     const component = this._buildObjectTree(config)
     stack.addChild(component)

[NoCoverage] BooleanLiteral
src/LayoutManager.js:353:9
 
   addComponent (stackId, config) {
     const stack = this.getStackById(stackId) || this.activeStack
-    if (!stack) {
+    if (stack) {
       throw new Error('No target stack found and no active stack available')
     }

[NoCoverage] StringLiteral
src/LayoutManager.js:354:23
   addComponent (stackId, config) {
     const stack = this.getStackById(stackId) || this.activeStack
     if (!stack) {
-      throw new Error('No target stack found and no active stack available')
+      throw new Error("")
     }
     const component = this._buildObjectTree(config)

[NoCoverage] BlockStatement
src/LayoutManager.js:362:24
     return component
   }
 
-  removeComponent (id) {
-    const component = this.getComponentById(id)
-    if (component) {
-      return component.destroy()
-    }
-    return false
-  }
+  removeComponent (id) {}
 
   _findInTree (item, predicate) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:364:9
 
   removeComponent (id) {
     const component = this.getComponentById(id)
-    if (component) {
+    if (true) {
       return component.destroy()
     }

[NoCoverage] ConditionalExpression
src/LayoutManager.js:364:9
 
   removeComponent (id) {
     const component = this.getComponentById(id)
-    if (component) {
+    if (false) {
       return component.destroy()
     }

[Killed] BlockStatement
src/LayoutManager.js:370:33
     return false
   }
 
-  _findInTree (item, predicate) {
-    if (!item) return null
-    if (predicate(item)) return item
-    if (item.children) {
-      for (const child of item.children) {
-        const found = this._findInTree(child, predicate)
-        if (found) return found
-      }
-    }
-    return null
-  }
+  _findInTree (item, predicate) {}
 
   _traverseTree (item, callback) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BooleanLiteral
src/LayoutManager.js:371:9
   }
 
   _findInTree (item, predicate) {
-    if (!item) return null
+    if (item) return null
     if (predicate(item)) return item
     if (item.children) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/LayoutManager.js:371:9
   }
 
   _findInTree (item, predicate) {
-    if (!item) return null
+    if (true) return null
     if (predicate(item)) return item
     if (item.children) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/LayoutManager.js:372:9
 
   _findInTree (item, predicate) {
     if (!item) return null
-    if (predicate(item)) return item
+    if (true) return item
     if (item.children) {
       for (const child of item.children) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-row"
Received: null

[Killed] ConditionalExpression
src/LayoutManager.js:372:9
 
   _findInTree (item, predicate) {
     if (!item) return null
-    if (predicate(item)) return item
+    if (false) return item
     if (item.children) {
       for (const child of item.children) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/LayoutManager.js:373:9
   _findInTree (item, predicate) {
     if (!item) return null
     if (predicate(item)) return item
-    if (item.children) {
+    if (false) {
       for (const child of item.children) {
         const found = this._findInTree(child, predicate)
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/LayoutManager.js:373:24
   _findInTree (item, predicate) {
     if (!item) return null
     if (predicate(item)) return item
-    if (item.children) {
-      for (const child of item.children) {
-        const found = this._findInTree(child, predicate)
-        if (found) return found
-      }
-    }
+    if (item.children) {}
     return null
   }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/LayoutManager.js:374:42
     if (!item) return null
     if (predicate(item)) return item
     if (item.children) {
-      for (const child of item.children) {
-        const found = this._findInTree(child, predicate)
-        if (found) return found
-      }
+      for (const child of item.children) {}
     }
     return null
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/LayoutManager.js:376:13
     if (item.children) {
       for (const child of item.children) {
         const found = this._findInTree(child, predicate)
-        if (found) return found
+        if (true) return found
       }
     }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/LayoutManager.js:376:13
     if (item.children) {
       for (const child of item.children) {
         const found = this._findInTree(child, predicate)
-        if (found) return found
+        if (false) return found
       }
     }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[NoCoverage] BlockStatement
src/LayoutManager.js:382:34
     return null
   }
 
-  _traverseTree (item, callback) {
-    if (!item) return
-    callback(item)
-    if (item.children) {
-      item.children.forEach(child => this._traverseTree(child, callback))
-    }
-  }
+  _traverseTree (item, callback) {}
 
   // --- Popout API ---

[NoCoverage] ConditionalExpression
src/LayoutManager.js:383:9
   }
 
   _traverseTree (item, callback) {
-    if (!item) return
+    if (true) return
     callback(item)
     if (item.children) {

[NoCoverage] ConditionalExpression
src/LayoutManager.js:383:9
   }
 
   _traverseTree (item, callback) {
-    if (!item) return
+    if (false) return
     callback(item)
     if (item.children) {

[NoCoverage] BlockStatement
src/LayoutManager.js:385:24
   _traverseTree (item, callback) {
     if (!item) return
     callback(item)
-    if (item.children) {
-      item.children.forEach(child => this._traverseTree(child, callback))
-    }
+    if (item.children) {}
   }
 

[NoCoverage] ConditionalExpression
src/LayoutManager.js:385:9
   _traverseTree (item, callback) {
     if (!item) return
     callback(item)
-    if (item.children) {
+    if (false) {
       item.children.forEach(child => this._traverseTree(child, callback))
     }

[NoCoverage] ArrowFunction
src/LayoutManager.js:386:29
     if (!item) return
     callback(item)
     if (item.children) {
-      item.children.forEach(child => this._traverseTree(child, callback))
+      item.children.forEach(() => undefined)
     }
   }

[Killed] BlockStatement
src/LayoutManager.js:398:23
      * @param {StackItem} stack - The stack to pop out
      * @returns {string|null} The popout ID, or null if blocked
      */
-  popoutStack (stack) {
-    if (!this.settings.enablePopout) {
-      console.warn('Popout is disabled. Set enablePopout: true in settings.')
-      return null
-    }
-    return this.popoutManager.popout(stack)
-  }
+  popoutStack (stack) {}
 
   /**
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BooleanLiteral
src/LayoutManager.js:399:9
      * @returns {string|null} The popout ID, or null if blocked
      */
   popoutStack (stack) {
-    if (!this.settings.enablePopout) {
+    if (this.settings.enablePopout) {
       console.warn('Popout is disabled. Set enablePopout: true in settings.')
       return null
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
src/LayoutManager.js:399:9
      * @returns {string|null} The popout ID, or null if blocked
      */
   popoutStack (stack) {
-    if (!this.settings.enablePopout) {
+    if (true) {
       console.warn('Popout is disabled. Set enablePopout: true in settings.')
       return null
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

[NoCoverage] BlockStatement
src/LayoutManager.js:409:22
   /**
      * Close all open popout windows.
      */
-  closeAllPopouts () {
-    this.popoutManager.closeAll()
-  }
+  closeAllPopouts () {}
 
   /**

[NoCoverage] BlockStatement
src/LayoutManager.js:417:26
      * Close a specific popout by ID.
      * @param {string} popoutId
      */
-  closePopout (popoutId) {
-    this.popoutManager.closePopout(popoutId)
-  }
+  closePopout (popoutId) {}
 
   /**

[NoCoverage] BlockStatement
src/LayoutManager.js:425:39
      * Broadcast a theme change to all open popout windows.
      * @param {string} bodyClass - The CSS class(es) to apply to body
      */
-  broadcastThemeToPopouts (bodyClass) {
-    this.popoutManager.broadcastThemeChange(bodyClass)
-  }
+  broadcastThemeToPopouts (bodyClass) {}
 }
 
