[Killed] BlockStatement
src/core/ComponentItem.js:4:39
 import { ContentItem } from './ContentItem.js'
 
 export class ComponentItem extends ContentItem {
-  constructor (config, layoutManager) {
-    super(config, layoutManager)
-    this.type = 'component'
-    this.isCloseable = config.closeable !== false
-  }
+  constructor (config, layoutManager) {}
 
   createDOM () {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Survived] StringLiteral
src/core/ComponentItem.js:6:17
 export class ComponentItem extends ContentItem {
   constructor (config, layoutManager) {
     super(config, layoutManager)
-    this.type = 'component'
+    this.type = ""
     this.isCloseable = config.closeable !== false
   }

[Survived] ConditionalExpression
src/core/ComponentItem.js:7:24
   constructor (config, layoutManager) {
     super(config, layoutManager)
     this.type = 'component'
-    this.isCloseable = config.closeable !== false
+    this.isCloseable = false
   }
 

[Survived] BooleanLiteral
src/core/ComponentItem.js:7:45
   constructor (config, layoutManager) {
     super(config, layoutManager)
     this.type = 'component'
-    this.isCloseable = config.closeable !== false
+    this.isCloseable = config.closeable !== true
   }
 

[Killed] BlockStatement
src/core/ComponentItem.js:10:16
     this.isCloseable = config.closeable !== false
   }
 
-  createDOM () {
-    this.element = document.createElement('div')
-    this.element.className = 'tulweb-component'
-    this.element.setAttribute('data-component', this.config.componentName)
-    if (!this.isCloseable) this.element.setAttribute('data-closeable', 'false')
-    this.layoutManager.emit('componentCreated', this)
-  }
+  createDOM () {}
 
   renderAppContent () {
killedBy: StackItem adds and removes component children
statusReason: TypeError: Failed to execute 'appendChild' on 'Node': parameter 1 is not of type 'Node'.

[Survived] StringLiteral
src/core/ComponentItem.js:12:30
 
   createDOM () {
     this.element = document.createElement('div')
-    this.element.className = 'tulweb-component'
+    this.element.className = ""
     this.element.setAttribute('data-component', this.config.componentName)
     if (!this.isCloseable) this.element.setAttribute('data-closeable', 'false')

[Survived] ConditionalExpression
src/core/ComponentItem.js:14:9
     this.element = document.createElement('div')
     this.element.className = 'tulweb-component'
     this.element.setAttribute('data-component', this.config.componentName)
-    if (!this.isCloseable) this.element.setAttribute('data-closeable', 'false')
+    if (true) this.element.setAttribute('data-closeable', 'false')
     this.layoutManager.emit('componentCreated', this)
   }

[Survived] BooleanLiteral
src/core/ComponentItem.js:14:9
     this.element = document.createElement('div')
     this.element.className = 'tulweb-component'
     this.element.setAttribute('data-component', this.config.componentName)
-    if (!this.isCloseable) this.element.setAttribute('data-closeable', 'false')
+    if (this.isCloseable) this.element.setAttribute('data-closeable', 'false')
     this.layoutManager.emit('componentCreated', this)
   }

[Survived] StringLiteral
src/core/ComponentItem.js:15:29
     this.element.className = 'tulweb-component'
     this.element.setAttribute('data-component', this.config.componentName)
     if (!this.isCloseable) this.element.setAttribute('data-closeable', 'false')
-    this.layoutManager.emit('componentCreated', this)
+    this.layoutManager.emit("", this)
   }
 

[Survived] ConditionalExpression
src/core/ComponentItem.js:19:9
   }
 
   renderAppContent () {
-    if (this._hasRendered) return
+    if (true) return
     this._hasRendered = true
 

[Survived] ConditionalExpression
src/core/ComponentItem.js:19:9
   }
 
   renderAppContent () {
-    if (this._hasRendered) return
+    if (false) return
     this._hasRendered = true
 

[Survived] BooleanLiteral
src/core/ComponentItem.js:20:25
 
   renderAppContent () {
     if (this._hasRendered) return
-    this._hasRendered = true
+    this._hasRendered = false
 
     const factory = this.layoutManager.componentFactories[this.config.componentName]

[Survived] ConditionalExpression
src/core/ComponentItem.js:24:9
 
     const factory = this.layoutManager.componentFactories[this.config.componentName]
 
-    if (factory) {
+    if (true) {
       this.element.innerHTML = '' // Clear initial state
       try {

[Survived] ConditionalExpression
src/core/ComponentItem.js:24:9
 
     const factory = this.layoutManager.componentFactories[this.config.componentName]
 
-    if (factory) {
+    if (false) {
       this.element.innerHTML = '' // Clear initial state
       try {

[NoCoverage] StringLiteral
src/core/ComponentItem.js:25:32
     const factory = this.layoutManager.componentFactories[this.config.componentName]
 
     if (factory) {
-      this.element.innerHTML = '' // Clear initial state
+      this.element.innerHTML = "Stryker was here!" // Clear initial state
       try {
         // Use Reflect.construct to reliably detect classes (survives minification/transpilation)

[NoCoverage] BlockStatement
src/core/ComponentItem.js:26:11
 
     if (factory) {
       this.element.innerHTML = '' // Clear initial state
-      try {
-        // Use Reflect.construct to reliably detect classes (survives minification/transpilation)
-        const isClass = typeof factory === 'function' &&
-                    (factory.isClass || (() => {
-                      try { Reflect.construct(String, [], factory); return true } catch { return false }
-                    })())
-
-        let contentNode
-        if (isClass) {
-          const Factory = factory
-          const instance = new Factory(this.config.componentState, this)
-          this.instance = instance
-          // Convention: class should have an .element property or be a DOM node itself
-          contentNode = instance.element || (typeof instance.render === 'function' ? instance.render() : instance)
-        } else {
-          contentNode = factory(this.config.componentState, this)
-        }
-
-        if (contentNode instanceof Node) {
-          this.element.appendChild(contentNode)
-        }
-        this.emit('init')
-      } catch (err) {
+      try {} catch (err) {
         this.element.innerHTML = `<div style="color:red; padding:10px;">Error rendering component: ${err.message}</div>`
         console.error('Component Render Error:', err)

[NoCoverage] ConditionalExpression
src/core/ComponentItem.js:28:25
       this.element.innerHTML = '' // Clear initial state
       try {
         // Use Reflect.construct to reliably detect classes (survives minification/transpilation)
-        const isClass = typeof factory === 'function' &&
-                    (factory.isClass || (() => {
-                      try { Reflect.construct(String, [], factory); return true } catch { return false }
-                    })())
+        const isClass = false
 
         let contentNode

[NoCoverage] LogicalOperator
src/core/ComponentItem.js:28:25
       this.element.innerHTML = '' // Clear initial state
       try {
         // Use Reflect.construct to reliably detect classes (survives minification/transpilation)
-        const isClass = typeof factory === 'function' &&
-                    (factory.isClass || (() => {
-                      try { Reflect.construct(String, [], factory); return true } catch { return false }
-                    })())
+        const isClass = typeof factory === 'function' || factory.isClass || (() => {
+  try {
+    Reflect.construct(String, [], factory);
+    return true;
+  } catch {
+    return false;
+  }
+})()
 
         let contentNode

[NoCoverage] BlockStatement
src/core/ComponentItem.js:29:48
       try {
         // Use Reflect.construct to reliably detect classes (survives minification/transpilation)
         const isClass = typeof factory === 'function' &&
-                    (factory.isClass || (() => {
-                      try { Reflect.construct(String, [], factory); return true } catch { return false }
-                    })())
+                    (factory.isClass || (() => {})())
 
         let contentNode

[NoCoverage] LogicalOperator
src/core/ComponentItem.js:29:22
       try {
         // Use Reflect.construct to reliably detect classes (survives minification/transpilation)
         const isClass = typeof factory === 'function' &&
-                    (factory.isClass || (() => {
-                      try { Reflect.construct(String, [], factory); return true } catch { return false }
-                    })())
+                    (factory.isClass && (() => {
+  try {
+    Reflect.construct(String, [], factory);
+    return true;
+  } catch {
+    return false;
+  }
+})())
 
         let contentNode

[NoCoverage] BlockStatement
src/core/ComponentItem.js:30:27
         // Use Reflect.construct to reliably detect classes (survives minification/transpilation)
         const isClass = typeof factory === 'function' &&
                     (factory.isClass || (() => {
-                      try { Reflect.construct(String, [], factory); return true } catch { return false }
+                      try {} catch { return false }
                     })())
 

[NoCoverage] BooleanLiteral
src/core/ComponentItem.js:30:76
         // Use Reflect.construct to reliably detect classes (survives minification/transpilation)
         const isClass = typeof factory === 'function' &&
                     (factory.isClass || (() => {
-                      try { Reflect.construct(String, [], factory); return true } catch { return false }
+                      try { Reflect.construct(String, [], factory); return false } catch { return false }
                     })())
 

[NoCoverage] ConditionalExpression
src/core/ComponentItem.js:34:13
                     })())
 
         let contentNode
-        if (isClass) {
+        if (false) {
           const Factory = factory
           const instance = new Factory(this.config.componentState, this)

[NoCoverage] BlockStatement
src/core/ComponentItem.js:34:22
                     })())
 
         let contentNode
-        if (isClass) {
-          const Factory = factory
-          const instance = new Factory(this.config.componentState, this)
-          this.instance = instance
-          // Convention: class should have an .element property or be a DOM node itself
-          contentNode = instance.element || (typeof instance.render === 'function' ? instance.render() : instance)
-        } else {
+        if (isClass) {} else {
           contentNode = factory(this.config.componentState, this)
         }

[NoCoverage] ConditionalExpression
src/core/ComponentItem.js:39:46
           const instance = new Factory(this.config.componentState, this)
           this.instance = instance
           // Convention: class should have an .element property or be a DOM node itself
-          contentNode = instance.element || (typeof instance.render === 'function' ? instance.render() : instance)
+          contentNode = instance.element || (false ? instance.render() : instance)
         } else {
           contentNode = factory(this.config.componentState, this)

[NoCoverage] ConditionalExpression
src/core/ComponentItem.js:39:25
           const instance = new Factory(this.config.componentState, this)
           this.instance = instance
           // Convention: class should have an .element property or be a DOM node itself
-          contentNode = instance.element || (typeof instance.render === 'function' ? instance.render() : instance)
+          contentNode = true
         } else {
           contentNode = factory(this.config.componentState, this)

[NoCoverage] BlockStatement
src/core/ComponentItem.js:40:16
           this.instance = instance
           // Convention: class should have an .element property or be a DOM node itself
           contentNode = instance.element || (typeof instance.render === 'function' ? instance.render() : instance)
-        } else {
-          contentNode = factory(this.config.componentState, this)
-        }
+        } else {}
 
         if (contentNode instanceof Node) {

[NoCoverage] ConditionalExpression
src/core/ComponentItem.js:44:13
           contentNode = factory(this.config.componentState, this)
         }
 
-        if (contentNode instanceof Node) {
+        if (true) {
           this.element.appendChild(contentNode)
         }

[NoCoverage] ConditionalExpression
src/core/ComponentItem.js:44:13
           contentNode = factory(this.config.componentState, this)
         }
 
-        if (contentNode instanceof Node) {
+        if (false) {
           this.element.appendChild(contentNode)
         }

[NoCoverage] StringLiteral
src/core/ComponentItem.js:47:19
         if (contentNode instanceof Node) {
           this.element.appendChild(contentNode)
         }
-        this.emit('init')
+        this.emit("")
       } catch (err) {
         this.element.innerHTML = `<div style="color:red; padding:10px;">Error rendering component: ${err.message}</div>`

[NoCoverage] BlockStatement
src/core/ComponentItem.js:48:21
           this.element.appendChild(contentNode)
         }
         this.emit('init')
-      } catch (err) {
-        this.element.innerHTML = `<div style="color:red; padding:10px;">Error rendering component: ${err.message}</div>`
-        console.error('Component Render Error:', err)
-      }
+      } catch (err) {}
     }
   }

[NoCoverage] StringLiteral
src/core/ComponentItem.js:49:34
         }
         this.emit('init')
       } catch (err) {
-        this.element.innerHTML = `<div style="color:red; padding:10px;">Error rendering component: ${err.message}</div>`
+        this.element.innerHTML = ``
         console.error('Component Render Error:', err)
       }

[NoCoverage] BlockStatement
src/core/ComponentItem.js:55:20
     }
   }
 
-  setState (state) {
-    this.config.componentState = Object.assign({}, this.config.componentState, state)
-    this.layoutManager.emit('stateChanged')
-  }
+  setState (state) {}
 
   getState () {

[NoCoverage] StringLiteral
src/core/ComponentItem.js:57:29
 
   setState (state) {
     this.config.componentState = Object.assign({}, this.config.componentState, state)
-    this.layoutManager.emit('stateChanged')
+    this.layoutManager.emit("")
   }
 

[NoCoverage] BlockStatement
src/core/ComponentItem.js:60:15
     this.layoutManager.emit('stateChanged')
   }
 
-  getState () {
-    return this.config.componentState
-  }
+  getState () {}
 
   toConfig () {

[Killed] BlockStatement
src/core/ComponentItem.js:64:15
     return this.config.componentState
   }
 
-  toConfig () {
-    const res = super.toConfig()
-    res.title = this.config.title
-    res.componentName = this.config.componentName
-    res.componentState = this.config.componentState
-    if (this.config.closeable === false) res.closeable = false
-    return res
-  }
+  toConfig () {}
 
   destroy () {
killedBy: StackItem serializes to correct config
statusReason: TypeError: Cannot read properties of undefined (reading 'componentName')

[Survived] BooleanLiteral
src/core/ComponentItem.js:69:35
     res.title = this.config.title
     res.componentName = this.config.componentName
     res.componentState = this.config.componentState
-    if (this.config.closeable === false) res.closeable = false
+    if (this.config.closeable === true) res.closeable = false
     return res
   }

[Survived] EqualityOperator
src/core/ComponentItem.js:69:9
     res.title = this.config.title
     res.componentName = this.config.componentName
     res.componentState = this.config.componentState
-    if (this.config.closeable === false) res.closeable = false
+    if (this.config.closeable !== false) res.closeable = false
     return res
   }

[Survived] BlockStatement
src/core/ComponentItem.js:73:14
     return res
   }
 
-  destroy () {
-    if (this.instance && typeof this.instance.destroy === 'function') {
-      this.instance.destroy()
-    }
-    this.instance = null
-    super.destroy()
-  }
+  destroy () {}
 }
 

[Killed] ConditionalExpression
src/core/ComponentItem.js:74:9
   }
 
   destroy () {
-    if (this.instance && typeof this.instance.destroy === 'function') {
+    if (true) {
       this.instance.destroy()
     }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'destroy')

[Killed] LogicalOperator
src/core/ComponentItem.js:74:9
   }
 
   destroy () {
-    if (this.instance && typeof this.instance.destroy === 'function') {
+    if (this.instance || typeof this.instance.destroy === 'function') {
       this.instance.destroy()
     }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'destroy')
