[Killed] BlockStatement
src/core/ContainerItem.js:5:39
 import { Splitter } from '../ui/Splitter.js'
 
 export class ContainerItem extends ContentItem {
-  constructor (config, layoutManager) {
-    super(config, layoutManager)
-    this.splitters = []
-    this._prevChildOrder = [] // Track children for diffing
-  }
+  constructor (config, layoutManager) {}
 
   destroy () {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] ArrayDeclaration
src/core/ContainerItem.js:7:22
 export class ContainerItem extends ContentItem {
   constructor (config, layoutManager) {
     super(config, layoutManager)
-    this.splitters = []
+    this.splitters = ["Stryker was here"]
     this._prevChildOrder = [] // Track children for diffing
   }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Survived] ArrayDeclaration
src/core/ContainerItem.js:8:28
   constructor (config, layoutManager) {
     super(config, layoutManager)
     this.splitters = []
-    this._prevChildOrder = [] // Track children for diffing
+    this._prevChildOrder = ["Stryker was here"] // Track children for diffing
   }
 

[Survived] BlockStatement
src/core/ContainerItem.js:11:14
     this._prevChildOrder = [] // Track children for diffing
   }
 
-  destroy () {
-    // Must clone array to avoid skipping indices as children remove themselves
-    const kids = [...this.children]
-    for (const child of kids) {
-      if (child.destroy() === false) return false
-    }
-    this.splitters.forEach(s => s.destroy())
-    this.splitters = []
-    this._prevChildOrder = []
-    return super.destroy()
-  }
+  destroy () {}
 
   updateFlex () {

[Survived] BlockStatement
src/core/ContainerItem.js:14:31
   destroy () {
     // Must clone array to avoid skipping indices as children remove themselves
     const kids = [...this.children]
-    for (const child of kids) {
-      if (child.destroy() === false) return false
-    }
+    for (const child of kids) {}
     this.splitters.forEach(s => s.destroy())
     this.splitters = []

[Survived] ConditionalExpression
src/core/ContainerItem.js:15:11
     // Must clone array to avoid skipping indices as children remove themselves
     const kids = [...this.children]
     for (const child of kids) {
-      if (child.destroy() === false) return false
+      if (false) return false
     }
     this.splitters.forEach(s => s.destroy())

[Survived] BooleanLiteral
src/core/ContainerItem.js:15:31
     // Must clone array to avoid skipping indices as children remove themselves
     const kids = [...this.children]
     for (const child of kids) {
-      if (child.destroy() === false) return false
+      if (child.destroy() === true) return false
     }
     this.splitters.forEach(s => s.destroy())

[Survived] ArrowFunction
src/core/ContainerItem.js:17:28
     for (const child of kids) {
       if (child.destroy() === false) return false
     }
-    this.splitters.forEach(s => s.destroy())
+    this.splitters.forEach(() => undefined)
     this.splitters = []
     this._prevChildOrder = []

[Survived] BlockStatement
src/core/ContainerItem.js:23:17
     return super.destroy()
   }
 
-  updateFlex () {
-    super.updateFlex()
-    this.children.forEach(child => {
-      if (child.updateFlex) {
-        child.updateFlex()
-      }
-    })
-  }
+  updateFlex () {}
 
   toConfig () {

[Survived] BlockStatement
src/core/ContainerItem.js:25:36
 
   updateFlex () {
     super.updateFlex()
-    this.children.forEach(child => {
-      if (child.updateFlex) {
-        child.updateFlex()
-      }
-    })
+    this.children.forEach(child => {})
   }
 

[Survived] ConditionalExpression
src/core/ContainerItem.js:26:11
   updateFlex () {
     super.updateFlex()
     this.children.forEach(child => {
-      if (child.updateFlex) {
+      if (true) {
         child.updateFlex()
       }

[Survived] BlockStatement
src/core/ContainerItem.js:26:29
   updateFlex () {
     super.updateFlex()
     this.children.forEach(child => {
-      if (child.updateFlex) {
-        child.updateFlex()
-      }
+      if (child.updateFlex) {}
     })
   }

[NoCoverage] BlockStatement
src/core/ContainerItem.js:32:15
     })
   }
 
-  toConfig () {
-    const res = super.toConfig()
-    res.content = this.children.map(c => c.toConfig())
-    return res
-  }
+  toConfig () {}
 
   createDOM () {

[NoCoverage] ArrowFunction
src/core/ContainerItem.js:34:37
 
   toConfig () {
     const res = super.toConfig()
-    res.content = this.children.map(c => c.toConfig())
+    res.content = this.children.map(() => undefined)
     return res
   }

[Killed] BlockStatement
src/core/ContainerItem.js:38:16
     return res
   }
 
-  createDOM () {
-    this.element = document.createElement('div')
-    this.element.className = this.config.type === 'row' ? 'tulweb-row' : 'tulweb-column'
-  }
+  createDOM () {}
 
   _appendDOMChild (child, index) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Failed to execute 'appendChild' on 'Node': parameter 1 is not of type 'Node'.

[Killed] StringLiteral
src/core/ContainerItem.js:39:43
   }
 
   createDOM () {
-    this.element = document.createElement('div')
+    this.element = document.createElement("")
     this.element.className = this.config.type === 'row' ? 'tulweb-row' : 'tulweb-column'
   }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: InvalidCharacterError: "" did not match the Name production

[Survived] EqualityOperator
src/core/ContainerItem.js:40:30
 
   createDOM () {
     this.element = document.createElement('div')
-    this.element.className = this.config.type === 'row' ? 'tulweb-row' : 'tulweb-column'
+    this.element.className = this.config.type !== 'row' ? 'tulweb-row' : 'tulweb-column'
   }
 

[Survived] ConditionalExpression
src/core/ContainerItem.js:40:30
 
   createDOM () {
     this.element = document.createElement('div')
-    this.element.className = this.config.type === 'row' ? 'tulweb-row' : 'tulweb-column'
+    this.element.className = false ? 'tulweb-row' : 'tulweb-column'
   }
 

[Survived] BlockStatement
src/core/ContainerItem.js:58:22
   /**
      * Normalize flex weights so they sum to ~100.
      */
-  _normalizeSizes () {
-    if (this.children.length === 0) return
-    const weightChildren = this.children.filter(c => typeof c.size === 'number')
-    if (weightChildren.length === 0) return
-
-    const totalWeight = weightChildren.reduce((sum, c) => sum + (c.size || 0), 0)
-    if (totalWeight === 0) {
-      const p = 100 / weightChildren.length
-      weightChildren.forEach(c => { c.size = p })
-    } else if (Math.abs(totalWeight - 100) > 1) {
-      weightChildren.forEach(c => { c.size = (c.size / totalWeight) * 100 })
-    }
-  }
+  _normalizeSizes () {}
 
   /**

[Survived] ConditionalExpression
src/core/ContainerItem.js:59:9
      * Normalize flex weights so they sum to ~100.
      */
   _normalizeSizes () {
-    if (this.children.length === 0) return
+    if (false) return
     const weightChildren = this.children.filter(c => typeof c.size === 'number')
     if (weightChildren.length === 0) return

[Survived] ConditionalExpression
src/core/ContainerItem.js:59:9
      * Normalize flex weights so they sum to ~100.
      */
   _normalizeSizes () {
-    if (this.children.length === 0) return
+    if (true) return
     const weightChildren = this.children.filter(c => typeof c.size === 'number')
     if (weightChildren.length === 0) return

[Survived] ConditionalExpression
src/core/ContainerItem.js:60:54
      */
   _normalizeSizes () {
     if (this.children.length === 0) return
-    const weightChildren = this.children.filter(c => typeof c.size === 'number')
+    const weightChildren = this.children.filter(c => false)
     if (weightChildren.length === 0) return
 

[Survived] EqualityOperator
src/core/ContainerItem.js:60:54
      */
   _normalizeSizes () {
     if (this.children.length === 0) return
-    const weightChildren = this.children.filter(c => typeof c.size === 'number')
+    const weightChildren = this.children.filter(c => typeof c.size !== 'number')
     if (weightChildren.length === 0) return
 

[Survived] ConditionalExpression
src/core/ContainerItem.js:61:9
   _normalizeSizes () {
     if (this.children.length === 0) return
     const weightChildren = this.children.filter(c => typeof c.size === 'number')
-    if (weightChildren.length === 0) return
+    if (true) return
 
     const totalWeight = weightChildren.reduce((sum, c) => sum + (c.size || 0), 0)

[Survived] EqualityOperator
src/core/ContainerItem.js:61:9
   _normalizeSizes () {
     if (this.children.length === 0) return
     const weightChildren = this.children.filter(c => typeof c.size === 'number')
-    if (weightChildren.length === 0) return
+    if (weightChildren.length !== 0) return
 
     const totalWeight = weightChildren.reduce((sum, c) => sum + (c.size || 0), 0)

[NoCoverage] ArrowFunction
src/core/ContainerItem.js:63:47
     const weightChildren = this.children.filter(c => typeof c.size === 'number')
     if (weightChildren.length === 0) return
 
-    const totalWeight = weightChildren.reduce((sum, c) => sum + (c.size || 0), 0)
+    const totalWeight = weightChildren.reduce(() => undefined, 0)
     if (totalWeight === 0) {
       const p = 100 / weightChildren.length

[NoCoverage] LogicalOperator
src/core/ContainerItem.js:63:66
     const weightChildren = this.children.filter(c => typeof c.size === 'number')
     if (weightChildren.length === 0) return
 
-    const totalWeight = weightChildren.reduce((sum, c) => sum + (c.size || 0), 0)
+    const totalWeight = weightChildren.reduce((sum, c) => sum + (c.size && 0), 0)
     if (totalWeight === 0) {
       const p = 100 / weightChildren.length

[NoCoverage] ConditionalExpression
src/core/ContainerItem.js:64:9
     if (weightChildren.length === 0) return
 
     const totalWeight = weightChildren.reduce((sum, c) => sum + (c.size || 0), 0)
-    if (totalWeight === 0) {
+    if (false) {
       const p = 100 / weightChildren.length
       weightChildren.forEach(c => { c.size = p })

[NoCoverage] BlockStatement
src/core/ContainerItem.js:64:28
     if (weightChildren.length === 0) return
 
     const totalWeight = weightChildren.reduce((sum, c) => sum + (c.size || 0), 0)
-    if (totalWeight === 0) {
-      const p = 100 / weightChildren.length
-      weightChildren.forEach(c => { c.size = p })
-    } else if (Math.abs(totalWeight - 100) > 1) {
+    if (totalWeight === 0) {} else if (Math.abs(totalWeight - 100) > 1) {
       weightChildren.forEach(c => { c.size = (c.size / totalWeight) * 100 })
     }

[NoCoverage] ArithmeticOperator
src/core/ContainerItem.js:65:17
 
     const totalWeight = weightChildren.reduce((sum, c) => sum + (c.size || 0), 0)
     if (totalWeight === 0) {
-      const p = 100 / weightChildren.length
+      const p = 100 * weightChildren.length
       weightChildren.forEach(c => { c.size = p })
     } else if (Math.abs(totalWeight - 100) > 1) {

[NoCoverage] BlockStatement
src/core/ContainerItem.js:66:35
     const totalWeight = weightChildren.reduce((sum, c) => sum + (c.size || 0), 0)
     if (totalWeight === 0) {
       const p = 100 / weightChildren.length
-      weightChildren.forEach(c => { c.size = p })
+      weightChildren.forEach(c => {})
     } else if (Math.abs(totalWeight - 100) > 1) {
       weightChildren.forEach(c => { c.size = (c.size / totalWeight) * 100 })

[NoCoverage] EqualityOperator
src/core/ContainerItem.js:67:16
     if (totalWeight === 0) {
       const p = 100 / weightChildren.length
       weightChildren.forEach(c => { c.size = p })
-    } else if (Math.abs(totalWeight - 100) > 1) {
+    } else if (Math.abs(totalWeight - 100) <= 1) {
       weightChildren.forEach(c => { c.size = (c.size / totalWeight) * 100 })
     }

[NoCoverage] ConditionalExpression
src/core/ContainerItem.js:67:16
     if (totalWeight === 0) {
       const p = 100 / weightChildren.length
       weightChildren.forEach(c => { c.size = p })
-    } else if (Math.abs(totalWeight - 100) > 1) {
+    } else if (true) {
       weightChildren.forEach(c => { c.size = (c.size / totalWeight) * 100 })
     }

[NoCoverage] ArithmeticOperator
src/core/ContainerItem.js:68:46
       const p = 100 / weightChildren.length
       weightChildren.forEach(c => { c.size = p })
     } else if (Math.abs(totalWeight - 100) > 1) {
-      weightChildren.forEach(c => { c.size = (c.size / totalWeight) * 100 })
+      weightChildren.forEach(c => { c.size = c.size / totalWeight / 100 })
     }
   }

[NoCoverage] ArithmeticOperator
src/core/ContainerItem.js:68:47
       const p = 100 / weightChildren.length
       weightChildren.forEach(c => { c.size = p })
     } else if (Math.abs(totalWeight - 100) > 1) {
-      weightChildren.forEach(c => { c.size = (c.size / totalWeight) * 100 })
+      weightChildren.forEach(c => { c.size = (c.size * totalWeight) * 100 })
     }
   }

[Survived] BlockStatement
src/core/ContainerItem.js:76:25
      * Check if the child list matches the previous render.
      * Returns true when the children and their order are identical.
      */
-  _childrenUnchanged () {
-    if (this._prevChildOrder.length !== this.children.length) return false
-    for (let i = 0; i < this.children.length; i++) {
-      if (this._prevChildOrder[i] !== this.children[i]) return false
-    }
-    return true
-  }
+  _childrenUnchanged () {}
 
   /**

[Survived] EqualityOperator
src/core/ContainerItem.js:77:9
      * Returns true when the children and their order are identical.
      */
   _childrenUnchanged () {
-    if (this._prevChildOrder.length !== this.children.length) return false
+    if (this._prevChildOrder.length === this.children.length) return false
     for (let i = 0; i < this.children.length; i++) {
       if (this._prevChildOrder[i] !== this.children[i]) return false

[Survived] ConditionalExpression
src/core/ContainerItem.js:77:9
      * Returns true when the children and their order are identical.
      */
   _childrenUnchanged () {
-    if (this._prevChildOrder.length !== this.children.length) return false
+    if (true) return false
     for (let i = 0; i < this.children.length; i++) {
       if (this._prevChildOrder[i] !== this.children[i]) return false

[Survived] EqualityOperator
src/core/ContainerItem.js:78:21
      */
   _childrenUnchanged () {
     if (this._prevChildOrder.length !== this.children.length) return false
-    for (let i = 0; i < this.children.length; i++) {
+    for (let i = 0; i <= this.children.length; i++) {
       if (this._prevChildOrder[i] !== this.children[i]) return false
     }

[Survived] ConditionalExpression
src/core/ContainerItem.js:78:21
      */
   _childrenUnchanged () {
     if (this._prevChildOrder.length !== this.children.length) return false
-    for (let i = 0; i < this.children.length; i++) {
+    for (let i = 0; false; i++) {
       if (this._prevChildOrder[i] !== this.children[i]) return false
     }

[Survived] ConditionalExpression
src/core/ContainerItem.js:79:11
   _childrenUnchanged () {
     if (this._prevChildOrder.length !== this.children.length) return false
     for (let i = 0; i < this.children.length; i++) {
-      if (this._prevChildOrder[i] !== this.children[i]) return false
+      if (true) return false
     }
     return true

[NoCoverage] BooleanLiteral
src/core/ContainerItem.js:79:64
   _childrenUnchanged () {
     if (this._prevChildOrder.length !== this.children.length) return false
     for (let i = 0; i < this.children.length; i++) {
-      if (this._prevChildOrder[i] !== this.children[i]) return false
+      if (this._prevChildOrder[i] !== this.children[i]) return true
     }
     return true

[Survived] EqualityOperator
src/core/ContainerItem.js:89:24
      * Reuses Splitter instances whose prev/next pair is unchanged.
      */
   _rebuildDOM () {
-    const isVertical = this.config.type === 'row'
+    const isVertical = this.config.type !== 'row'
 
     // Build a lookup of existing splitters by their (prev, next) item pair

[Survived] ConditionalExpression
src/core/ContainerItem.js:89:24
      * Reuses Splitter instances whose prev/next pair is unchanged.
      */
   _rebuildDOM () {
-    const isVertical = this.config.type === 'row'
+    const isVertical = true
 
     // Build a lookup of existing splitters by their (prev, next) item pair

[Survived] BlockStatement
src/core/ContainerItem.js:93:37
 
     // Build a lookup of existing splitters by their (prev, next) item pair
     const existingSplitters = new Map()
-    for (const s of this.splitters) {
-      existingSplitters.set(s.prevItem.id + ':' + s.nextItem.id, s)
-    }
+    for (const s of this.splitters) {}
 
     const newSplitters = []

[Survived] StringLiteral
src/core/ContainerItem.js:94:45
     // Build a lookup of existing splitters by their (prev, next) item pair
     const existingSplitters = new Map()
     for (const s of this.splitters) {
-      existingSplitters.set(s.prevItem.id + ':' + s.nextItem.id, s)
+      existingSplitters.set(s.prevItem.id + "" + s.nextItem.id, s)
     }
 

[Survived] BlockStatement
src/core/ContainerItem.js:100:45
     const newSplitters = []
     const fragment = document.createDocumentFragment()
 
-    this.children.forEach((child, index) => {
-      fragment.appendChild(child.element)
-
-      if (index < this.children.length - 1) {
-        const nextChild = this.children[index + 1]
-        const key = child.id + ':' + nextChild.id
-
-        if (existingSplitters.has(key)) {
-          // Reuse existing splitter — just re-append its element
-          const reused = existingSplitters.get(key)
-          fragment.appendChild(reused.element)
-          newSplitters.push(reused)
-          existingSplitters.delete(key) // Mark as consumed
-        } else {
-          // Create splitter with the real container element (needed for
-          // getBoundingClientRect in keyboard/mouse resize calculations).
-          // The constructor appends to this.element, so we immediately
-          // move it to the fragment for batched DOM insertion.
-          const splitter = new Splitter(isVertical, child, nextChild, this.element)
-          fragment.appendChild(splitter.element)
-          newSplitters.push(splitter)
-        }
-      }
-    })
+    this.children.forEach((child, index) => {})
 
     // Destroy orphaned splitters that are no longer needed

[Killed] EqualityOperator
src/core/ContainerItem.js:103:11
     this.children.forEach((child, index) => {
       fragment.appendChild(child.element)
 
-      if (index < this.children.length - 1) {
+      if (index <= this.children.length - 1) {
         const nextChild = this.children[index + 1]
         const key = child.id + ':' + nextChild.id
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/core/ContainerItem.js:103:11
     this.children.forEach((child, index) => {
       fragment.appendChild(child.element)
 
-      if (index < this.children.length - 1) {
+      if (true) {
         const nextChild = this.children[index + 1]
         const key = child.id + ':' + nextChild.id
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ArithmeticOperator
src/core/ContainerItem.js:104:41
       fragment.appendChild(child.element)
 
       if (index < this.children.length - 1) {
-        const nextChild = this.children[index + 1]
+        const nextChild = this.children[index - 1]
         const key = child.id + ':' + nextChild.id
 
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/core/ContainerItem.js:107:13
         const nextChild = this.children[index + 1]
         const key = child.id + ':' + nextChild.id
 
-        if (existingSplitters.has(key)) {
+        if (true) {
           // Reuse existing splitter — just re-append its element
           const reused = existingSplitters.get(key)
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'element')

[Survived] BlockStatement
src/core/ContainerItem.js:107:41
         const nextChild = this.children[index + 1]
         const key = child.id + ':' + nextChild.id
 
-        if (existingSplitters.has(key)) {
-          // Reuse existing splitter — just re-append its element
-          const reused = existingSplitters.get(key)
-          fragment.appendChild(reused.element)
-          newSplitters.push(reused)
-          existingSplitters.delete(key) // Mark as consumed
-        } else {
+        if (existingSplitters.has(key)) {} else {
           // Create splitter with the real container element (needed for
           // getBoundingClientRect in keyboard/mouse resize calculations).

[Survived] BlockStatement
src/core/ContainerItem.js:113:16
           fragment.appendChild(reused.element)
           newSplitters.push(reused)
           existingSplitters.delete(key) // Mark as consumed
-        } else {
-          // Create splitter with the real container element (needed for
-          // getBoundingClientRect in keyboard/mouse resize calculations).
-          // The constructor appends to this.element, so we immediately
-          // move it to the fragment for batched DOM insertion.
-          const splitter = new Splitter(isVertical, child, nextChild, this.element)
-          fragment.appendChild(splitter.element)
-          newSplitters.push(splitter)
-        }
+        } else {}
       }
     })

[Survived] ArrowFunction
src/core/ContainerItem.js:126:31
     })
 
     // Destroy orphaned splitters that are no longer needed
-    existingSplitters.forEach(s => s.destroy())
+    existingSplitters.forEach(() => undefined)
 
     // Single DOM write: clear and append the fragment

[Survived] BlockStatement
src/core/ContainerItem.js:136:19
     this._prevChildOrder = [...this.children]
   }
 
-  updateLayout () {
-    this._normalizeSizes()
-
-    const structureChanged = !this._childrenUnchanged()
-
-    if (structureChanged) {
-      this._rebuildDOM()
-    }
-
-    // Recurse into children — they may need their own layout updated
-    this.children.forEach(child => child.updateLayout())
-    this.updateFlex()
-  }
+  updateLayout () {}
 }
 

[Survived] BooleanLiteral
src/core/ContainerItem.js:139:30
   updateLayout () {
     this._normalizeSizes()
 
-    const structureChanged = !this._childrenUnchanged()
+    const structureChanged = this._childrenUnchanged()
 
     if (structureChanged) {

[Survived] BlockStatement
src/core/ContainerItem.js:141:27
 
     const structureChanged = !this._childrenUnchanged()
 
-    if (structureChanged) {
-      this._rebuildDOM()
-    }
+    if (structureChanged) {}
 
     // Recurse into children — they may need their own layout updated

[Survived] ConditionalExpression
src/core/ContainerItem.js:141:9
 
     const structureChanged = !this._childrenUnchanged()
 
-    if (structureChanged) {
+    if (true) {
       this._rebuildDOM()
     }

[Survived] ArrowFunction
src/core/ContainerItem.js:146:27
     }
 
     // Recurse into children — they may need their own layout updated
-    this.children.forEach(child => child.updateLayout())
+    this.children.forEach(() => undefined)
     this.updateFlex()
   }
