[Killed] BlockStatement
src/core/ContentItem.js:5:39
 import { Utils } from '../utils/Utils.js'
 
 export class ContentItem extends EventEmitter {
-  constructor (config, layoutManager) {
-    super()
-    this.config = config || {}
-    this.layoutManager = layoutManager
-    this.parent = null
-    this.children = []
-    this.element = null
-    this.size = this.config.size || null
-    this.minWidth = this.config.minWidth ?? 0
-    this.minHeight = this.config.minHeight ?? 0
-    this.id = this.config.id || Utils.generateId()
-
-    this._isActive = false
-    this._isFocused = false
-
-    this.createDOM()
-    if (this.element) {
-      this.element.tulwebItem = this // Link back from DOM
-    }
-  }
+  constructor (config, layoutManager) {}
 
   createDOM () { /* Override */ }
killedBy: StackItem initializes with default settings
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] LogicalOperator
src/core/ContentItem.js:7:19
 export class ContentItem extends EventEmitter {
   constructor (config, layoutManager) {
     super()
-    this.config = config || {}
+    this.config = config && {}
     this.layoutManager = layoutManager
     this.parent = null
killedBy: StackItem serializes to correct config
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stack"
Received: undefined

[Killed] ConditionalExpression
src/core/ContentItem.js:7:19
 export class ContentItem extends EventEmitter {
   constructor (config, layoutManager) {
     super()
-    this.config = config || {}
+    this.config = false
     this.layoutManager = layoutManager
     this.parent = null
killedBy: StackItem serializes to correct config
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stack"
Received: undefined

[Survived] ConditionalExpression
src/core/ContentItem.js:12:17
     this.parent = null
     this.children = []
     this.element = null
-    this.size = this.config.size || null
+    this.size = false
     this.minWidth = this.config.minWidth ?? 0
     this.minHeight = this.config.minHeight ?? 0

[Survived] LogicalOperator
src/core/ContentItem.js:12:17
     this.parent = null
     this.children = []
     this.element = null
-    this.size = this.config.size || null
+    this.size = this.config.size && null
     this.minWidth = this.config.minWidth ?? 0
     this.minHeight = this.config.minHeight ?? 0

[Survived] LogicalOperator
src/core/ContentItem.js:13:21
     this.children = []
     this.element = null
     this.size = this.config.size || null
-    this.minWidth = this.config.minWidth ?? 0
+    this.minWidth = this.config.minWidth && 0
     this.minHeight = this.config.minHeight ?? 0
     this.id = this.config.id || Utils.generateId()

[Survived] LogicalOperator
src/core/ContentItem.js:14:22
     this.element = null
     this.size = this.config.size || null
     this.minWidth = this.config.minWidth ?? 0
-    this.minHeight = this.config.minHeight ?? 0
+    this.minHeight = this.config.minHeight && 0
     this.id = this.config.id || Utils.generateId()
 

[Killed] ConditionalExpression
src/core/ContentItem.js:15:15
     this.size = this.config.size || null
     this.minWidth = this.config.minWidth ?? 0
     this.minHeight = this.config.minHeight ?? 0
-    this.id = this.config.id || Utils.generateId()
+    this.id = true
 
     this._isActive = false
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/core/ContentItem.js:15:15
     this.size = this.config.size || null
     this.minWidth = this.config.minWidth ?? 0
     this.minHeight = this.config.minHeight ?? 0
-    this.id = this.config.id || Utils.generateId()
+    this.id = false
 
     this._isActive = false
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] BooleanLiteral
src/core/ContentItem.js:17:22
     this.minHeight = this.config.minHeight ?? 0
     this.id = this.config.id || Utils.generateId()
 
-    this._isActive = false
+    this._isActive = true
     this._isFocused = false
 

[Survived] BooleanLiteral
src/core/ContentItem.js:18:23
     this.id = this.config.id || Utils.generateId()
 
     this._isActive = false
-    this._isFocused = false
+    this._isFocused = true
 
     this.createDOM()

[Survived] ConditionalExpression
src/core/ContentItem.js:21:9
     this._isFocused = false
 
     this.createDOM()
-    if (this.element) {
+    if (false) {
       this.element.tulwebItem = this // Link back from DOM
     }

[Survived] ConditionalExpression
src/core/ContentItem.js:21:9
     this._isFocused = false
 
     this.createDOM()
-    if (this.element) {
+    if (true) {
       this.element.tulwebItem = this // Link back from DOM
     }

[Killed] BlockStatement
src/core/ContentItem.js:28:47
 
   createDOM () { /* Override */ }
 
-  addChild (child, index, skipLayout = false) {
-    child.parent = this
-    if (typeof index === 'number') {
-      this.children.splice(index, 0, child)
-    } else {
-      this.children.push(child)
-    }
-    this._appendDOMChild(child, index)
-    if (!skipLayout) {
-      this.updateLayout()
-    }
-  }
+  addChild (child, index, skipLayout = false) {}
 
   removeChild (child) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] BooleanLiteral
src/core/ContentItem.js:28:40
 
   createDOM () { /* Override */ }
 
-  addChild (child, index, skipLayout = false) {
+  addChild (child, index, skipLayout = true) {
     child.parent = this
     if (typeof index === 'number') {

[Killed] ConditionalExpression
src/core/ContentItem.js:30:9
 
   addChild (child, index, skipLayout = false) {
     child.parent = this
-    if (typeof index === 'number') {
+    if (false) {
       this.children.splice(index, 0, child)
     } else {
killedBy: PopoutManager Unit Tests re-integration restores stack to the exact same position
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] EqualityOperator
src/core/ContentItem.js:30:9
 
   addChild (child, index, skipLayout = false) {
     child.parent = this
-    if (typeof index === 'number') {
+    if (typeof index !== 'number') {
       this.children.splice(index, 0, child)
     } else {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/core/ContentItem.js:32:12
     child.parent = this
     if (typeof index === 'number') {
       this.children.splice(index, 0, child)
-    } else {
-      this.children.push(child)
-    }
+    } else {}
     this._appendDOMChild(child, index)
     if (!skipLayout) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] ConditionalExpression
src/core/ContentItem.js:36:9
       this.children.push(child)
     }
     this._appendDOMChild(child, index)
-    if (!skipLayout) {
+    if (true) {
       this.updateLayout()
     }

[Survived] BlockStatement
src/core/ContentItem.js:36:22
       this.children.push(child)
     }
     this._appendDOMChild(child, index)
-    if (!skipLayout) {
-      this.updateLayout()
-    }
+    if (!skipLayout) {}
   }
 

[Killed] BlockStatement
src/core/ContentItem.js:41:23
     }
   }
 
-  removeChild (child) {
-    const index = this.children.indexOf(child)
-    if (index > -1) {
-      // Check if closure is allowed
-      if (child.emit('beforeClose') === false) return false
-
-      this.children.splice(index, 1)
-      child.parent = null
-
-      // Perform actual destruction after removal from array
-      child.destroy()
-
-      this.updateLayout()
-      this.emit('stateChanged')
-      if (this.layoutManager) {
-        this.layoutManager.emit('stateChanged')
-      }
-      return true
-    }
-    return false
-  }
+  removeChild (child) {}
 
   replaceChild (oldChild, newChild, index) {
killedBy: StackItem adds and removes component children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
src/core/ContentItem.js:43:9
 
   removeChild (child) {
     const index = this.children.indexOf(child)
-    if (index > -1) {
+    if (false) {
       // Check if closure is allowed
       if (child.emit('beforeClose') === false) return false
killedBy: StackItem adds and removes component children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] EqualityOperator
src/core/ContentItem.js:43:9
 
   removeChild (child) {
     const index = this.children.indexOf(child)
-    if (index > -1) {
+    if (index <= -1) {
       // Check if closure is allowed
       if (child.emit('beforeClose') === false) return false
killedBy: StackItem adds and removes component children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] EqualityOperator
src/core/ContentItem.js:45:11
     const index = this.children.indexOf(child)
     if (index > -1) {
       // Check if closure is allowed
-      if (child.emit('beforeClose') === false) return false
+      if (child.emit('beforeClose') !== false) return false
 
       this.children.splice(index, 1)
killedBy: StackItem adds and removes component children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BooleanLiteral
src/core/ContentItem.js:45:41
     const index = this.children.indexOf(child)
     if (index > -1) {
       // Check if closure is allowed
-      if (child.emit('beforeClose') === false) return false
+      if (child.emit('beforeClose') === true) return false
 
       this.children.splice(index, 1)
killedBy: StackItem adds and removes component children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Survived] StringLiteral
src/core/ContentItem.js:54:17
       child.destroy()
 
       this.updateLayout()
-      this.emit('stateChanged')
+      this.emit("")
       if (this.layoutManager) {
         this.layoutManager.emit('stateChanged')

[Survived] ConditionalExpression
src/core/ContentItem.js:55:11
 
       this.updateLayout()
       this.emit('stateChanged')
-      if (this.layoutManager) {
+      if (true) {
         this.layoutManager.emit('stateChanged')
       }

[Survived] ConditionalExpression
src/core/ContentItem.js:55:11
 
       this.updateLayout()
       this.emit('stateChanged')
-      if (this.layoutManager) {
+      if (false) {
         this.layoutManager.emit('stateChanged')
       }

[Survived] StringLiteral
src/core/ContentItem.js:56:33
       this.updateLayout()
       this.emit('stateChanged')
       if (this.layoutManager) {
-        this.layoutManager.emit('stateChanged')
+        this.layoutManager.emit("")
       }
       return true

[NoCoverage] BlockStatement
src/core/ContentItem.js:63:44
     return false
   }
 
-  replaceChild (oldChild, newChild, index) {
-    this.children[index] = newChild
-    newChild.parent = this
-    oldChild.parent = null
-    this._replaceDOMChild(oldChild, newChild)
-    this.updateLayout()
-  }
+  replaceChild (oldChild, newChild, index) {}
 
   /**

[Killed] BlockStatement
src/core/ContentItem.js:76:23
      * Used by the popout system to move stacks to external windows
      * while preserving their DOM, event listeners, and closure state.
      */
-  detachChild (child) {
-    const index = this.children.indexOf(child)
-    if (index > -1) {
-      this.children.splice(index, 1)
-      child.parent = null
-      // Remove from DOM without destroying
-      if (child.element && child.element.parentElement) {
-        child.element.parentElement.removeChild(child.element)
-      }
-      this.updateLayout()
-      this.emit('stateChanged')
-      if (this.layoutManager) {
-        this.layoutManager.emit('stateChanged')
-      }
-      return true
-    }
-    return false
-  }
+  detachChild (child) {}
 
   _appendDOMChild (child, index) { /* Override */ }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeNull()

[Survived] BlockStatement
src/core/ContentItem.js:82:57
       this.children.splice(index, 1)
       child.parent = null
       // Remove from DOM without destroying
-      if (child.element && child.element.parentElement) {
-        child.element.parentElement.removeChild(child.element)
-      }
+      if (child.element && child.element.parentElement) {}
       this.updateLayout()
       this.emit('stateChanged')

[Survived] ConditionalExpression
src/core/ContentItem.js:82:11
       this.children.splice(index, 1)
       child.parent = null
       // Remove from DOM without destroying
-      if (child.element && child.element.parentElement) {
+      if (false) {
         child.element.parentElement.removeChild(child.element)
       }

[NoCoverage] BlockStatement
src/core/ContentItem.js:101:20
 
   updateLayout () { /* Override */ }
 
-  getMinWidthPx () {
-    if (this.isMinimized) return 0
-    const parentPx = this.parent ? this.parent.element.offsetWidth : (this.layoutManager ? this.layoutManager.rootElement.offsetWidth : window.innerWidth)
-    return Utils.resolveToPixels(this.minWidth, parentPx)
-  }
+  getMinWidthPx () {}
 
   getMinHeightPx () {

[NoCoverage] ConditionalExpression
src/core/ContentItem.js:102:9
   updateLayout () { /* Override */ }
 
   getMinWidthPx () {
-    if (this.isMinimized) return 0
+    if (true) return 0
     const parentPx = this.parent ? this.parent.element.offsetWidth : (this.layoutManager ? this.layoutManager.rootElement.offsetWidth : window.innerWidth)
     return Utils.resolveToPixels(this.minWidth, parentPx)

[NoCoverage] ConditionalExpression
src/core/ContentItem.js:102:9
   updateLayout () { /* Override */ }
 
   getMinWidthPx () {
-    if (this.isMinimized) return 0
+    if (false) return 0
     const parentPx = this.parent ? this.parent.element.offsetWidth : (this.layoutManager ? this.layoutManager.rootElement.offsetWidth : window.innerWidth)
     return Utils.resolveToPixels(this.minWidth, parentPx)

[NoCoverage] BlockStatement
src/core/ContentItem.js:107:21
     return Utils.resolveToPixels(this.minWidth, parentPx)
   }
 
-  getMinHeightPx () {
-    if (this.isMinimized) return 0
-    const parentPx = this.parent ? this.parent.element.offsetHeight : (this.layoutManager ? this.layoutManager.rootElement.offsetHeight : window.innerHeight)
-    return Utils.resolveToPixels(this.minHeight, parentPx)
-  }
+  getMinHeightPx () {}
 
   updateFlex () {

[NoCoverage] ConditionalExpression
src/core/ContentItem.js:108:9
   }
 
   getMinHeightPx () {
-    if (this.isMinimized) return 0
+    if (true) return 0
     const parentPx = this.parent ? this.parent.element.offsetHeight : (this.layoutManager ? this.layoutManager.rootElement.offsetHeight : window.innerHeight)
     return Utils.resolveToPixels(this.minHeight, parentPx)

[NoCoverage] ConditionalExpression
src/core/ContentItem.js:108:9
   }
 
   getMinHeightPx () {
-    if (this.isMinimized) return 0
+    if (false) return 0
     const parentPx = this.parent ? this.parent.element.offsetHeight : (this.layoutManager ? this.layoutManager.rootElement.offsetHeight : window.innerHeight)
     return Utils.resolveToPixels(this.minHeight, parentPx)

[Survived] ConditionalExpression
src/core/ContentItem.js:114:9
   }
 
   updateFlex () {
-    if (!this.element) return
+    if (false) return
     const size = this.size
 

[Survived] ConditionalExpression
src/core/ContentItem.js:114:9
   }
 
   updateFlex () {
-    if (!this.element) return
+    if (true) return
     const size = this.size
 

[Survived] EqualityOperator
src/core/ContentItem.js:117:60
     if (!this.element) return
     const size = this.size
 
-    this.element.style.minWidth = this.isMinimized ? '' : (typeof this.minWidth === 'number' ? `${this.minWidth}px` : this.minWidth)
+    this.element.style.minWidth = this.isMinimized ? '' : (typeof this.minWidth !== 'number' ? `${this.minWidth}px` : this.minWidth)
     this.element.style.minHeight = this.isMinimized ? '' : (typeof this.minHeight === 'number' ? `${this.minHeight}px` : this.minHeight)
     if (typeof size === 'number') {

[Survived] ConditionalExpression
src/core/ContentItem.js:117:60
     if (!this.element) return
     const size = this.size
 
-    this.element.style.minWidth = this.isMinimized ? '' : (typeof this.minWidth === 'number' ? `${this.minWidth}px` : this.minWidth)
+    this.element.style.minWidth = this.isMinimized ? '' : (false ? `${this.minWidth}px` : this.minWidth)
     this.element.style.minHeight = this.isMinimized ? '' : (typeof this.minHeight === 'number' ? `${this.minHeight}px` : this.minHeight)
     if (typeof size === 'number') {

[Survived] ConditionalExpression
src/core/ContentItem.js:118:61
     const size = this.size
 
     this.element.style.minWidth = this.isMinimized ? '' : (typeof this.minWidth === 'number' ? `${this.minWidth}px` : this.minWidth)
-    this.element.style.minHeight = this.isMinimized ? '' : (typeof this.minHeight === 'number' ? `${this.minHeight}px` : this.minHeight)
+    this.element.style.minHeight = this.isMinimized ? '' : (true ? `${this.minHeight}px` : this.minHeight)
     if (typeof size === 'number') {
       this.element.style.flex = `${size} 1 0%`

[Survived] ConditionalExpression
src/core/ContentItem.js:118:61
     const size = this.size
 
     this.element.style.minWidth = this.isMinimized ? '' : (typeof this.minWidth === 'number' ? `${this.minWidth}px` : this.minWidth)
-    this.element.style.minHeight = this.isMinimized ? '' : (typeof this.minHeight === 'number' ? `${this.minHeight}px` : this.minHeight)
+    this.element.style.minHeight = this.isMinimized ? '' : (false ? `${this.minHeight}px` : this.minHeight)
     if (typeof size === 'number') {
       this.element.style.flex = `${size} 1 0%`

[Survived] ConditionalExpression
src/core/ContentItem.js:119:9
 
     this.element.style.minWidth = this.isMinimized ? '' : (typeof this.minWidth === 'number' ? `${this.minWidth}px` : this.minWidth)
     this.element.style.minHeight = this.isMinimized ? '' : (typeof this.minHeight === 'number' ? `${this.minHeight}px` : this.minHeight)
-    if (typeof size === 'number') {
+    if (false) {
       this.element.style.flex = `${size} 1 0%`
       this.element.style.width = ''

[Survived] ConditionalExpression
src/core/ContentItem.js:119:9
 
     this.element.style.minWidth = this.isMinimized ? '' : (typeof this.minWidth === 'number' ? `${this.minWidth}px` : this.minWidth)
     this.element.style.minHeight = this.isMinimized ? '' : (typeof this.minHeight === 'number' ? `${this.minHeight}px` : this.minHeight)
-    if (typeof size === 'number') {
+    if (true) {
       this.element.style.flex = `${size} 1 0%`
       this.element.style.width = ''

[NoCoverage] StringLiteral
src/core/ContentItem.js:121:34
     this.element.style.minHeight = this.isMinimized ? '' : (typeof this.minHeight === 'number' ? `${this.minHeight}px` : this.minHeight)
     if (typeof size === 'number') {
       this.element.style.flex = `${size} 1 0%`
-      this.element.style.width = ''
+      this.element.style.width = "Stryker was here!"
       this.element.style.height = ''
     } else if (typeof size === 'string') {

[Survived] ConditionalExpression
src/core/ContentItem.js:123:16
       this.element.style.flex = `${size} 1 0%`
       this.element.style.width = ''
       this.element.style.height = ''
-    } else if (typeof size === 'string') {
+    } else if (false) {
       this.element.style.flex = `0 0 ${size}`
       const isRow = this.parent && this.parent.config.type === 'row'

[Survived] EqualityOperator
src/core/ContentItem.js:123:16
       this.element.style.flex = `${size} 1 0%`
       this.element.style.width = ''
       this.element.style.height = ''
-    } else if (typeof size === 'string') {
+    } else if (typeof size !== 'string') {
       this.element.style.flex = `0 0 ${size}`
       const isRow = this.parent && this.parent.config.type === 'row'

[NoCoverage] StringLiteral
src/core/ContentItem.js:124:33
       this.element.style.width = ''
       this.element.style.height = ''
     } else if (typeof size === 'string') {
-      this.element.style.flex = `0 0 ${size}`
+      this.element.style.flex = ``
       const isRow = this.parent && this.parent.config.type === 'row'
       if (isRow) {

[NoCoverage] ConditionalExpression
src/core/ContentItem.js:125:21
       this.element.style.height = ''
     } else if (typeof size === 'string') {
       this.element.style.flex = `0 0 ${size}`
-      const isRow = this.parent && this.parent.config.type === 'row'
+      const isRow = false
       if (isRow) {
         this.element.style.width = size

[NoCoverage] EqualityOperator
src/core/ContentItem.js:125:36
       this.element.style.height = ''
     } else if (typeof size === 'string') {
       this.element.style.flex = `0 0 ${size}`
-      const isRow = this.parent && this.parent.config.type === 'row'
+      const isRow = this.parent && this.parent.config.type !== 'row'
       if (isRow) {
         this.element.style.width = size

[NoCoverage] ConditionalExpression
src/core/ContentItem.js:126:11
     } else if (typeof size === 'string') {
       this.element.style.flex = `0 0 ${size}`
       const isRow = this.parent && this.parent.config.type === 'row'
-      if (isRow) {
+      if (false) {
         this.element.style.width = size
         this.element.style.height = ''

[NoCoverage] ConditionalExpression
src/core/ContentItem.js:126:11
     } else if (typeof size === 'string') {
       this.element.style.flex = `0 0 ${size}`
       const isRow = this.parent && this.parent.config.type === 'row'
-      if (isRow) {
+      if (true) {
         this.element.style.width = size
         this.element.style.height = ''

[NoCoverage] BlockStatement
src/core/ContentItem.js:129:14
       if (isRow) {
         this.element.style.width = size
         this.element.style.height = ''
-      } else {
-        this.element.style.height = size
-        this.element.style.width = ''
-      }
+      } else {}
     } else {
       this.element.style.flex = '1 1 auto'

[Survived] BlockStatement
src/core/ContentItem.js:133:12
         this.element.style.height = size
         this.element.style.width = ''
       }
-    } else {
-      this.element.style.flex = '1 1 auto'
-      this.element.style.width = ''
-      this.element.style.height = ''
-    }
+    } else {}
     this.emit('resize')
   }

[Survived] StringLiteral
src/core/ContentItem.js:138:15
       this.element.style.width = ''
       this.element.style.height = ''
     }
-    this.emit('resize')
+    this.emit("")
   }
 

[Survived] ConditionalExpression
src/core/ContentItem.js:142:9
   }
 
   destroy () {
-    if (this.emit('beforeClose') === false) return false
+    if (true) return false
 
     if (this._isFocused) {

[Survived] BooleanLiteral
src/core/ContentItem.js:142:38
   }
 
   destroy () {
-    if (this.emit('beforeClose') === false) return false
+    if (this.emit('beforeClose') === true) return false
 
     if (this._isFocused) {

[NoCoverage] BlockStatement
src/core/ContentItem.js:144:26
   destroy () {
     if (this.emit('beforeClose') === false) return false
 
-    if (this._isFocused) {
-      this._isFocused = false
-      this.emit('defocus')
-    }
+    if (this._isFocused) {}
     if (this._isActive) {
       this._isActive = false

[Survived] ConditionalExpression
src/core/ContentItem.js:144:9
   destroy () {
     if (this.emit('beforeClose') === false) return false
 
-    if (this._isFocused) {
+    if (false) {
       this._isFocused = false
       this.emit('defocus')

[NoCoverage] BooleanLiteral
src/core/ContentItem.js:145:25
     if (this.emit('beforeClose') === false) return false
 
     if (this._isFocused) {
-      this._isFocused = false
+      this._isFocused = true
       this.emit('defocus')
     }

[Survived] ConditionalExpression
src/core/ContentItem.js:148:9
       this._isFocused = false
       this.emit('defocus')
     }
-    if (this._isActive) {
+    if (true) {
       this._isActive = false
       this.emit('inactive')

[Survived] ConditionalExpression
src/core/ContentItem.js:148:9
       this._isFocused = false
       this.emit('defocus')
     }
-    if (this._isActive) {
+    if (false) {
       this._isActive = false
       this.emit('inactive')

[Survived] BooleanLiteral
src/core/ContentItem.js:149:24
       this.emit('defocus')
     }
     if (this._isActive) {
-      this._isActive = false
+      this._isActive = true
       this.emit('inactive')
     }

[Survived] StringLiteral
src/core/ContentItem.js:150:17
     }
     if (this._isActive) {
       this._isActive = false
-      this.emit('inactive')
+      this.emit("")
     }
     this.emit('destroy')

[Survived] BlockStatement
src/core/ContentItem.js:154:27
     }
     this.emit('destroy')
     const kids = [...this.children]
-    for (const c of kids) {
-      if (c.destroy() === false) return false
-    }
+    for (const c of kids) {}
 
     if (this.parent) {

[NoCoverage] BooleanLiteral
src/core/ContentItem.js:155:41
     this.emit('destroy')
     const kids = [...this.children]
     for (const c of kids) {
-      if (c.destroy() === false) return false
+      if (c.destroy() === false) return true
     }
 

[Survived] ConditionalExpression
src/core/ContentItem.js:155:11
     this.emit('destroy')
     const kids = [...this.children]
     for (const c of kids) {
-      if (c.destroy() === false) return false
+      if (true) return false
     }
 

[Killed] ConditionalExpression
src/core/ContentItem.js:158:9
       if (c.destroy() === false) return false
     }
 
-    if (this.parent) {
+    if (true) {
       if (this.parent.children.length === 0 && this.parent.layoutManager) {
         this.parent.layoutManager._cleanupEmptyStack(this.parent)
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of null (reading 'children')

[Survived] ConditionalExpression
src/core/ContentItem.js:158:9
       if (c.destroy() === false) return false
     }
 
-    if (this.parent) {
+    if (false) {
       if (this.parent.children.length === 0 && this.parent.layoutManager) {
         this.parent.layoutManager._cleanupEmptyStack(this.parent)

[Killed] ConditionalExpression
src/core/ContentItem.js:159:11
     }
 
     if (this.parent) {
-      if (this.parent.children.length === 0 && this.parent.layoutManager) {
+      if (true) {
         this.parent.layoutManager._cleanupEmptyStack(this.parent)
       }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of null (reading 'removeChild')

[Killed] ConditionalExpression
src/core/ContentItem.js:159:11
     }
 
     if (this.parent) {
-      if (this.parent.children.length === 0 && this.parent.layoutManager) {
+      if (true && this.parent.layoutManager) {
         this.parent.layoutManager._cleanupEmptyStack(this.parent)
       }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of null (reading 'removeChild')

[Survived] ConditionalExpression
src/core/ContentItem.js:163:16
         this.parent.layoutManager._cleanupEmptyStack(this.parent)
       }
       this.parent.removeChild(this)
-    } else if (this.element && this.element.parentElement) {
+    } else if (false) {
       this.element.parentElement.removeChild(this.element)
     }

[Survived] LogicalOperator
src/core/ContentItem.js:163:16
         this.parent.layoutManager._cleanupEmptyStack(this.parent)
       }
       this.parent.removeChild(this)
-    } else if (this.element && this.element.parentElement) {
+    } else if (this.element || this.element.parentElement) {
       this.element.parentElement.removeChild(this.element)
     }

[Killed] BlockStatement
src/core/ContentItem.js:169:15
     return true
   }
 
-  toConfig () {
-    const res = {
-      type: this.config.type,
-      size: this.size,
-      minWidth: this.minWidth,
-      minHeight: this.minHeight
-    }
-    if (this.id) res.id = this.id
-    if (this.children.length > 0) {
-      res.content = this.children.map(c => c.toConfig())
-    }
-    return res
-  }
+  toConfig () {}
 }
 
killedBy: StackItem serializes to correct config
statusReason: TypeError: Cannot set properties of undefined (setting 'activeChildIndex')

[Killed] ConditionalExpression
src/core/ContentItem.js:176:9
       minWidth: this.minWidth,
       minHeight: this.minHeight
     }
-    if (this.id) res.id = this.id
+    if (false) res.id = this.id
     if (this.children.length > 0) {
       res.content = this.children.map(c => c.toConfig())
killedBy: StackItem serializes to correct config
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-stack"
Received: undefined

[Survived] ConditionalExpression
src/core/ContentItem.js:176:9
       minWidth: this.minWidth,
       minHeight: this.minHeight
     }
-    if (this.id) res.id = this.id
+    if (true) res.id = this.id
     if (this.children.length > 0) {
       res.content = this.children.map(c => c.toConfig())
