[Survived] ConditionalExpression
src/core/ContentItem.js:177:9
       minHeight: this.minHeight
     }
     if (this.id) res.id = this.id
-    if (this.children.length > 0) {
+    if (true) {
       res.content = this.children.map(c => c.toConfig())
     }

[Survived] ConditionalExpression
src/core/ContentItem.js:177:9
       minHeight: this.minHeight
     }
     if (this.id) res.id = this.id
-    if (this.children.length > 0) {
+    if (false) {
       res.content = this.children.map(c => c.toConfig())
     }

[Survived] ArrowFunction
src/core/ContentItem.js:178:39
     }
     if (this.id) res.id = this.id
     if (this.children.length > 0) {
-      res.content = this.children.map(c => c.toConfig())
+      res.content = this.children.map(() => undefined)
     }
     return res
