[Killed] BlockStatement
src/core/StackItem.js:5:39
 import { Utils } from '../utils/Utils.js'
 
 export class StackItem extends ContentItem {
-  constructor (config, layoutManager) {
-    super(config, layoutManager)
-    this.type = 'stack'
-    this.activeChildIndex = 0
-    this.isMaximized = false
-    this.controlsEl = null
-    // isMinimized is initialized in createDOM which is called by the super constructor
-    this.hiddenTabs = []
-    this._onDocumentClick = this._onDocumentClick.bind(this)
-  }
+  constructor (config, layoutManager) {}
 
   createDOM () {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
src/core/StackItem.js:7:17
 export class StackItem extends ContentItem {
   constructor (config, layoutManager) {
     super(config, layoutManager)
-    this.type = 'stack'
+    this.type = ""
     this.activeChildIndex = 0
     this.isMaximized = false
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BooleanLiteral
src/core/StackItem.js:9:24
     super(config, layoutManager)
     this.type = 'stack'
     this.activeChildIndex = 0
-    this.isMaximized = false
+    this.isMaximized = true
     this.controlsEl = null
     // isMinimized is initialized in createDOM which is called by the super constructor
killedBy: PopoutManager Unit Tests state restores correctly after popout closes (was normal)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/core/StackItem.js:17:24
   }
 
   createDOM () {
-    this.tabPosition = this.config.tabPosition || 'top'
+    this.tabPosition = this.config.tabPosition && 'top'
     this.isMinimized = !!this.config.minimized
     this.isMaximized = !!this.config.isMaximized
killedBy: StackItem updateOverflow detects vertical overflow for side positions
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] ConditionalExpression
src/core/StackItem.js:17:24
   }
 
   createDOM () {
-    this.tabPosition = this.config.tabPosition || 'top'
+    this.tabPosition = false
     this.isMinimized = !!this.config.minimized
     this.isMaximized = !!this.config.isMaximized
killedBy: StackItem updateOverflow detects vertical overflow for side positions
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] BooleanLiteral
src/core/StackItem.js:18:25
 
   createDOM () {
     this.tabPosition = this.config.tabPosition || 'top'
-    this.isMinimized = !!this.config.minimized
+    this.isMinimized = !this.config.minimized
     this.isMaximized = !!this.config.isMaximized
 
killedBy: PopoutManager Unit Tests popped-out stack is always maximized even when previously minimized
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BooleanLiteral
src/core/StackItem.js:19:25
   createDOM () {
     this.tabPosition = this.config.tabPosition || 'top'
     this.isMinimized = !!this.config.minimized
-    this.isMaximized = !!this.config.isMaximized
+    this.isMaximized = !this.config.isMaximized
 
     // Per-stack control button visibility

[Survived] ConditionalExpression
src/core/StackItem.js:22:34
     this.isMaximized = !!this.config.isMaximized
 
     // Per-stack control button visibility
-    this.displayMinimizeButton = this.config.displayMinimizeButton !== false
+    this.displayMinimizeButton = true
     this.displayMaximizeButton = this.config.displayMaximizeButton !== false
     this.displayCloseButton = this.config.displayCloseButton !== false

[Survived] ConditionalExpression
src/core/StackItem.js:22:34
     this.isMaximized = !!this.config.isMaximized
 
     // Per-stack control button visibility
-    this.displayMinimizeButton = this.config.displayMinimizeButton !== false
+    this.displayMinimizeButton = false
     this.displayMaximizeButton = this.config.displayMaximizeButton !== false
     this.displayCloseButton = this.config.displayCloseButton !== false

[Survived] ConditionalExpression
src/core/StackItem.js:23:34
 
     // Per-stack control button visibility
     this.displayMinimizeButton = this.config.displayMinimizeButton !== false
-    this.displayMaximizeButton = this.config.displayMaximizeButton !== false
+    this.displayMaximizeButton = true
     this.displayCloseButton = this.config.displayCloseButton !== false
     this.displayPopoutButton = this.config.displayPopoutButton !== false

[Survived] ConditionalExpression
src/core/StackItem.js:23:34
 
     // Per-stack control button visibility
     this.displayMinimizeButton = this.config.displayMinimizeButton !== false
-    this.displayMaximizeButton = this.config.displayMaximizeButton !== false
+    this.displayMaximizeButton = false
     this.displayCloseButton = this.config.displayCloseButton !== false
     this.displayPopoutButton = this.config.displayPopoutButton !== false

[Survived] ConditionalExpression
src/core/StackItem.js:24:31
     // Per-stack control button visibility
     this.displayMinimizeButton = this.config.displayMinimizeButton !== false
     this.displayMaximizeButton = this.config.displayMaximizeButton !== false
-    this.displayCloseButton = this.config.displayCloseButton !== false
+    this.displayCloseButton = false
     this.displayPopoutButton = this.config.displayPopoutButton !== false
     this.preventEmptyClosure = !!this.config.preventEmptyClosure

[Survived] ConditionalExpression
src/core/StackItem.js:24:31
     // Per-stack control button visibility
     this.displayMinimizeButton = this.config.displayMinimizeButton !== false
     this.displayMaximizeButton = this.config.displayMaximizeButton !== false
-    this.displayCloseButton = this.config.displayCloseButton !== false
+    this.displayCloseButton = true
     this.displayPopoutButton = this.config.displayPopoutButton !== false
     this.preventEmptyClosure = !!this.config.preventEmptyClosure

[Survived] ConditionalExpression
src/core/StackItem.js:25:32
     this.displayMinimizeButton = this.config.displayMinimizeButton !== false
     this.displayMaximizeButton = this.config.displayMaximizeButton !== false
     this.displayCloseButton = this.config.displayCloseButton !== false
-    this.displayPopoutButton = this.config.displayPopoutButton !== false
+    this.displayPopoutButton = false
     this.preventEmptyClosure = !!this.config.preventEmptyClosure
 

[Survived] ConditionalExpression
src/core/StackItem.js:25:32
     this.displayMinimizeButton = this.config.displayMinimizeButton !== false
     this.displayMaximizeButton = this.config.displayMaximizeButton !== false
     this.displayCloseButton = this.config.displayCloseButton !== false
-    this.displayPopoutButton = this.config.displayPopoutButton !== false
+    this.displayPopoutButton = true
     this.preventEmptyClosure = !!this.config.preventEmptyClosure
 

[Survived] BooleanLiteral
src/core/StackItem.js:26:33
     this.displayMaximizeButton = this.config.displayMaximizeButton !== false
     this.displayCloseButton = this.config.displayCloseButton !== false
     this.displayPopoutButton = this.config.displayPopoutButton !== false
-    this.preventEmptyClosure = !!this.config.preventEmptyClosure
+    this.preventEmptyClosure = !this.config.preventEmptyClosure
 
     this.element = document.createElement('div')

[Survived] ConditionalExpression
src/core/StackItem.js:30:9
 
     this.element = document.createElement('div')
     this.element.className = 'tulweb-stack'
-    if (this.preventEmptyClosure) this.element.setAttribute('data-persistent', 'true')
+    if (false) this.element.setAttribute('data-persistent', 'true')
     if (this.isMinimized) this.element.classList.add('minimized')
     if (this.isMaximized) this.element.classList.add('maximized')

[Survived] ConditionalExpression
src/core/StackItem.js:30:9
 
     this.element = document.createElement('div')
     this.element.className = 'tulweb-stack'
-    if (this.preventEmptyClosure) this.element.setAttribute('data-persistent', 'true')
+    if (true) this.element.setAttribute('data-persistent', 'true')
     if (this.isMinimized) this.element.classList.add('minimized')
     if (this.isMaximized) this.element.classList.add('maximized')

[Survived] ConditionalExpression
src/core/StackItem.js:31:9
     this.element = document.createElement('div')
     this.element.className = 'tulweb-stack'
     if (this.preventEmptyClosure) this.element.setAttribute('data-persistent', 'true')
-    if (this.isMinimized) this.element.classList.add('minimized')
+    if (true) this.element.classList.add('minimized')
     if (this.isMaximized) this.element.classList.add('maximized')
 

[Survived] ConditionalExpression
src/core/StackItem.js:31:9
     this.element = document.createElement('div')
     this.element.className = 'tulweb-stack'
     if (this.preventEmptyClosure) this.element.setAttribute('data-persistent', 'true')
-    if (this.isMinimized) this.element.classList.add('minimized')
+    if (false) this.element.classList.add('minimized')
     if (this.isMaximized) this.element.classList.add('maximized')
 

[Survived] ConditionalExpression
src/core/StackItem.js:32:9
     this.element.className = 'tulweb-stack'
     if (this.preventEmptyClosure) this.element.setAttribute('data-persistent', 'true')
     if (this.isMinimized) this.element.classList.add('minimized')
-    if (this.isMaximized) this.element.classList.add('maximized')
+    if (true) this.element.classList.add('maximized')
 
     if (this.tabPosition && this.tabPosition !== 'top') {

[Survived] ConditionalExpression
src/core/StackItem.js:32:9
     this.element.className = 'tulweb-stack'
     if (this.preventEmptyClosure) this.element.setAttribute('data-persistent', 'true')
     if (this.isMinimized) this.element.classList.add('minimized')
-    if (this.isMaximized) this.element.classList.add('maximized')
+    if (false) this.element.classList.add('maximized')
 
     if (this.tabPosition && this.tabPosition !== 'top') {

[Survived] LogicalOperator
src/core/StackItem.js:34:9
     if (this.isMinimized) this.element.classList.add('minimized')
     if (this.isMaximized) this.element.classList.add('maximized')
 
-    if (this.tabPosition && this.tabPosition !== 'top') {
+    if (this.tabPosition || this.tabPosition !== 'top') {
       this.element.classList.add('tab-' + this.tabPosition)
     }

[Survived] EqualityOperator
src/core/StackItem.js:34:29
     if (this.isMinimized) this.element.classList.add('minimized')
     if (this.isMaximized) this.element.classList.add('maximized')
 
-    if (this.tabPosition && this.tabPosition !== 'top') {
+    if (this.tabPosition && this.tabPosition === 'top') {
       this.element.classList.add('tab-' + this.tabPosition)
     }

[NoCoverage] BlockStatement
src/core/StackItem.js:38:54
       this.element.classList.add('tab-' + this.tabPosition)
     }
 
-    this.element.addEventListener('mousedown', () => {
-      this.layoutManager.setActiveStack(this)
-    })
+    this.element.addEventListener('mousedown', () => {})
 
     this.headerEl = Utils.createElement('div', 'tulweb-header', this.element)

[Killed] StringLiteral
src/core/StackItem.js:42:41
       this.layoutManager.setActiveStack(this)
     })
 
-    this.headerEl = Utils.createElement('div', 'tulweb-header', this.element)
+    this.headerEl = Utils.createElement("", 'tulweb-header', this.element)
     this.tabsEl = Utils.createElement('div', 'tulweb-tabs', this.headerEl)
     this.tabsEl.setAttribute('role', 'tablist')
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: InvalidCharacterError: "" did not match the Name production

[Survived] StringLiteral
src/core/StackItem.js:44:38
 
     this.headerEl = Utils.createElement('div', 'tulweb-header', this.element)
     this.tabsEl = Utils.createElement('div', 'tulweb-tabs', this.headerEl)
-    this.tabsEl.setAttribute('role', 'tablist')
+    this.tabsEl.setAttribute('role', "")
     this.tabsEl.setAttribute('aria-label', 'Layout Stacks')
 

[Survived] BooleanLiteral
src/core/StackItem.js:47:23
     this.tabsEl.setAttribute('role', 'tablist')
     this.tabsEl.setAttribute('aria-label', 'Layout Stacks')
 
-    const isPopout = !!this.config.isPopoutChild
+    const isPopout = !this.config.isPopoutChild
     const showMin = this.displayMinimizeButton && this.layoutManager.settings.enableMinimize !== false && !isPopout
     const showMax = this.displayMaximizeButton && !isPopout

[Survived] EqualityOperator
src/core/StackItem.js:48:51
     this.tabsEl.setAttribute('aria-label', 'Layout Stacks')
 
     const isPopout = !!this.config.isPopoutChild
-    const showMin = this.displayMinimizeButton && this.layoutManager.settings.enableMinimize !== false && !isPopout
+    const showMin = this.displayMinimizeButton && this.layoutManager.settings.enableMinimize === false && !isPopout
     const showMax = this.displayMaximizeButton && !isPopout
     const showClose = this.displayCloseButton && !isPopout

[Survived] BooleanLiteral
src/core/StackItem.js:48:98
     this.tabsEl.setAttribute('aria-label', 'Layout Stacks')
 
     const isPopout = !!this.config.isPopoutChild
-    const showMin = this.displayMinimizeButton && this.layoutManager.settings.enableMinimize !== false && !isPopout
+    const showMin = this.displayMinimizeButton && this.layoutManager.settings.enableMinimize !== true && !isPopout
     const showMax = this.displayMaximizeButton && !isPopout
     const showClose = this.displayCloseButton && !isPopout

[Survived] BooleanLiteral
src/core/StackItem.js:49:51
 
     const isPopout = !!this.config.isPopoutChild
     const showMin = this.displayMinimizeButton && this.layoutManager.settings.enableMinimize !== false && !isPopout
-    const showMax = this.displayMaximizeButton && !isPopout
+    const showMax = this.displayMaximizeButton && isPopout
     const showClose = this.displayCloseButton && !isPopout
     const showPopout = this.displayPopoutButton && this.layoutManager.settings.enablePopout === true

[Survived] ConditionalExpression
src/core/StackItem.js:49:21
 
     const isPopout = !!this.config.isPopoutChild
     const showMin = this.displayMinimizeButton && this.layoutManager.settings.enableMinimize !== false && !isPopout
-    const showMax = this.displayMaximizeButton && !isPopout
+    const showMax = true
     const showClose = this.displayCloseButton && !isPopout
     const showPopout = this.displayPopoutButton && this.layoutManager.settings.enablePopout === true

[Survived] LogicalOperator
src/core/StackItem.js:50:23
     const isPopout = !!this.config.isPopoutChild
     const showMin = this.displayMinimizeButton && this.layoutManager.settings.enableMinimize !== false && !isPopout
     const showMax = this.displayMaximizeButton && !isPopout
-    const showClose = this.displayCloseButton && !isPopout
+    const showClose = this.displayCloseButton || !isPopout
     const showPopout = this.displayPopoutButton && this.layoutManager.settings.enablePopout === true
 

[Survived] ConditionalExpression
src/core/StackItem.js:50:23
     const isPopout = !!this.config.isPopoutChild
     const showMin = this.displayMinimizeButton && this.layoutManager.settings.enableMinimize !== false && !isPopout
     const showMax = this.displayMaximizeButton && !isPopout
-    const showClose = this.displayCloseButton && !isPopout
+    const showClose = false
     const showPopout = this.displayPopoutButton && this.layoutManager.settings.enablePopout === true
 

[Survived] EqualityOperator
src/core/StackItem.js:51:52
     const showMin = this.displayMinimizeButton && this.layoutManager.settings.enableMinimize !== false && !isPopout
     const showMax = this.displayMaximizeButton && !isPopout
     const showClose = this.displayCloseButton && !isPopout
-    const showPopout = this.displayPopoutButton && this.layoutManager.settings.enablePopout === true
+    const showPopout = this.displayPopoutButton && this.layoutManager.settings.enablePopout !== true
 
     if (showMin || showMax || showClose || showPopout) {

[Survived] BooleanLiteral
src/core/StackItem.js:51:97
     const showMin = this.displayMinimizeButton && this.layoutManager.settings.enableMinimize !== false && !isPopout
     const showMax = this.displayMaximizeButton && !isPopout
     const showClose = this.displayCloseButton && !isPopout
-    const showPopout = this.displayPopoutButton && this.layoutManager.settings.enablePopout === true
+    const showPopout = this.displayPopoutButton && this.layoutManager.settings.enablePopout === false
 
     if (showMin || showMax || showClose || showPopout) {

[Survived] ConditionalExpression
src/core/StackItem.js:53:9
     const showClose = this.displayCloseButton && !isPopout
     const showPopout = this.displayPopoutButton && this.layoutManager.settings.enablePopout === true
 
-    if (showMin || showMax || showClose || showPopout) {
+    if (true) {
       this.controlsEl = Utils.createElement('div', 'tulweb-header-controls', this.headerEl)
 

[Survived] LogicalOperator
src/core/StackItem.js:53:9
     const showClose = this.displayCloseButton && !isPopout
     const showPopout = this.displayPopoutButton && this.layoutManager.settings.enablePopout === true
 
-    if (showMin || showMax || showClose || showPopout) {
+    if (showMin && showMax || showClose || showPopout) {
       this.controlsEl = Utils.createElement('div', 'tulweb-header-controls', this.headerEl)
 

[Killed] StringLiteral
src/core/StackItem.js:54:45
     const showPopout = this.displayPopoutButton && this.layoutManager.settings.enablePopout === true
 
     if (showMin || showMax || showClose || showPopout) {
-      this.controlsEl = Utils.createElement('div', 'tulweb-header-controls', this.headerEl)
+      this.controlsEl = Utils.createElement("", 'tulweb-header-controls', this.headerEl)
 
       if (showPopout) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: InvalidCharacterError: "" did not match the Name production

[Survived] StringLiteral
src/core/StackItem.js:54:52
     const showPopout = this.displayPopoutButton && this.layoutManager.settings.enablePopout === true
 
     if (showMin || showMax || showClose || showPopout) {
-      this.controlsEl = Utils.createElement('div', 'tulweb-header-controls', this.headerEl)
+      this.controlsEl = Utils.createElement('div', "", this.headerEl)
 
       if (showPopout) {

[Survived] ConditionalExpression
src/core/StackItem.js:56:11
     if (showMin || showMax || showClose || showPopout) {
       this.controlsEl = Utils.createElement('div', 'tulweb-header-controls', this.headerEl)
 
-      if (showPopout) {
+      if (true) {
         this.popoutBtn = Utils.createElement('div', 'tulweb-control tulweb-popout-btn', this.controlsEl)

[Survived] ConditionalExpression
src/core/StackItem.js:56:11
     if (showMin || showMax || showClose || showPopout) {
       this.controlsEl = Utils.createElement('div', 'tulweb-header-controls', this.headerEl)
 
-      if (showPopout) {
+      if (false) {
         this.popoutBtn = Utils.createElement('div', 'tulweb-control tulweb-popout-btn', this.controlsEl)

[Survived] StringLiteral
src/core/StackItem.js:59:32
       if (showPopout) {
         this.popoutBtn = Utils.createElement('div', 'tulweb-control tulweb-popout-btn', this.controlsEl)
-        this.popoutBtn.title = 'Pop out to new window'
+        this.popoutBtn.title = ""
         this.popoutBtn.addEventListener('click', (e) => {
           e.stopPropagation()

[NoCoverage] BlockStatement
src/core/StackItem.js:60:57
         this.popoutBtn = Utils.createElement('div', 'tulweb-control tulweb-popout-btn', this.controlsEl)
         this.popoutBtn.title = 'Pop out to new window'
-        this.popoutBtn.addEventListener('click', (e) => {
-          e.stopPropagation()
-          this.layoutManager.popoutStack(this)
-        })
+        this.popoutBtn.addEventListener('click', (e) => {})
       }
 

[Survived] BlockStatement
src/core/StackItem.js:66:20
         })
       }
 
-      if (showMin) {
-        this.minBtn = Utils.createElement('div', 'tulweb-control tulweb-min-btn', this.controlsEl)
-        this.minBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M6 19h12v2H6z"/></svg>'
-        this.minBtn.addEventListener('click', (e) => {
-          e.stopPropagation()
-          this.toggleMinimize()
-        })
-      }
+      if (showMin) {}
 
       // Maximize button

[Survived] ConditionalExpression
src/core/StackItem.js:66:11
         })
       }
 
-      if (showMin) {
+      if (true) {
         this.minBtn = Utils.createElement('div', 'tulweb-control tulweb-min-btn', this.controlsEl)
         this.minBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M6 19h12v2H6z"/></svg>'

[Killed] StringLiteral
src/core/StackItem.js:67:43
       }
 
       if (showMin) {
-        this.minBtn = Utils.createElement('div', 'tulweb-control tulweb-min-btn', this.controlsEl)
+        this.minBtn = Utils.createElement("", 'tulweb-control tulweb-min-btn', this.controlsEl)
         this.minBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M6 19h12v2H6z"/></svg>'
         this.minBtn.addEventListener('click', (e) => {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: InvalidCharacterError: "" did not match the Name production

[NoCoverage] BlockStatement
src/core/StackItem.js:69:54
       if (showMin) {
         this.minBtn = Utils.createElement('div', 'tulweb-control tulweb-min-btn', this.controlsEl)
         this.minBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M6 19h12v2H6z"/></svg>'
-        this.minBtn.addEventListener('click', (e) => {
-          e.stopPropagation()
-          this.toggleMinimize()
-        })
+        this.minBtn.addEventListener('click', (e) => {})
       }
 

[Survived] StringLiteral
src/core/StackItem.js:69:38
       if (showMin) {
         this.minBtn = Utils.createElement('div', 'tulweb-control tulweb-min-btn', this.controlsEl)
         this.minBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M6 19h12v2H6z"/></svg>'
-        this.minBtn.addEventListener('click', (e) => {
+        this.minBtn.addEventListener("", (e) => {
           e.stopPropagation()
           this.toggleMinimize()

[Survived] ConditionalExpression
src/core/StackItem.js:76:11
       }
 
       // Maximize button
-      if (showMax) {
+      if (true) {
         this.maxBtn = Utils.createElement('div', 'tulweb-control tulweb-max-btn', this.controlsEl)
         this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'

[Survived] BlockStatement
src/core/StackItem.js:76:20
       }
 
       // Maximize button
-      if (showMax) {
-        this.maxBtn = Utils.createElement('div', 'tulweb-control tulweb-max-btn', this.controlsEl)
-        this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
-        this.maxBtn.addEventListener('click', () => this.toggleMaximize())
-      }
+      if (showMax) {}
 
       // Close Stack Button

[Killed] StringLiteral
src/core/StackItem.js:77:43
 
       // Maximize button
       if (showMax) {
-        this.maxBtn = Utils.createElement('div', 'tulweb-control tulweb-max-btn', this.controlsEl)
+        this.maxBtn = Utils.createElement("", 'tulweb-control tulweb-max-btn', this.controlsEl)
         this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
         this.maxBtn.addEventListener('click', () => this.toggleMaximize())
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: InvalidCharacterError: "" did not match the Name production

[Survived] ArrowFunction
src/core/StackItem.js:79:47
       if (showMax) {
         this.maxBtn = Utils.createElement('div', 'tulweb-control tulweb-max-btn', this.controlsEl)
         this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
-        this.maxBtn.addEventListener('click', () => this.toggleMaximize())
+        this.maxBtn.addEventListener('click', () => undefined)
       }
 

[Survived] ConditionalExpression
src/core/StackItem.js:83:11
       }
 
       // Close Stack Button
-      if (showClose) {
+      if (true) {
         this.closeBtn = Utils.createElement('div', 'tulweb-control tulweb-close-btn', this.controlsEl)
         this.closeBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M19 6.41L17.59 5 12 10.59 6.41 5 5 6.41 10.59 12 5 17.59 6.41 19 12 13.41 17.59 19 19 17.59 13.41 12 19 6.41z"/></svg>'

[Survived] ConditionalExpression
src/core/StackItem.js:83:11
       }
 
       // Close Stack Button
-      if (showClose) {
+      if (false) {
         this.closeBtn = Utils.createElement('div', 'tulweb-control tulweb-close-btn', this.controlsEl)
         this.closeBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M19 6.41L17.59 5 12 10.59 6.41 5 5 6.41 10.59 12 5 17.59 6.41 19 12 13.41 17.59 19 19 17.59 13.41 12 19 6.41z"/></svg>'

[Survived] StringLiteral
src/core/StackItem.js:85:35
       // Close Stack Button
       if (showClose) {
         this.closeBtn = Utils.createElement('div', 'tulweb-control tulweb-close-btn', this.controlsEl)
-        this.closeBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M19 6.41L17.59 5 12 10.59 6.41 5 5 6.41 10.59 12 5 17.59 6.41 19 12 13.41 17.59 19 19 17.59 13.41 12 19 6.41z"/></svg>'
+        this.closeBtn.innerHTML = ""
         this.closeBtn.addEventListener('click', () => {
           this.closeAll()

[NoCoverage] BlockStatement
src/core/StackItem.js:86:55
       if (showClose) {
         this.closeBtn = Utils.createElement('div', 'tulweb-control tulweb-close-btn', this.controlsEl)
         this.closeBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M19 6.41L17.59 5 12 10.59 6.41 5 5 6.41 10.59 12 5 17.59 6.41 19 12 13.41 17.59 19 19 17.59 13.41 12 19 6.41z"/></svg>'
-        this.closeBtn.addEventListener('click', () => {
-          this.closeAll()
-          if (this.children.length === 0) {
-            this.destroy()
-          }
-        })
+        this.closeBtn.addEventListener('click', () => {})
       }
     }

[NoCoverage] BlockStatement
src/core/StackItem.js:88:43
         this.closeBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M19 6.41L17.59 5 12 10.59 6.41 5 5 6.41 10.59 12 5 17.59 6.41 19 12 13.41 17.59 19 19 17.59 13.41 12 19 6.41z"/></svg>'
         this.closeBtn.addEventListener('click', () => {
           this.closeAll()
-          if (this.children.length === 0) {
-            this.destroy()
-          }
+          if (this.children.length === 0) {}
         })
       }

[NoCoverage] ConditionalExpression
src/core/StackItem.js:88:15
         this.closeBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M19 6.41L17.59 5 12 10.59 6.41 5 5 6.41 10.59 12 5 17.59 6.41 19 12 13.41 17.59 19 19 17.59 13.41 12 19 6.41z"/></svg>'
         this.closeBtn.addEventListener('click', () => {
           this.closeAll()
-          if (this.children.length === 0) {
+          if (false) {
             this.destroy()
           }

[NoCoverage] BlockStatement
src/core/StackItem.js:99:52
     this.contentAreaEl.setAttribute('role', 'tabpanel')
     this.contentAreaEl.id = 'panel-' + this.id
 
-    if (this.layoutManager.settings.enablePreview) {
-      this.element.addEventListener('mouseenter', () => {
-        if (this.isMinimized) this.element.classList.add('previewing')
-      })
-      this.element.addEventListener('mouseleave', () => {
-        if (this.isMinimized) this.element.classList.remove('previewing')
-      })
-    }
+    if (this.layoutManager.settings.enablePreview) {}
 
     if (window.ResizeObserver) {

[Survived] ConditionalExpression
src/core/StackItem.js:99:9
     this.contentAreaEl.setAttribute('role', 'tabpanel')
     this.contentAreaEl.id = 'panel-' + this.id
 
-    if (this.layoutManager.settings.enablePreview) {
+    if (true) {
       this.element.addEventListener('mouseenter', () => {
         if (this.isMinimized) this.element.classList.add('previewing')

[NoCoverage] BlockStatement
src/core/StackItem.js:100:57
     this.contentAreaEl.id = 'panel-' + this.id
 
     if (this.layoutManager.settings.enablePreview) {
-      this.element.addEventListener('mouseenter', () => {
-        if (this.isMinimized) this.element.classList.add('previewing')
-      })
+      this.element.addEventListener('mouseenter', () => {})
       this.element.addEventListener('mouseleave', () => {
         if (this.isMinimized) this.element.classList.remove('previewing')

[NoCoverage] StringLiteral
src/core/StackItem.js:100:37
     this.contentAreaEl.id = 'panel-' + this.id
 
     if (this.layoutManager.settings.enablePreview) {
-      this.element.addEventListener('mouseenter', () => {
+      this.element.addEventListener("", () => {
         if (this.isMinimized) this.element.classList.add('previewing')
       })

[NoCoverage] ConditionalExpression
src/core/StackItem.js:101:13
 
     if (this.layoutManager.settings.enablePreview) {
       this.element.addEventListener('mouseenter', () => {
-        if (this.isMinimized) this.element.classList.add('previewing')
+        if (true) this.element.classList.add('previewing')
       })
       this.element.addEventListener('mouseleave', () => {
