[NoCoverage] ConditionalExpression
src/core/StackItem.js:101:13
 
     if (this.layoutManager.settings.enablePreview) {
       this.element.addEventListener('mouseenter', () => {
-        if (this.isMinimized) this.element.classList.add('previewing')
+        if (false) this.element.classList.add('previewing')
       })
       this.element.addEventListener('mouseleave', () => {

[NoCoverage] BlockStatement
src/core/StackItem.js:103:57
       this.element.addEventListener('mouseenter', () => {
         if (this.isMinimized) this.element.classList.add('previewing')
       })
-      this.element.addEventListener('mouseleave', () => {
-        if (this.isMinimized) this.element.classList.remove('previewing')
-      })
+      this.element.addEventListener('mouseleave', () => {})
     }
 

[NoCoverage] ConditionalExpression
src/core/StackItem.js:104:13
         if (this.isMinimized) this.element.classList.add('previewing')
       })
       this.element.addEventListener('mouseleave', () => {
-        if (this.isMinimized) this.element.classList.remove('previewing')
+        if (true) this.element.classList.remove('previewing')
       })
     }

[NoCoverage] ConditionalExpression
src/core/StackItem.js:104:13
         if (this.isMinimized) this.element.classList.add('previewing')
       })
       this.element.addEventListener('mouseleave', () => {
-        if (this.isMinimized) this.element.classList.remove('previewing')
+        if (false) this.element.classList.remove('previewing')
       })
     }

[Killed] ConditionalExpression
src/core/StackItem.js:108:9
       })
     }
 
-    if (window.ResizeObserver) {
+    if (true) {
       this.resizeObserver = new ResizeObserver(() => {
         requestAnimationFrame(() => {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: ReferenceError: ResizeObserver is not defined

[Survived] ConditionalExpression
src/core/StackItem.js:108:9
       })
     }
 
-    if (window.ResizeObserver) {
+    if (false) {
       this.resizeObserver = new ResizeObserver(() => {
         requestAnimationFrame(() => {

[NoCoverage] BlockStatement
src/core/StackItem.js:109:54
     }
 
     if (window.ResizeObserver) {
-      this.resizeObserver = new ResizeObserver(() => {
-        requestAnimationFrame(() => {
-          if (this.children && this.children.length > 0) this.updateOverflow()
-        })
-      })
+      this.resizeObserver = new ResizeObserver(() => {})
       this.resizeObserver.observe(this.headerEl)
     }

[NoCoverage] BlockStatement
src/core/StackItem.js:110:37
 
     if (window.ResizeObserver) {
       this.resizeObserver = new ResizeObserver(() => {
-        requestAnimationFrame(() => {
-          if (this.children && this.children.length > 0) this.updateOverflow()
-        })
+        requestAnimationFrame(() => {})
       })
       this.resizeObserver.observe(this.headerEl)

[NoCoverage] ConditionalExpression
src/core/StackItem.js:111:15
     if (window.ResizeObserver) {
       this.resizeObserver = new ResizeObserver(() => {
         requestAnimationFrame(() => {
-          if (this.children && this.children.length > 0) this.updateOverflow()
+          if (true) this.updateOverflow()
         })
       })

[NoCoverage] ConditionalExpression
src/core/StackItem.js:111:32
     if (window.ResizeObserver) {
       this.resizeObserver = new ResizeObserver(() => {
         requestAnimationFrame(() => {
-          if (this.children && this.children.length > 0) this.updateOverflow()
+          if (this.children && true) this.updateOverflow()
         })
       })

[Survived] BlockStatement
src/core/StackItem.js:118:14
     }
   }
 
-  destroy () {
-    if (this.resizeObserver) {
-      this.resizeObserver.disconnect()
-    }
-    document.removeEventListener('mousedown', this._onDocumentClick)
-    super.destroy()
-  }
+  destroy () {}
 
   removeChild (child) {

[Killed] ConditionalExpression
src/core/StackItem.js:119:9
   }
 
   destroy () {
-    if (this.resizeObserver) {
+    if (true) {
       this.resizeObserver.disconnect()
     }
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'disconnect')

[Survived] ConditionalExpression
src/core/StackItem.js:119:9
   }
 
   destroy () {
-    if (this.resizeObserver) {
+    if (false) {
       this.resizeObserver.disconnect()
     }

[Killed] BlockStatement
src/core/StackItem.js:126:23
     super.destroy()
   }
 
-  removeChild (child) {
-    const index = this.children.indexOf(child)
-
-    if (super.removeChild(child)) {
-      if (this.children.length === 0) {
-        this.activeChildIndex = 0
-      } else if (index < this.activeChildIndex) {
-        this.activeChildIndex--
-      } else if (index === this.activeChildIndex) {
-        this.activeChildIndex = Math.min(this.activeChildIndex, this.children.length - 1)
-      }
-
-      // Re-render is handled by ContentItem calling updateLayout()
-      // which is overridden in StackItem to call renderTabs()
-      return true
-    }
-    return false
-  }
+  removeChild (child) {}
 
   _appendDOMChild (child, index) {
killedBy: StackItem adds and removes component children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BlockStatement
src/core/StackItem.js:129:35
   removeChild (child) {
     const index = this.children.indexOf(child)
 
-    if (super.removeChild(child)) {
-      if (this.children.length === 0) {
-        this.activeChildIndex = 0
-      } else if (index < this.activeChildIndex) {
-        this.activeChildIndex--
-      } else if (index === this.activeChildIndex) {
-        this.activeChildIndex = Math.min(this.activeChildIndex, this.children.length - 1)
-      }
-
-      // Re-render is handled by ContentItem calling updateLayout()
-      // which is overridden in StackItem to call renderTabs()
-      return true
-    }
+    if (super.removeChild(child)) {}
     return false
   }
killedBy: StackItem activeChildIndex updates on child removal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
src/core/StackItem.js:129:9
   removeChild (child) {
     const index = this.children.indexOf(child)
 
-    if (super.removeChild(child)) {
+    if (true) {
       if (this.children.length === 0) {
         this.activeChildIndex = 0
killedBy: StackItem adds and removes component children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] EqualityOperator
src/core/StackItem.js:130:11
     const index = this.children.indexOf(child)
 
     if (super.removeChild(child)) {
-      if (this.children.length === 0) {
+      if (this.children.length !== 0) {
         this.activeChildIndex = 0
       } else if (index < this.activeChildIndex) {
killedBy: StackItem activeChildIndex updates on child removal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/core/StackItem.js:130:11
     const index = this.children.indexOf(child)
 
     if (super.removeChild(child)) {
-      if (this.children.length === 0) {
+      if (true) {
         this.activeChildIndex = 0
       } else if (index < this.activeChildIndex) {
killedBy: StackItem activeChildIndex updates on child removal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] BlockStatement
src/core/StackItem.js:132:49
     if (super.removeChild(child)) {
       if (this.children.length === 0) {
         this.activeChildIndex = 0
-      } else if (index < this.activeChildIndex) {
-        this.activeChildIndex--
-      } else if (index === this.activeChildIndex) {
+      } else if (index < this.activeChildIndex) {} else if (index === this.activeChildIndex) {
         this.activeChildIndex = Math.min(this.activeChildIndex, this.children.length - 1)
       }

[Survived] EqualityOperator
src/core/StackItem.js:132:18
     if (super.removeChild(child)) {
       if (this.children.length === 0) {
         this.activeChildIndex = 0
-      } else if (index < this.activeChildIndex) {
+      } else if (index <= this.activeChildIndex) {
         this.activeChildIndex--
       } else if (index === this.activeChildIndex) {

[Survived] UpdateOperator
src/core/StackItem.js:133:9
       if (this.children.length === 0) {
         this.activeChildIndex = 0
       } else if (index < this.activeChildIndex) {
-        this.activeChildIndex--
+        this.activeChildIndex++
       } else if (index === this.activeChildIndex) {
         this.activeChildIndex = Math.min(this.activeChildIndex, this.children.length - 1)

[Killed] ConditionalExpression
src/core/StackItem.js:134:18
         this.activeChildIndex = 0
       } else if (index < this.activeChildIndex) {
         this.activeChildIndex--
-      } else if (index === this.activeChildIndex) {
+      } else if (false) {
         this.activeChildIndex = Math.min(this.activeChildIndex, this.children.length - 1)
       }
killedBy: StackItem activeChildIndex updates on child removal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BlockStatement
src/core/StackItem.js:134:51
         this.activeChildIndex = 0
       } else if (index < this.activeChildIndex) {
         this.activeChildIndex--
-      } else if (index === this.activeChildIndex) {
-        this.activeChildIndex = Math.min(this.activeChildIndex, this.children.length - 1)
-      }
+      } else if (index === this.activeChildIndex) {}
 
       // Re-render is handled by ContentItem calling updateLayout()
killedBy: StackItem activeChildIndex updates on child removal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ArithmeticOperator
src/core/StackItem.js:135:65
       } else if (index < this.activeChildIndex) {
         this.activeChildIndex--
       } else if (index === this.activeChildIndex) {
-        this.activeChildIndex = Math.min(this.activeChildIndex, this.children.length - 1)
+        this.activeChildIndex = Math.min(this.activeChildIndex, this.children.length + 1)
       }
 
killedBy: StackItem activeChildIndex updates on child removal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] MethodExpression
src/core/StackItem.js:135:33
       } else if (index < this.activeChildIndex) {
         this.activeChildIndex--
       } else if (index === this.activeChildIndex) {
-        this.activeChildIndex = Math.min(this.activeChildIndex, this.children.length - 1)
+        this.activeChildIndex = Math.max(this.activeChildIndex, this.children.length - 1)
       }
 
killedBy: StackItem activeChildIndex updates on child removal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Survived] BooleanLiteral
src/core/StackItem.js:140:14
 
       // Re-render is handled by ContentItem calling updateLayout()
       // which is overridden in StackItem to call renderTabs()
-      return true
+      return false
     }
     return false

[Killed] BlockStatement
src/core/StackItem.js:145:34
     return false
   }
 
-  _appendDOMChild (child, index) {
-    this.contentAreaEl.appendChild(child.element)
-    child.renderAppContent() // Lazy render when added
-    this.activeChildIndex = typeof index === 'number' ? index : this.children.length - 1 // Activate new
-  }
+  _appendDOMChild (child, index) {}
 
   _closeTab (child, index, shouldFocus = true) {
killedBy: StackItem adds and removes component children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/core/StackItem.js:148:29
   _appendDOMChild (child, index) {
     this.contentAreaEl.appendChild(child.element)
     child.renderAppContent() // Lazy render when added
-    this.activeChildIndex = typeof index === 'number' ? index : this.children.length - 1 // Activate new
+    this.activeChildIndex = typeof index !== 'number' ? index : this.children.length - 1 // Activate new
   }
 
killedBy: StackItem adds and removes component children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
src/core/StackItem.js:148:29
   _appendDOMChild (child, index) {
     this.contentAreaEl.appendChild(child.element)
     child.renderAppContent() // Lazy render when added
-    this.activeChildIndex = typeof index === 'number' ? index : this.children.length - 1 // Activate new
+    this.activeChildIndex = true ? index : this.children.length - 1 // Activate new
   }
 
killedBy: StackItem adds and removes component children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[NoCoverage] BooleanLiteral
src/core/StackItem.js:151:42
     this.activeChildIndex = typeof index === 'number' ? index : this.children.length - 1 // Activate new
   }
 
-  _closeTab (child, index, shouldFocus = true) {
+  _closeTab (child, index, shouldFocus = false) {
     const wasActive = index === this.activeChildIndex
     if (this.removeChild(child)) {

[NoCoverage] BlockStatement
src/core/StackItem.js:151:48
     this.activeChildIndex = typeof index === 'number' ? index : this.children.length - 1 // Activate new
   }
 
-  _closeTab (child, index, shouldFocus = true) {
-    const wasActive = index === this.activeChildIndex
-    if (this.removeChild(child)) {
-      if (this.children.length === 0) {
-        this.layoutManager._cleanupEmptyStack(this)
-      } else if (wasActive && shouldFocus) {
-        // Wait for DOM to update then focus the new active tab
-        setTimeout(() => {
-          const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-          if (tabs[this.activeChildIndex]) {
-            tabs[this.activeChildIndex].focus()
-          }
-        }, 0)
-      }
-    }
-  }
+  _closeTab (child, index, shouldFocus = true) {}
 
   _removeDOMChild (child) {

[NoCoverage] ConditionalExpression
src/core/StackItem.js:152:23
   }
 
   _closeTab (child, index, shouldFocus = true) {
-    const wasActive = index === this.activeChildIndex
+    const wasActive = false
     if (this.removeChild(child)) {
       if (this.children.length === 0) {

[NoCoverage] EqualityOperator
src/core/StackItem.js:152:23
   }
 
   _closeTab (child, index, shouldFocus = true) {
-    const wasActive = index === this.activeChildIndex
+    const wasActive = index !== this.activeChildIndex
     if (this.removeChild(child)) {
       if (this.children.length === 0) {

[NoCoverage] BlockStatement
src/core/StackItem.js:153:34
 
   _closeTab (child, index, shouldFocus = true) {
     const wasActive = index === this.activeChildIndex
-    if (this.removeChild(child)) {
-      if (this.children.length === 0) {
-        this.layoutManager._cleanupEmptyStack(this)
-      } else if (wasActive && shouldFocus) {
-        // Wait for DOM to update then focus the new active tab
-        setTimeout(() => {
-          const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-          if (tabs[this.activeChildIndex]) {
-            tabs[this.activeChildIndex].focus()
-          }
-        }, 0)
-      }
-    }
+    if (this.removeChild(child)) {}
   }
 

[NoCoverage] ConditionalExpression
src/core/StackItem.js:153:9
 
   _closeTab (child, index, shouldFocus = true) {
     const wasActive = index === this.activeChildIndex
-    if (this.removeChild(child)) {
+    if (false) {
       if (this.children.length === 0) {
         this.layoutManager._cleanupEmptyStack(this)

[NoCoverage] BlockStatement
src/core/StackItem.js:154:39
   _closeTab (child, index, shouldFocus = true) {
     const wasActive = index === this.activeChildIndex
     if (this.removeChild(child)) {
-      if (this.children.length === 0) {
-        this.layoutManager._cleanupEmptyStack(this)
-      } else if (wasActive && shouldFocus) {
+      if (this.children.length === 0) {} else if (wasActive && shouldFocus) {
         // Wait for DOM to update then focus the new active tab
         setTimeout(() => {

[NoCoverage] EqualityOperator
src/core/StackItem.js:154:11
   _closeTab (child, index, shouldFocus = true) {
     const wasActive = index === this.activeChildIndex
     if (this.removeChild(child)) {
-      if (this.children.length === 0) {
+      if (this.children.length !== 0) {
         this.layoutManager._cleanupEmptyStack(this)
       } else if (wasActive && shouldFocus) {

[NoCoverage] LogicalOperator
src/core/StackItem.js:156:18
     if (this.removeChild(child)) {
       if (this.children.length === 0) {
         this.layoutManager._cleanupEmptyStack(this)
-      } else if (wasActive && shouldFocus) {
+      } else if (wasActive || shouldFocus) {
         // Wait for DOM to update then focus the new active tab
         setTimeout(() => {

[NoCoverage] BlockStatement
src/core/StackItem.js:156:44
     if (this.removeChild(child)) {
       if (this.children.length === 0) {
         this.layoutManager._cleanupEmptyStack(this)
-      } else if (wasActive && shouldFocus) {
-        // Wait for DOM to update then focus the new active tab
-        setTimeout(() => {
-          const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-          if (tabs[this.activeChildIndex]) {
-            tabs[this.activeChildIndex].focus()
-          }
-        }, 0)
-      }
+      } else if (wasActive && shouldFocus) {}
     }
   }

[NoCoverage] BlockStatement
src/core/StackItem.js:158:26
         this.layoutManager._cleanupEmptyStack(this)
       } else if (wasActive && shouldFocus) {
         // Wait for DOM to update then focus the new active tab
-        setTimeout(() => {
-          const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-          if (tabs[this.activeChildIndex]) {
-            tabs[this.activeChildIndex].focus()
-          }
-        }, 0)
+        setTimeout(() => {}, 0)
       }
     }

[NoCoverage] StringLiteral
src/core/StackItem.js:159:53
       } else if (wasActive && shouldFocus) {
         // Wait for DOM to update then focus the new active tab
         setTimeout(() => {
-          const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
+          const tabs = this.tabsEl.querySelectorAll("")
           if (tabs[this.activeChildIndex]) {
             tabs[this.activeChildIndex].focus()

[NoCoverage] ConditionalExpression
src/core/StackItem.js:160:15
         // Wait for DOM to update then focus the new active tab
         setTimeout(() => {
           const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-          if (tabs[this.activeChildIndex]) {
+          if (false) {
             tabs[this.activeChildIndex].focus()
           }

[NoCoverage] ConditionalExpression
src/core/StackItem.js:160:15
         // Wait for DOM to update then focus the new active tab
         setTimeout(() => {
           const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-          if (tabs[this.activeChildIndex]) {
+          if (true) {
             tabs[this.activeChildIndex].focus()
           }

[NoCoverage] BlockStatement
src/core/StackItem.js:168:27
     }
   }
 
-  _removeDOMChild (child) {
-    if (child.element && child.element.parentElement === this.contentAreaEl) {
-      this.contentAreaEl.removeChild(child.element)
-    }
-    if (this.activeChildIndex >= this.children.length) {
-      this.activeChildIndex = Math.max(0, this.children.length - 1)
-    }
-  }
+  _removeDOMChild (child) {}
 
   updateLayout () {

[NoCoverage] ConditionalExpression
src/core/StackItem.js:169:9
   }
 
   _removeDOMChild (child) {
-    if (child.element && child.element.parentElement === this.contentAreaEl) {
+    if (true) {
       this.contentAreaEl.removeChild(child.element)
     }

[NoCoverage] ConditionalExpression
src/core/StackItem.js:169:9
   }
 
   _removeDOMChild (child) {
-    if (child.element && child.element.parentElement === this.contentAreaEl) {
+    if (false) {
       this.contentAreaEl.removeChild(child.element)
     }

[NoCoverage] ConditionalExpression
src/core/StackItem.js:172:9
     if (child.element && child.element.parentElement === this.contentAreaEl) {
       this.contentAreaEl.removeChild(child.element)
     }
-    if (this.activeChildIndex >= this.children.length) {
+    if (true) {
       this.activeChildIndex = Math.max(0, this.children.length - 1)
     }

[NoCoverage] EqualityOperator
src/core/StackItem.js:172:9
     if (child.element && child.element.parentElement === this.contentAreaEl) {
       this.contentAreaEl.removeChild(child.element)
     }
-    if (this.activeChildIndex >= this.children.length) {
+    if (this.activeChildIndex < this.children.length) {
       this.activeChildIndex = Math.max(0, this.children.length - 1)
     }

[NoCoverage] MethodExpression
src/core/StackItem.js:173:31
       this.contentAreaEl.removeChild(child.element)
     }
     if (this.activeChildIndex >= this.children.length) {
-      this.activeChildIndex = Math.max(0, this.children.length - 1)
+      this.activeChildIndex = Math.min(0, this.children.length - 1)
     }
   }

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:173:43
       this.contentAreaEl.removeChild(child.element)
     }
     if (this.activeChildIndex >= this.children.length) {
-      this.activeChildIndex = Math.max(0, this.children.length - 1)
+      this.activeChildIndex = Math.max(0, this.children.length + 1)
     }
   }

[Survived] BlockStatement
src/core/StackItem.js:177:19
     }
   }
 
-  updateLayout () {
-    this.renderTabs()
-    this.showActiveChild()
-    this.updateFlex()
-    this.updateOverflow()
-  }
+  updateLayout () {}
 
   _updateTabActiveState () {

[NoCoverage] BlockStatement
src/core/StackItem.js:184:28
     this.updateOverflow()
   }
 
-  _updateTabActiveState () {
-    if (this.tabPosition === 'headless' || !this.tabsEl) return
-    const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-    tabs.forEach((tab, i) => {
-      tab.classList.toggle('active', i === this.activeChildIndex)
-      tab.setAttribute('aria-selected', i === this.activeChildIndex ? 'true' : 'false')
-      tab.setAttribute('tabindex', i === this.activeChildIndex ? '0' : '-1')
-    })
-  }
+  _updateTabActiveState () {}
 
   renderTabs () {

[NoCoverage] ConditionalExpression
src/core/StackItem.js:185:9
   }
 
   _updateTabActiveState () {
-    if (this.tabPosition === 'headless' || !this.tabsEl) return
+    if (false) return
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
     tabs.forEach((tab, i) => {

[NoCoverage] ConditionalExpression
src/core/StackItem.js:185:9
   }
 
   _updateTabActiveState () {
-    if (this.tabPosition === 'headless' || !this.tabsEl) return
+    if (false || !this.tabsEl) return
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
     tabs.forEach((tab, i) => {

[NoCoverage] BlockStatement
src/core/StackItem.js:187:30
   _updateTabActiveState () {
     if (this.tabPosition === 'headless' || !this.tabsEl) return
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-    tabs.forEach((tab, i) => {
-      tab.classList.toggle('active', i === this.activeChildIndex)
-      tab.setAttribute('aria-selected', i === this.activeChildIndex ? 'true' : 'false')
-      tab.setAttribute('tabindex', i === this.activeChildIndex ? '0' : '-1')
-    })
+    tabs.forEach((tab, i) => {})
   }
 

[NoCoverage] EqualityOperator
src/core/StackItem.js:188:38
     if (this.tabPosition === 'headless' || !this.tabsEl) return
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
     tabs.forEach((tab, i) => {
-      tab.classList.toggle('active', i === this.activeChildIndex)
+      tab.classList.toggle('active', i !== this.activeChildIndex)
       tab.setAttribute('aria-selected', i === this.activeChildIndex ? 'true' : 'false')
       tab.setAttribute('tabindex', i === this.activeChildIndex ? '0' : '-1')

[NoCoverage] ConditionalExpression
src/core/StackItem.js:188:38
     if (this.tabPosition === 'headless' || !this.tabsEl) return
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
     tabs.forEach((tab, i) => {
-      tab.classList.toggle('active', i === this.activeChildIndex)
+      tab.classList.toggle('active', false)
       tab.setAttribute('aria-selected', i === this.activeChildIndex ? 'true' : 'false')
       tab.setAttribute('tabindex', i === this.activeChildIndex ? '0' : '-1')

[NoCoverage] ConditionalExpression
src/core/StackItem.js:189:41
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
     tabs.forEach((tab, i) => {
       tab.classList.toggle('active', i === this.activeChildIndex)
-      tab.setAttribute('aria-selected', i === this.activeChildIndex ? 'true' : 'false')
+      tab.setAttribute('aria-selected', false ? 'true' : 'false')
       tab.setAttribute('tabindex', i === this.activeChildIndex ? '0' : '-1')
     })

[NoCoverage] ConditionalExpression
src/core/StackItem.js:189:41
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
     tabs.forEach((tab, i) => {
       tab.classList.toggle('active', i === this.activeChildIndex)
-      tab.setAttribute('aria-selected', i === this.activeChildIndex ? 'true' : 'false')
+      tab.setAttribute('aria-selected', true ? 'true' : 'false')
       tab.setAttribute('tabindex', i === this.activeChildIndex ? '0' : '-1')
     })

[NoCoverage] ConditionalExpression
src/core/StackItem.js:190:36
     tabs.forEach((tab, i) => {
       tab.classList.toggle('active', i === this.activeChildIndex)
       tab.setAttribute('aria-selected', i === this.activeChildIndex ? 'true' : 'false')
-      tab.setAttribute('tabindex', i === this.activeChildIndex ? '0' : '-1')
+      tab.setAttribute('tabindex', false ? '0' : '-1')
     })
   }

[NoCoverage] EqualityOperator
src/core/StackItem.js:190:36
     tabs.forEach((tab, i) => {
       tab.classList.toggle('active', i === this.activeChildIndex)
       tab.setAttribute('aria-selected', i === this.activeChildIndex ? 'true' : 'false')
-      tab.setAttribute('tabindex', i === this.activeChildIndex ? '0' : '-1')
+      tab.setAttribute('tabindex', i !== this.activeChildIndex ? '0' : '-1')
     })
   }

[Killed] EqualityOperator
src/core/StackItem.js:195:9
   }
 
   renderTabs () {
-    if (this.tabPosition === 'headless') return
+    if (this.tabPosition !== 'headless') return
     this.tabsEl.innerHTML = ''
     this.children.forEach((child, index) => {
killedBy: StackItem renderTabs generates tab elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/core/StackItem.js:195:9
   }
 
   renderTabs () {
-    if (this.tabPosition === 'headless') return
+    if (true) return
     this.tabsEl.innerHTML = ''
     this.children.forEach((child, index) => {
killedBy: StackItem renderTabs generates tab elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Survived] StringLiteral
src/core/StackItem.js:196:29
 
   renderTabs () {
     if (this.tabPosition === 'headless') return
-    this.tabsEl.innerHTML = ''
+    this.tabsEl.innerHTML = "Stryker was here!"
     this.children.forEach((child, index) => {
       const tab = Utils.createElement('div', 'tulweb-tab', this.tabsEl)

[Killed] StringLiteral
src/core/StackItem.js:198:46
     if (this.tabPosition === 'headless') return
     this.tabsEl.innerHTML = ''
     this.children.forEach((child, index) => {
-      const tab = Utils.createElement('div', 'tulweb-tab', this.tabsEl)
+      const tab = Utils.createElement('div', "", this.tabsEl)
       if (index === this.activeChildIndex) tab.classList.add('active')
 
killedBy: StackItem renderTabs generates tab elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Survived] EqualityOperator
src/core/StackItem.js:199:11
     this.tabsEl.innerHTML = ''
     this.children.forEach((child, index) => {
       const tab = Utils.createElement('div', 'tulweb-tab', this.tabsEl)
-      if (index === this.activeChildIndex) tab.classList.add('active')
+      if (index !== this.activeChildIndex) tab.classList.add('active')
 
       const title = Utils.createElement('div', 'tulweb-tab-title', tab)

[Survived] ConditionalExpression
src/core/StackItem.js:199:11
     this.tabsEl.innerHTML = ''
     this.children.forEach((child, index) => {
       const tab = Utils.createElement('div', 'tulweb-tab', this.tabsEl)
-      if (index === this.activeChildIndex) tab.classList.add('active')
+      if (false) tab.classList.add('active')
 
       const title = Utils.createElement('div', 'tulweb-tab-title', tab)

[Killed] StringLiteral
src/core/StackItem.js:201:41
       const tab = Utils.createElement('div', 'tulweb-tab', this.tabsEl)
       if (index === this.activeChildIndex) tab.classList.add('active')
 
-      const title = Utils.createElement('div', 'tulweb-tab-title', tab)
+      const title = Utils.createElement("", 'tulweb-tab-title', tab)
       title.textContent = child.config.title || child.config.componentName || 'Tab'
       let close = null
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: InvalidCharacterError: "" did not match the Name production, InvalidCharacterError: "" did not match the Name production
