[Killed] LogicalOperator
src/core/StackItem.js:202:27
       if (index === this.activeChildIndex) tab.classList.add('active')
 
       const title = Utils.createElement('div', 'tulweb-tab-title', tab)
-      title.textContent = child.config.title || child.config.componentName || 'Tab'
+      title.textContent = child.config.title && child.config.componentName || 'Tab'
       let close = null
       const isCloseable = child.isCloseable
killedBy: StackItem renderTabs generates tab elements
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Tab 1"
Received string:    "Tab×"

[Killed] ConditionalExpression
src/core/StackItem.js:202:27
       if (index === this.activeChildIndex) tab.classList.add('active')
 
       const title = Utils.createElement('div', 'tulweb-tab-title', tab)
-      title.textContent = child.config.title || child.config.componentName || 'Tab'
+      title.textContent = false
       let close = null
       const isCloseable = child.isCloseable
killedBy: StackItem renderTabs generates tab elements
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Tab 1"
Received string:    "false×"

[Survived] ConditionalExpression
src/core/StackItem.js:205:11
       title.textContent = child.config.title || child.config.componentName || 'Tab'
       let close = null
       const isCloseable = child.isCloseable
-      if (isCloseable) {
+      if (false) {
         close = Utils.createElement('div', 'tulweb-tab-close', tab)
         close.textContent = '×'

[Survived] ConditionalExpression
src/core/StackItem.js:205:11
       title.textContent = child.config.title || child.config.componentName || 'Tab'
       let close = null
       const isCloseable = child.isCloseable
-      if (isCloseable) {
+      if (true) {
         close = Utils.createElement('div', 'tulweb-tab-close', tab)
         close.textContent = '×'

[NoCoverage] BlockStatement
src/core/StackItem.js:208:48
       if (isCloseable) {
         close = Utils.createElement('div', 'tulweb-tab-close', tab)
         close.textContent = '×'
-        close.addEventListener('click', (e) => {
-          e.stopPropagation()
-          this._closeTab(child, index)
-        })
+        close.addEventListener('click', (e) => {})
       }
 

[Survived] StringLiteral
src/core/StackItem.js:214:32
         })
       }
 
-      tab.setAttribute('role', 'tab')
+      tab.setAttribute('role', "")
       tab.setAttribute('aria-selected', index === this.activeChildIndex ? 'true' : 'false')
       tab.setAttribute('aria-controls', 'panel-' + this.id)

[Survived] EqualityOperator
src/core/StackItem.js:215:41
       }
 
       tab.setAttribute('role', 'tab')
-      tab.setAttribute('aria-selected', index === this.activeChildIndex ? 'true' : 'false')
+      tab.setAttribute('aria-selected', index !== this.activeChildIndex ? 'true' : 'false')
       tab.setAttribute('aria-controls', 'panel-' + this.id)
       tab.setAttribute('tabindex', index === this.activeChildIndex ? '0' : '-1')

[Survived] ConditionalExpression
src/core/StackItem.js:215:41
       }
 
       tab.setAttribute('role', 'tab')
-      tab.setAttribute('aria-selected', index === this.activeChildIndex ? 'true' : 'false')
+      tab.setAttribute('aria-selected', false ? 'true' : 'false')
       tab.setAttribute('aria-controls', 'panel-' + this.id)
       tab.setAttribute('tabindex', index === this.activeChildIndex ? '0' : '-1')

[Survived] StringLiteral
src/core/StackItem.js:216:41
 
       tab.setAttribute('role', 'tab')
       tab.setAttribute('aria-selected', index === this.activeChildIndex ? 'true' : 'false')
-      tab.setAttribute('aria-controls', 'panel-' + this.id)
+      tab.setAttribute('aria-controls', "" + this.id)
       tab.setAttribute('tabindex', index === this.activeChildIndex ? '0' : '-1')
 

[Survived] ConditionalExpression
src/core/StackItem.js:217:36
       tab.setAttribute('role', 'tab')
       tab.setAttribute('aria-selected', index === this.activeChildIndex ? 'true' : 'false')
       tab.setAttribute('aria-controls', 'panel-' + this.id)
-      tab.setAttribute('tabindex', index === this.activeChildIndex ? '0' : '-1')
+      tab.setAttribute('tabindex', true ? '0' : '-1')
 
       // Keyboard navigation for tabs

[Survived] EqualityOperator
src/core/StackItem.js:217:36
       tab.setAttribute('role', 'tab')
       tab.setAttribute('aria-selected', index === this.activeChildIndex ? 'true' : 'false')
       tab.setAttribute('aria-controls', 'panel-' + this.id)
-      tab.setAttribute('tabindex', index === this.activeChildIndex ? '0' : '-1')
+      tab.setAttribute('tabindex', index !== this.activeChildIndex ? '0' : '-1')
 
       // Keyboard navigation for tabs

[NoCoverage] ConditionalExpression
src/core/StackItem.js:221:13
 
       // Keyboard navigation for tabs
       tab.addEventListener('keydown', (e) => {
-        if (e.altKey || e.ctrlKey || e.metaKey) return
+        if (true) return
         if (e.key === 'ArrowRight' || e.key === 'ArrowDown') {
           e.preventDefault()

[NoCoverage] ConditionalExpression
src/core/StackItem.js:221:13
 
       // Keyboard navigation for tabs
       tab.addEventListener('keydown', (e) => {
-        if (e.altKey || e.ctrlKey || e.metaKey) return
+        if (false) return
         if (e.key === 'ArrowRight' || e.key === 'ArrowDown') {
           e.preventDefault()

[NoCoverage] BlockStatement
src/core/StackItem.js:222:62
       // Keyboard navigation for tabs
       tab.addEventListener('keydown', (e) => {
         if (e.altKey || e.ctrlKey || e.metaKey) return
-        if (e.key === 'ArrowRight' || e.key === 'ArrowDown') {
-          e.preventDefault()
-          this.setActive((index + 1) % this.children.length)
-          this.tabsEl.querySelectorAll('.tulweb-tab')[this.activeChildIndex].focus()
-        } else if (e.key === 'ArrowLeft' || e.key === 'ArrowUp') {
+        if (e.key === 'ArrowRight' || e.key === 'ArrowDown') {} else if (e.key === 'ArrowLeft' || e.key === 'ArrowUp') {
           e.preventDefault()
           this.setActive((index - 1 + this.children.length) % this.children.length)

[NoCoverage] LogicalOperator
src/core/StackItem.js:222:13
       // Keyboard navigation for tabs
       tab.addEventListener('keydown', (e) => {
         if (e.altKey || e.ctrlKey || e.metaKey) return
-        if (e.key === 'ArrowRight' || e.key === 'ArrowDown') {
+        if (e.key === 'ArrowRight' && e.key === 'ArrowDown') {
           e.preventDefault()
           this.setActive((index + 1) % this.children.length)

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:224:26
         if (e.altKey || e.ctrlKey || e.metaKey) return
         if (e.key === 'ArrowRight' || e.key === 'ArrowDown') {
           e.preventDefault()
-          this.setActive((index + 1) % this.children.length)
+          this.setActive((index + 1) * this.children.length)
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.activeChildIndex].focus()
         } else if (e.key === 'ArrowLeft' || e.key === 'ArrowUp') {

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:224:27
         if (e.altKey || e.ctrlKey || e.metaKey) return
         if (e.key === 'ArrowRight' || e.key === 'ArrowDown') {
           e.preventDefault()
-          this.setActive((index + 1) % this.children.length)
+          this.setActive((index - 1) % this.children.length)
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.activeChildIndex].focus()
         } else if (e.key === 'ArrowLeft' || e.key === 'ArrowUp') {

[NoCoverage] LogicalOperator
src/core/StackItem.js:226:20
           e.preventDefault()
           this.setActive((index + 1) % this.children.length)
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.activeChildIndex].focus()
-        } else if (e.key === 'ArrowLeft' || e.key === 'ArrowUp') {
+        } else if (e.key === 'ArrowLeft' && e.key === 'ArrowUp') {
           e.preventDefault()
           this.setActive((index - 1 + this.children.length) % this.children.length)

[NoCoverage] ConditionalExpression
src/core/StackItem.js:226:20
           e.preventDefault()
           this.setActive((index + 1) % this.children.length)
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.activeChildIndex].focus()
-        } else if (e.key === 'ArrowLeft' || e.key === 'ArrowUp') {
+        } else if (true) {
           e.preventDefault()
           this.setActive((index - 1 + this.children.length) % this.children.length)

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:228:27
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.activeChildIndex].focus()
         } else if (e.key === 'ArrowLeft' || e.key === 'ArrowUp') {
           e.preventDefault()
-          this.setActive((index - 1 + this.children.length) % this.children.length)
+          this.setActive((index + 1 + this.children.length) % this.children.length)
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.activeChildIndex].focus()
         } else if (e.key === 'Home') {

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:228:27
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.activeChildIndex].focus()
         } else if (e.key === 'ArrowLeft' || e.key === 'ArrowUp') {
           e.preventDefault()
-          this.setActive((index - 1 + this.children.length) % this.children.length)
+          this.setActive((index - 1 - this.children.length) % this.children.length)
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.activeChildIndex].focus()
         } else if (e.key === 'Home') {

[NoCoverage] StringLiteral
src/core/StackItem.js:229:40
         } else if (e.key === 'ArrowLeft' || e.key === 'ArrowUp') {
           e.preventDefault()
           this.setActive((index - 1 + this.children.length) % this.children.length)
-          this.tabsEl.querySelectorAll('.tulweb-tab')[this.activeChildIndex].focus()
+          this.tabsEl.querySelectorAll("")[this.activeChildIndex].focus()
         } else if (e.key === 'Home') {
           e.preventDefault()

[NoCoverage] EqualityOperator
src/core/StackItem.js:230:20
           e.preventDefault()
           this.setActive((index - 1 + this.children.length) % this.children.length)
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.activeChildIndex].focus()
-        } else if (e.key === 'Home') {
+        } else if (e.key !== 'Home') {
           e.preventDefault()
           this.setActive(0)

[NoCoverage] ConditionalExpression
src/core/StackItem.js:230:20
           e.preventDefault()
           this.setActive((index - 1 + this.children.length) % this.children.length)
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.activeChildIndex].focus()
-        } else if (e.key === 'Home') {
+        } else if (true) {
           e.preventDefault()
           this.setActive(0)

[NoCoverage] StringLiteral
src/core/StackItem.js:233:40
         } else if (e.key === 'Home') {
           e.preventDefault()
           this.setActive(0)
-          this.tabsEl.querySelectorAll('.tulweb-tab')[0].focus()
+          this.tabsEl.querySelectorAll("")[0].focus()
         } else if (e.key === 'End') {
           e.preventDefault()

[NoCoverage] ConditionalExpression
src/core/StackItem.js:234:20
           e.preventDefault()
           this.setActive(0)
           this.tabsEl.querySelectorAll('.tulweb-tab')[0].focus()
-        } else if (e.key === 'End') {
+        } else if (true) {
           e.preventDefault()
           this.setActive(this.children.length - 1)

[NoCoverage] EqualityOperator
src/core/StackItem.js:234:20
           e.preventDefault()
           this.setActive(0)
           this.tabsEl.querySelectorAll('.tulweb-tab')[0].focus()
-        } else if (e.key === 'End') {
+        } else if (e.key !== 'End') {
           e.preventDefault()
           this.setActive(this.children.length - 1)

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:236:26
           this.tabsEl.querySelectorAll('.tulweb-tab')[0].focus()
         } else if (e.key === 'End') {
           e.preventDefault()
-          this.setActive(this.children.length - 1)
+          this.setActive(this.children.length + 1)
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.children.length - 1].focus()
         } else if (e.key === 'Delete' && isCloseable) {

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:237:55
         } else if (e.key === 'End') {
           e.preventDefault()
           this.setActive(this.children.length - 1)
-          this.tabsEl.querySelectorAll('.tulweb-tab')[this.children.length - 1].focus()
+          this.tabsEl.querySelectorAll('.tulweb-tab')[this.children.length + 1].focus()
         } else if (e.key === 'Delete' && isCloseable) {
           e.preventDefault()

[NoCoverage] EqualityOperator
src/core/StackItem.js:238:20
           e.preventDefault()
           this.setActive(this.children.length - 1)
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.children.length - 1].focus()
-        } else if (e.key === 'Delete' && isCloseable) {
+        } else if (e.key !== 'Delete' && isCloseable) {
           e.preventDefault()
           this._closeTab(child, index, true)

[NoCoverage] LogicalOperator
src/core/StackItem.js:238:20
           e.preventDefault()
           this.setActive(this.children.length - 1)
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.children.length - 1].focus()
-        } else if (e.key === 'Delete' && isCloseable) {
+        } else if (e.key === 'Delete' || isCloseable) {
           e.preventDefault()
           this._closeTab(child, index, true)

[NoCoverage] BooleanLiteral
src/core/StackItem.js:240:40
           this.tabsEl.querySelectorAll('.tulweb-tab')[this.children.length - 1].focus()
         } else if (e.key === 'Delete' && isCloseable) {
           e.preventDefault()
-          this._closeTab(child, index, true)
+          this._closeTab(child, index, false)
         }
         if (e.key === 'Enter' || e.key === ' ') {

[NoCoverage] BlockStatement
src/core/StackItem.js:242:49
           e.preventDefault()
           this._closeTab(child, index, true)
         }
-        if (e.key === 'Enter' || e.key === ' ') {
-          this.setActive(index)
-          e.preventDefault()
-        }
+        if (e.key === 'Enter' || e.key === ' ') {}
       })
 

[NoCoverage] EqualityOperator
src/core/StackItem.js:242:34
           e.preventDefault()
           this._closeTab(child, index, true)
         }
-        if (e.key === 'Enter' || e.key === ' ') {
+        if (e.key === 'Enter' || e.key !== ' ') {
           this.setActive(index)
           e.preventDefault()

[NoCoverage] BlockStatement
src/core/StackItem.js:249:48
       })
 
       // Tab click
-      tab.addEventListener('mousedown', (e) => {
-        if (e.target !== close && e.button === 0) {
-          this.setActive(index)
-        }
-      })
+      tab.addEventListener('mousedown', (e) => {})
 
       // Tab double click (maximize)

[NoCoverage] BlockStatement
src/core/StackItem.js:250:51
 
       // Tab click
       tab.addEventListener('mousedown', (e) => {
-        if (e.target !== close && e.button === 0) {
-          this.setActive(index)
-        }
+        if (e.target !== close && e.button === 0) {}
       })
 

[NoCoverage] EqualityOperator
src/core/StackItem.js:250:13
 
       // Tab click
       tab.addEventListener('mousedown', (e) => {
-        if (e.target !== close && e.button === 0) {
+        if (e.target === close && e.button === 0) {
           this.setActive(index)
         }

[NoCoverage] BlockStatement
src/core/StackItem.js:256:47
       })
 
       // Tab double click (maximize)
-      tab.addEventListener('dblclick', (e) => {
-        if (e.target !== close) {
-          this.toggleMaximize()
-        }
-      })
+      tab.addEventListener('dblclick', (e) => {})
 
       // Tab right click context menu

[NoCoverage] ConditionalExpression
src/core/StackItem.js:257:13
 
       // Tab double click (maximize)
       tab.addEventListener('dblclick', (e) => {
-        if (e.target !== close) {
+        if (true) {
           this.toggleMaximize()
         }

[NoCoverage] BlockStatement
src/core/StackItem.js:257:33
 
       // Tab double click (maximize)
       tab.addEventListener('dblclick', (e) => {
-        if (e.target !== close) {
-          this.toggleMaximize()
-        }
+        if (e.target !== close) {}
       })
 

[NoCoverage] BlockStatement
src/core/StackItem.js:263:50
       })
 
       // Tab right click context menu
-      tab.addEventListener('contextmenu', (e) => {
-        e.preventDefault()
-        this.setActive(index)
-        this.layoutManager.showContextMenu(e, this, child, index)
-      })
+      tab.addEventListener('contextmenu', (e) => {})
 
       // Tab drag

[Survived] StringLiteral
src/core/StackItem.js:263:28
       })
 
       // Tab right click context menu
-      tab.addEventListener('contextmenu', (e) => {
+      tab.addEventListener("", (e) => {
         e.preventDefault()
         this.setActive(index)

[NoCoverage] BlockStatement
src/core/StackItem.js:270:39
       })
 
       // Tab drag
-      const startDragHandler = (e) => {
-        if (e.target !== close && this.children.length > 0 && (e.type === 'touchstart' || e.button === 0)) {
-          this.layoutManager.dragManager.pendDrag(e, child.config, 'tab', this, child.config.title)
-        }
-      }
+      const startDragHandler = (e) => {}
 
       tab.addEventListener('mousedown', startDragHandler)

[NoCoverage] ConditionalExpression
src/core/StackItem.js:271:13
 
       // Tab drag
       const startDragHandler = (e) => {
-        if (e.target !== close && this.children.length > 0 && (e.type === 'touchstart' || e.button === 0)) {
+        if (false) {
           this.layoutManager.dragManager.pendDrag(e, child.config, 'tab', this, child.config.title)
         }

[NoCoverage] ConditionalExpression
src/core/StackItem.js:271:64
 
       // Tab drag
       const startDragHandler = (e) => {
-        if (e.target !== close && this.children.length > 0 && (e.type === 'touchstart' || e.button === 0)) {
+        if (e.target !== close && this.children.length > 0 && (true)) {
           this.layoutManager.dragManager.pendDrag(e, child.config, 'tab', this, child.config.title)
         }

[Survived] BooleanLiteral
src/core/StackItem.js:277:71
       }
 
       tab.addEventListener('mousedown', startDragHandler)
-      tab.addEventListener('touchstart', startDragHandler, { passive: true })
+      tab.addEventListener('touchstart', startDragHandler, { passive: false })
     })
   }

[Survived] ObjectLiteral
src/core/StackItem.js:277:60
       }
 
       tab.addEventListener('mousedown', startDragHandler)
-      tab.addEventListener('touchstart', startDragHandler, { passive: true })
+      tab.addEventListener('touchstart', startDragHandler, {})
     })
   }

[Killed] BooleanLiteral
src/core/StackItem.js:282:9
   }
 
   updateOverflow () {
-    if (!this.tabsEl || this.tabPosition === 'headless') return
+    if (this.tabsEl || this.tabPosition === 'headless') return
 
     const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
killedBy: StackItem updateOverflow detects horizontal overflow and shows button
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] EqualityOperator
src/core/StackItem.js:282:25
   }
 
   updateOverflow () {
-    if (!this.tabsEl || this.tabPosition === 'headless') return
+    if (!this.tabsEl || this.tabPosition !== 'headless') return
 
     const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
killedBy: StackItem updateOverflow detects horizontal overflow and shows button
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] ConditionalExpression
src/core/StackItem.js:284:24
   updateOverflow () {
     if (!this.tabsEl || this.tabPosition === 'headless') return
 
-    const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
+    const isVertical = false
     let hasOverflow = false
 
killedBy: StackItem updateOverflow detects vertical overflow for side positions
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] ConditionalExpression
src/core/StackItem.js:284:24
   updateOverflow () {
     if (!this.tabsEl || this.tabPosition === 'headless') return
 
-    const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
+    const isVertical = false || this.tabPosition === 'right'
     let hasOverflow = false
 
killedBy: StackItem updateOverflow detects vertical overflow for side positions
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Survived] BooleanLiteral
src/core/StackItem.js:285:23
     if (!this.tabsEl || this.tabPosition === 'headless') return
 
     const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
-    let hasOverflow = false
+    let hasOverflow = true
 
     if (isVertical) {

[Killed] BlockStatement
src/core/StackItem.js:287:21
     const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
     let hasOverflow = false
 
-    if (isVertical) {
-      hasOverflow = this.tabsEl.scrollHeight > this.tabsEl.clientHeight
-    } else {
+    if (isVertical) {} else {
       hasOverflow = this.tabsEl.scrollWidth > this.tabsEl.clientWidth
     }
killedBy: StackItem updateOverflow detects vertical overflow for side positions
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] ConditionalExpression
src/core/StackItem.js:288:21
     let hasOverflow = false
 
     if (isVertical) {
-      hasOverflow = this.tabsEl.scrollHeight > this.tabsEl.clientHeight
+      hasOverflow = false
     } else {
       hasOverflow = this.tabsEl.scrollWidth > this.tabsEl.clientWidth
killedBy: StackItem updateOverflow detects vertical overflow for side positions
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] EqualityOperator
src/core/StackItem.js:288:21
     let hasOverflow = false
 
     if (isVertical) {
-      hasOverflow = this.tabsEl.scrollHeight > this.tabsEl.clientHeight
+      hasOverflow = this.tabsEl.scrollHeight <= this.tabsEl.clientHeight
     } else {
       hasOverflow = this.tabsEl.scrollWidth > this.tabsEl.clientWidth
killedBy: StackItem updateOverflow detects vertical overflow for side positions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "flex"
Received: "none"

[Killed] BlockStatement
src/core/StackItem.js:289:12
 
     if (isVertical) {
       hasOverflow = this.tabsEl.scrollHeight > this.tabsEl.clientHeight
-    } else {
-      hasOverflow = this.tabsEl.scrollWidth > this.tabsEl.clientWidth
-    }
+    } else {}
 
     if (hasOverflow) {
killedBy: StackItem updateOverflow detects horizontal overflow and shows button
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] EqualityOperator
src/core/StackItem.js:290:21
     if (isVertical) {
       hasOverflow = this.tabsEl.scrollHeight > this.tabsEl.clientHeight
     } else {
-      hasOverflow = this.tabsEl.scrollWidth > this.tabsEl.clientWidth
+      hasOverflow = this.tabsEl.scrollWidth <= this.tabsEl.clientWidth
     }
 
killedBy: StackItem updateOverflow detects horizontal overflow and shows button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "flex"
Received: "none"

[Killed] ConditionalExpression
src/core/StackItem.js:290:21
     if (isVertical) {
       hasOverflow = this.tabsEl.scrollHeight > this.tabsEl.clientHeight
     } else {
-      hasOverflow = this.tabsEl.scrollWidth > this.tabsEl.clientWidth
+      hasOverflow = false
     }
 
killedBy: StackItem updateOverflow detects horizontal overflow and shows button
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] BlockStatement
src/core/StackItem.js:293:22
       hasOverflow = this.tabsEl.scrollWidth > this.tabsEl.clientWidth
     }
 
-    if (hasOverflow) {
-      if (!this.overflowBtn) {
-        this.overflowBtn = Utils.createElement('div', 'tulweb-tab-overflow')
-        this.overflowBtn.innerHTML = '‹›'
-        this.headerEl.insertBefore(this.overflowBtn, this.tabsEl.nextSibling)
-
-        this.dropdownEl = Utils.createElement('div', 'tulweb-dropdown', this.element)
-        this.dropdownEl.style.display = 'none'
-
-        this.overflowBtn.addEventListener('click', (e) => {
-          e.stopPropagation()
-          const show = this.dropdownEl.style.display === 'none'
-          if (show) {
-            this.updateDropdownPosition()
-            this.renderDropdown()
-          }
-          this.dropdownEl.style.display = show ? 'block' : 'none'
-        })
-
-        document.addEventListener('mousedown', this._onDocumentClick)
-      }
-      this.overflowBtn.style.display = 'flex'
-    } else {
+    if (hasOverflow) {} else {
       if (this.overflowBtn) this.overflowBtn.style.display = 'none'
       if (this.dropdownEl) this.dropdownEl.style.display = 'none'
killedBy: StackItem updateOverflow detects horizontal overflow and shows button
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] ConditionalExpression
src/core/StackItem.js:293:9
       hasOverflow = this.tabsEl.scrollWidth > this.tabsEl.clientWidth
     }
 
-    if (hasOverflow) {
+    if (false) {
       if (!this.overflowBtn) {
         this.overflowBtn = Utils.createElement('div', 'tulweb-tab-overflow')
killedBy: StackItem updateOverflow detects horizontal overflow and shows button
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] BooleanLiteral
src/core/StackItem.js:294:11
     }
 
     if (hasOverflow) {
-      if (!this.overflowBtn) {
+      if (this.overflowBtn) {
         this.overflowBtn = Utils.createElement('div', 'tulweb-tab-overflow')
         this.overflowBtn.innerHTML = '‹›'
killedBy: StackItem updateOverflow detects horizontal overflow and shows button
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] ConditionalExpression
src/core/StackItem.js:294:11
     }
 
     if (hasOverflow) {
-      if (!this.overflowBtn) {
+      if (false) {
         this.overflowBtn = Utils.createElement('div', 'tulweb-tab-overflow')
         this.overflowBtn.innerHTML = '‹›'
killedBy: StackItem updateOverflow detects horizontal overflow and shows button
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Survived] StringLiteral
src/core/StackItem.js:299:54
         this.overflowBtn.innerHTML = '‹›'
         this.headerEl.insertBefore(this.overflowBtn, this.tabsEl.nextSibling)
 
-        this.dropdownEl = Utils.createElement('div', 'tulweb-dropdown', this.element)
+        this.dropdownEl = Utils.createElement('div', "", this.element)
         this.dropdownEl.style.display = 'none'
 

[Survived] StringLiteral
src/core/StackItem.js:300:41
         this.headerEl.insertBefore(this.overflowBtn, this.tabsEl.nextSibling)
 
         this.dropdownEl = Utils.createElement('div', 'tulweb-dropdown', this.element)
-        this.dropdownEl.style.display = 'none'
+        this.dropdownEl.style.display = ""
 
         this.overflowBtn.addEventListener('click', (e) => {

[NoCoverage] BlockStatement
src/core/StackItem.js:302:59
         this.dropdownEl = Utils.createElement('div', 'tulweb-dropdown', this.element)
         this.dropdownEl.style.display = 'none'
 
-        this.overflowBtn.addEventListener('click', (e) => {
-          e.stopPropagation()
-          const show = this.dropdownEl.style.display === 'none'
-          if (show) {
-            this.updateDropdownPosition()
-            this.renderDropdown()
-          }
-          this.dropdownEl.style.display = show ? 'block' : 'none'
-        })
+        this.overflowBtn.addEventListener('click', (e) => {})
 
         document.addEventListener('mousedown', this._onDocumentClick)

[NoCoverage] ConditionalExpression
src/core/StackItem.js:304:24
 
         this.overflowBtn.addEventListener('click', (e) => {
           e.stopPropagation()
-          const show = this.dropdownEl.style.display === 'none'
+          const show = false
           if (show) {
             this.updateDropdownPosition()

[NoCoverage] ConditionalExpression
src/core/StackItem.js:304:24
 
         this.overflowBtn.addEventListener('click', (e) => {
           e.stopPropagation()
-          const show = this.dropdownEl.style.display === 'none'
+          const show = true
           if (show) {
             this.updateDropdownPosition()

[NoCoverage] BlockStatement
src/core/StackItem.js:305:21
         this.overflowBtn.addEventListener('click', (e) => {
           e.stopPropagation()
           const show = this.dropdownEl.style.display === 'none'
-          if (show) {
-            this.updateDropdownPosition()
-            this.renderDropdown()
-          }
+          if (show) {}
           this.dropdownEl.style.display = show ? 'block' : 'none'
         })

[NoCoverage] ConditionalExpression
src/core/StackItem.js:305:15
         this.overflowBtn.addEventListener('click', (e) => {
           e.stopPropagation()
           const show = this.dropdownEl.style.display === 'none'
-          if (show) {
+          if (true) {
             this.updateDropdownPosition()
             this.renderDropdown()

[Survived] BlockStatement
src/core/StackItem.js:315:12
         document.addEventListener('mousedown', this._onDocumentClick)
       }
       this.overflowBtn.style.display = 'flex'
-    } else {
-      if (this.overflowBtn) this.overflowBtn.style.display = 'none'
-      if (this.dropdownEl) this.dropdownEl.style.display = 'none'
-    }
+    } else {}
 
     // Determine actually hidden tabs for the dropdown
