[Killed] ConditionalExpression
src/core/StackItem.js:316:11
       }
       this.overflowBtn.style.display = 'flex'
     } else {
-      if (this.overflowBtn) this.overflowBtn.style.display = 'none'
+      if (true) this.overflowBtn.style.display = 'none'
       if (this.dropdownEl) this.dropdownEl.style.display = 'none'
     }
killedBy: StackItem adds and removes component children
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Survived] ConditionalExpression
src/core/StackItem.js:316:11
       }
       this.overflowBtn.style.display = 'flex'
     } else {
-      if (this.overflowBtn) this.overflowBtn.style.display = 'none'
+      if (false) this.overflowBtn.style.display = 'none'
       if (this.dropdownEl) this.dropdownEl.style.display = 'none'
     }

[Killed] ConditionalExpression
src/core/StackItem.js:317:11
       this.overflowBtn.style.display = 'flex'
     } else {
       if (this.overflowBtn) this.overflowBtn.style.display = 'none'
-      if (this.dropdownEl) this.dropdownEl.style.display = 'none'
+      if (true) this.dropdownEl.style.display = 'none'
     }
 
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Survived] ConditionalExpression
src/core/StackItem.js:317:11
       this.overflowBtn.style.display = 'flex'
     } else {
       if (this.overflowBtn) this.overflowBtn.style.display = 'none'
-      if (this.dropdownEl) this.dropdownEl.style.display = 'none'
+      if (false) this.dropdownEl.style.display = 'none'
     }
 

[Survived] LogicalOperator
src/core/StackItem.js:322:9
 
     // Determine actually hidden tabs for the dropdown
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-    if (hasOverflow && tabs.length > 0) {
+    if (hasOverflow || tabs.length > 0) {
       const containerRect = this.tabsEl.getBoundingClientRect()
       this.hiddenTabs = this.children.filter((child, i) => {

[Survived] EqualityOperator
src/core/StackItem.js:322:24
 
     // Determine actually hidden tabs for the dropdown
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-    if (hasOverflow && tabs.length > 0) {
+    if (hasOverflow && tabs.length <= 0) {
       const containerRect = this.tabsEl.getBoundingClientRect()
       this.hiddenTabs = this.children.filter((child, i) => {

[Survived] BlockStatement
src/core/StackItem.js:324:60
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
     if (hasOverflow && tabs.length > 0) {
       const containerRect = this.tabsEl.getBoundingClientRect()
-      this.hiddenTabs = this.children.filter((child, i) => {
-        const tab = tabs[i]
-        if (!tab) return true
-        const rect = tab.getBoundingClientRect()
-        if (isVertical) {
-          return rect.bottom > containerRect.bottom || rect.top < containerRect.top
-        }
-        return rect.right > containerRect.right || rect.left < containerRect.left
-      })
+      this.hiddenTabs = this.children.filter((child, i) => {})
     } else {
       this.hiddenTabs = []

[Survived] MethodExpression
src/core/StackItem.js:324:25
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
     if (hasOverflow && tabs.length > 0) {
       const containerRect = this.tabsEl.getBoundingClientRect()
-      this.hiddenTabs = this.children.filter((child, i) => {
-        const tab = tabs[i]
-        if (!tab) return true
-        const rect = tab.getBoundingClientRect()
-        if (isVertical) {
-          return rect.bottom > containerRect.bottom || rect.top < containerRect.top
-        }
-        return rect.right > containerRect.right || rect.left < containerRect.left
-      })
+      this.hiddenTabs = this.children
     } else {
       this.hiddenTabs = []

[Survived] ConditionalExpression
src/core/StackItem.js:326:13
       const containerRect = this.tabsEl.getBoundingClientRect()
       this.hiddenTabs = this.children.filter((child, i) => {
         const tab = tabs[i]
-        if (!tab) return true
+        if (false) return true
         const rect = tab.getBoundingClientRect()
         if (isVertical) {

[Survived] BooleanLiteral
src/core/StackItem.js:326:13
       const containerRect = this.tabsEl.getBoundingClientRect()
       this.hiddenTabs = this.children.filter((child, i) => {
         const tab = tabs[i]
-        if (!tab) return true
+        if (tab) return true
         const rect = tab.getBoundingClientRect()
         if (isVertical) {

[Survived] ConditionalExpression
src/core/StackItem.js:328:13
         const tab = tabs[i]
         if (!tab) return true
         const rect = tab.getBoundingClientRect()
-        if (isVertical) {
+        if (false) {
           return rect.bottom > containerRect.bottom || rect.top < containerRect.top
         }

[Survived] BlockStatement
src/core/StackItem.js:328:25
         const tab = tabs[i]
         if (!tab) return true
         const rect = tab.getBoundingClientRect()
-        if (isVertical) {
-          return rect.bottom > containerRect.bottom || rect.top < containerRect.top
-        }
+        if (isVertical) {}
         return rect.right > containerRect.right || rect.left < containerRect.left
       })

[Survived] ConditionalExpression
src/core/StackItem.js:329:56
         if (!tab) return true
         const rect = tab.getBoundingClientRect()
         if (isVertical) {
-          return rect.bottom > containerRect.bottom || rect.top < containerRect.top
+          return rect.bottom > containerRect.bottom || false
         }
         return rect.right > containerRect.right || rect.left < containerRect.left

[Survived] EqualityOperator
src/core/StackItem.js:329:18
         if (!tab) return true
         const rect = tab.getBoundingClientRect()
         if (isVertical) {
-          return rect.bottom > containerRect.bottom || rect.top < containerRect.top
+          return rect.bottom >= containerRect.bottom || rect.top < containerRect.top
         }
         return rect.right > containerRect.right || rect.left < containerRect.left

[Survived] EqualityOperator
src/core/StackItem.js:331:16
         if (isVertical) {
           return rect.bottom > containerRect.bottom || rect.top < containerRect.top
         }
-        return rect.right > containerRect.right || rect.left < containerRect.left
+        return rect.right >= containerRect.right || rect.left < containerRect.left
       })
     } else {

[Survived] EqualityOperator
src/core/StackItem.js:331:16
         if (isVertical) {
           return rect.bottom > containerRect.bottom || rect.top < containerRect.top
         }
-        return rect.right > containerRect.right || rect.left < containerRect.left
+        return rect.right <= containerRect.right || rect.left < containerRect.left
       })
     } else {

[Survived] BlockStatement
src/core/StackItem.js:333:12
         }
         return rect.right > containerRect.right || rect.left < containerRect.left
       })
-    } else {
-      this.hiddenTabs = []
-    }
+    } else {}
   }
 

[NoCoverage] BlockStatement
src/core/StackItem.js:338:24
     }
   }
 
-  _onDocumentClick (e) {
-    if (this.dropdownEl && !this.dropdownEl.contains(e.target) && e.target !== this.overflowBtn) {
-      this.dropdownEl.style.display = 'none'
-    }
-  }
+  _onDocumentClick (e) {}
 
   updateDropdownPosition () {

[NoCoverage] ConditionalExpression
src/core/StackItem.js:339:67
   }
 
   _onDocumentClick (e) {
-    if (this.dropdownEl && !this.dropdownEl.contains(e.target) && e.target !== this.overflowBtn) {
+    if (this.dropdownEl && !this.dropdownEl.contains(e.target) && true) {
       this.dropdownEl.style.display = 'none'
     }

[NoCoverage] BlockStatement
src/core/StackItem.js:339:98
   }
 
   _onDocumentClick (e) {
-    if (this.dropdownEl && !this.dropdownEl.contains(e.target) && e.target !== this.overflowBtn) {
-      this.dropdownEl.style.display = 'none'
-    }
+    if (this.dropdownEl && !this.dropdownEl.contains(e.target) && e.target !== this.overflowBtn) {}
   }
 

[NoCoverage] BooleanLiteral
src/core/StackItem.js:345:9
   }
 
   updateDropdownPosition () {
-    if (!this.overflowBtn || !this.dropdownEl) return
+    if (this.overflowBtn || !this.dropdownEl) return
     const btnRect = this.overflowBtn.getBoundingClientRect()
     const containerRect = this.element.getBoundingClientRect()

[NoCoverage] ConditionalExpression
src/core/StackItem.js:345:9
   }
 
   updateDropdownPosition () {
-    if (!this.overflowBtn || !this.dropdownEl) return
+    if (true) return
     const btnRect = this.overflowBtn.getBoundingClientRect()
     const containerRect = this.element.getBoundingClientRect()

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:349:17
     const btnRect = this.overflowBtn.getBoundingClientRect()
     const containerRect = this.element.getBoundingClientRect()
 
-    const top = btnRect.top - containerRect.top
+    const top = btnRect.top + containerRect.top
     const left = btnRect.left - containerRect.left
     const right = containerRect.right - btnRect.right

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:350:18
     const containerRect = this.element.getBoundingClientRect()
 
     const top = btnRect.top - containerRect.top
-    const left = btnRect.left - containerRect.left
+    const left = btnRect.left + containerRect.left
     const right = containerRect.right - btnRect.right
     const bottom = containerRect.bottom - btnRect.bottom

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:351:19
 
     const top = btnRect.top - containerRect.top
     const left = btnRect.left - containerRect.left
-    const right = containerRect.right - btnRect.right
+    const right = containerRect.right + btnRect.right
     const bottom = containerRect.bottom - btnRect.bottom
 

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:352:20
     const top = btnRect.top - containerRect.top
     const left = btnRect.left - containerRect.left
     const right = containerRect.right - btnRect.right
-    const bottom = containerRect.bottom - btnRect.bottom
+    const bottom = containerRect.bottom + btnRect.bottom
 
     if (this.tabPosition === 'left') {

[NoCoverage] EqualityOperator
src/core/StackItem.js:354:9
     const right = containerRect.right - btnRect.right
     const bottom = containerRect.bottom - btnRect.bottom
 
-    if (this.tabPosition === 'left') {
+    if (this.tabPosition !== 'left') {
       this.dropdownEl.style.top = top + 'px'
       this.dropdownEl.style.left = (left + btnRect.width + 5) + 'px'

[NoCoverage] ConditionalExpression
src/core/StackItem.js:354:9
     const right = containerRect.right - btnRect.right
     const bottom = containerRect.bottom - btnRect.bottom
 
-    if (this.tabPosition === 'left') {
+    if (true) {
       this.dropdownEl.style.top = top + 'px'
       this.dropdownEl.style.left = (left + btnRect.width + 5) + 'px'

[NoCoverage] StringLiteral
src/core/StackItem.js:355:41
     const bottom = containerRect.bottom - btnRect.bottom
 
     if (this.tabPosition === 'left') {
-      this.dropdownEl.style.top = top + 'px'
+      this.dropdownEl.style.top = top + ""
       this.dropdownEl.style.left = (left + btnRect.width + 5) + 'px'
       this.dropdownEl.style.right = 'auto'

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:356:37
 
     if (this.tabPosition === 'left') {
       this.dropdownEl.style.top = top + 'px'
-      this.dropdownEl.style.left = (left + btnRect.width + 5) + 'px'
+      this.dropdownEl.style.left = (left + btnRect.width - 5) + 'px'
       this.dropdownEl.style.right = 'auto'
       this.dropdownEl.style.bottom = 'auto'

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:356:37
 
     if (this.tabPosition === 'left') {
       this.dropdownEl.style.top = top + 'px'
-      this.dropdownEl.style.left = (left + btnRect.width + 5) + 'px'
+      this.dropdownEl.style.left = (left - btnRect.width + 5) + 'px'
       this.dropdownEl.style.right = 'auto'
       this.dropdownEl.style.bottom = 'auto'

[NoCoverage] ConditionalExpression
src/core/StackItem.js:359:16
       this.dropdownEl.style.left = (left + btnRect.width + 5) + 'px'
       this.dropdownEl.style.right = 'auto'
       this.dropdownEl.style.bottom = 'auto'
-    } else if (this.tabPosition === 'right') {
+    } else if (false) {
       this.dropdownEl.style.top = top + 'px'
       this.dropdownEl.style.right = (right + btnRect.width + 5) + 'px'

[NoCoverage] EqualityOperator
src/core/StackItem.js:359:16
       this.dropdownEl.style.left = (left + btnRect.width + 5) + 'px'
       this.dropdownEl.style.right = 'auto'
       this.dropdownEl.style.bottom = 'auto'
-    } else if (this.tabPosition === 'right') {
+    } else if (this.tabPosition !== 'right') {
       this.dropdownEl.style.top = top + 'px'
       this.dropdownEl.style.right = (right + btnRect.width + 5) + 'px'

[NoCoverage] StringLiteral
src/core/StackItem.js:360:41
       this.dropdownEl.style.right = 'auto'
       this.dropdownEl.style.bottom = 'auto'
     } else if (this.tabPosition === 'right') {
-      this.dropdownEl.style.top = top + 'px'
+      this.dropdownEl.style.top = top + ""
       this.dropdownEl.style.right = (right + btnRect.width + 5) + 'px'
       this.dropdownEl.style.left = 'auto'

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:361:38
       this.dropdownEl.style.bottom = 'auto'
     } else if (this.tabPosition === 'right') {
       this.dropdownEl.style.top = top + 'px'
-      this.dropdownEl.style.right = (right + btnRect.width + 5) + 'px'
+      this.dropdownEl.style.right = (right - btnRect.width + 5) + 'px'
       this.dropdownEl.style.left = 'auto'
       this.dropdownEl.style.bottom = 'auto'

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:361:38
       this.dropdownEl.style.bottom = 'auto'
     } else if (this.tabPosition === 'right') {
       this.dropdownEl.style.top = top + 'px'
-      this.dropdownEl.style.right = (right + btnRect.width + 5) + 'px'
+      this.dropdownEl.style.right = (right + btnRect.width - 5) + 'px'
       this.dropdownEl.style.left = 'auto'
       this.dropdownEl.style.bottom = 'auto'

[NoCoverage] StringLiteral
src/core/StackItem.js:362:36
     } else if (this.tabPosition === 'right') {
       this.dropdownEl.style.top = top + 'px'
       this.dropdownEl.style.right = (right + btnRect.width + 5) + 'px'
-      this.dropdownEl.style.left = 'auto'
+      this.dropdownEl.style.left = ""
       this.dropdownEl.style.bottom = 'auto'
     } else if (this.tabPosition === 'bottom') {

[NoCoverage] ConditionalExpression
src/core/StackItem.js:364:16
       this.dropdownEl.style.right = (right + btnRect.width + 5) + 'px'
       this.dropdownEl.style.left = 'auto'
       this.dropdownEl.style.bottom = 'auto'
-    } else if (this.tabPosition === 'bottom') {
+    } else if (true) {
       this.dropdownEl.style.bottom = (bottom + btnRect.height + 5) + 'px'
       this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish

[NoCoverage] ConditionalExpression
src/core/StackItem.js:364:16
       this.dropdownEl.style.right = (right + btnRect.width + 5) + 'px'
       this.dropdownEl.style.left = 'auto'
       this.dropdownEl.style.bottom = 'auto'
-    } else if (this.tabPosition === 'bottom') {
+    } else if (false) {
       this.dropdownEl.style.bottom = (bottom + btnRect.height + 5) + 'px'
       this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:365:39
       this.dropdownEl.style.left = 'auto'
       this.dropdownEl.style.bottom = 'auto'
     } else if (this.tabPosition === 'bottom') {
-      this.dropdownEl.style.bottom = (bottom + btnRect.height + 5) + 'px'
+      this.dropdownEl.style.bottom = (bottom + btnRect.height - 5) + 'px'
       this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
       if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:365:39
       this.dropdownEl.style.left = 'auto'
       this.dropdownEl.style.bottom = 'auto'
     } else if (this.tabPosition === 'bottom') {
-      this.dropdownEl.style.bottom = (bottom + btnRect.height + 5) + 'px'
+      this.dropdownEl.style.bottom = (bottom - btnRect.height + 5) + 'px'
       this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
       if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:366:37
       this.dropdownEl.style.bottom = 'auto'
     } else if (this.tabPosition === 'bottom') {
       this.dropdownEl.style.bottom = (bottom + btnRect.height + 5) + 'px'
-      this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
+      this.dropdownEl.style.left = (left + btnRect.width + 150) + 'px' // Align right-ish
       if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'
       this.dropdownEl.style.top = 'auto'

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:366:37
       this.dropdownEl.style.bottom = 'auto'
     } else if (this.tabPosition === 'bottom') {
       this.dropdownEl.style.bottom = (bottom + btnRect.height + 5) + 'px'
-      this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
+      this.dropdownEl.style.left = (left - btnRect.width - 150) + 'px' // Align right-ish
       if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'
       this.dropdownEl.style.top = 'auto'

[NoCoverage] EqualityOperator
src/core/StackItem.js:367:11
     } else if (this.tabPosition === 'bottom') {
       this.dropdownEl.style.bottom = (bottom + btnRect.height + 5) + 'px'
       this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
-      if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'
+      if (parseInt(this.dropdownEl.style.left) <= 0) this.dropdownEl.style.left = '5px'
       this.dropdownEl.style.top = 'auto'
       this.dropdownEl.style.right = 'auto'

[NoCoverage] EqualityOperator
src/core/StackItem.js:367:11
     } else if (this.tabPosition === 'bottom') {
       this.dropdownEl.style.bottom = (bottom + btnRect.height + 5) + 'px'
       this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
-      if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'
+      if (parseInt(this.dropdownEl.style.left) >= 0) this.dropdownEl.style.left = '5px'
       this.dropdownEl.style.top = 'auto'
       this.dropdownEl.style.right = 'auto'

[NoCoverage] BlockStatement
src/core/StackItem.js:370:12
       if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'
       this.dropdownEl.style.top = 'auto'
       this.dropdownEl.style.right = 'auto'
-    } else {
-      // Top (default)
-      this.dropdownEl.style.top = (top + btnRect.height + 5) + 'px'
-      this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
-      if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'
-      this.dropdownEl.style.right = 'auto'
-      this.dropdownEl.style.bottom = 'auto'
-    }
+    } else {}
   }
 

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:372:36
       this.dropdownEl.style.right = 'auto'
     } else {
       // Top (default)
-      this.dropdownEl.style.top = (top + btnRect.height + 5) + 'px'
+      this.dropdownEl.style.top = (top - btnRect.height + 5) + 'px'
       this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
       if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:372:36
       this.dropdownEl.style.right = 'auto'
     } else {
       // Top (default)
-      this.dropdownEl.style.top = (top + btnRect.height + 5) + 'px'
+      this.dropdownEl.style.top = (top + btnRect.height - 5) + 'px'
       this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
       if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:373:37
     } else {
       // Top (default)
       this.dropdownEl.style.top = (top + btnRect.height + 5) + 'px'
-      this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
+      this.dropdownEl.style.left = (left - btnRect.width - 150) + 'px' // Align right-ish
       if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'
       this.dropdownEl.style.right = 'auto'

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:373:37
     } else {
       // Top (default)
       this.dropdownEl.style.top = (top + btnRect.height + 5) + 'px'
-      this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
+      this.dropdownEl.style.left = (left + btnRect.width + 150) + 'px' // Align right-ish
       if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'
       this.dropdownEl.style.right = 'auto'

[NoCoverage] ConditionalExpression
src/core/StackItem.js:374:11
       // Top (default)
       this.dropdownEl.style.top = (top + btnRect.height + 5) + 'px'
       this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
-      if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'
+      if (true) this.dropdownEl.style.left = '5px'
       this.dropdownEl.style.right = 'auto'
       this.dropdownEl.style.bottom = 'auto'

[NoCoverage] StringLiteral
src/core/StackItem.js:375:37
       this.dropdownEl.style.top = (top + btnRect.height + 5) + 'px'
       this.dropdownEl.style.left = (left + btnRect.width - 150) + 'px' // Align right-ish
       if (parseInt(this.dropdownEl.style.left) < 0) this.dropdownEl.style.left = '5px'
-      this.dropdownEl.style.right = 'auto'
+      this.dropdownEl.style.right = ""
       this.dropdownEl.style.bottom = 'auto'
     }

[NoCoverage] BlockStatement
src/core/StackItem.js:380:21
     }
   }
 
-  renderDropdown () {
-    this.dropdownEl.innerHTML = ''
-    this.hiddenTabs.forEach(child => {
-      const item = Utils.createElement('div', 'tulweb-dropdown-item', this.dropdownEl)
-      item.textContent = child.config.title || child.config.componentName || 'Tab'
-      const selectTab = () => {
-        const index = this.children.indexOf(child)
-        this.layoutManager.setActiveStack(this)
-        this.setActive(index)
-        this.dropdownEl.style.display = 'none'
-      }
-      item.addEventListener('click', selectTab)
-      item.addEventListener('touchstart', selectTab, { passive: true })
-    })
-  }
+  renderDropdown () {}
 
   setActive (index) {

[NoCoverage] BlockStatement
src/core/StackItem.js:382:38
 
   renderDropdown () {
     this.dropdownEl.innerHTML = ''
-    this.hiddenTabs.forEach(child => {
-      const item = Utils.createElement('div', 'tulweb-dropdown-item', this.dropdownEl)
-      item.textContent = child.config.title || child.config.componentName || 'Tab'
-      const selectTab = () => {
-        const index = this.children.indexOf(child)
-        this.layoutManager.setActiveStack(this)
-        this.setActive(index)
-        this.dropdownEl.style.display = 'none'
-      }
-      item.addEventListener('click', selectTab)
-      item.addEventListener('touchstart', selectTab, { passive: true })
-    })
+    this.hiddenTabs.forEach(child => {})
   }
 

[NoCoverage] LogicalOperator
src/core/StackItem.js:384:26
     this.dropdownEl.innerHTML = ''
     this.hiddenTabs.forEach(child => {
       const item = Utils.createElement('div', 'tulweb-dropdown-item', this.dropdownEl)
-      item.textContent = child.config.title || child.config.componentName || 'Tab'
+      item.textContent = child.config.title && child.config.componentName || 'Tab'
       const selectTab = () => {
         const index = this.children.indexOf(child)

[NoCoverage] ConditionalExpression
src/core/StackItem.js:384:26
     this.dropdownEl.innerHTML = ''
     this.hiddenTabs.forEach(child => {
       const item = Utils.createElement('div', 'tulweb-dropdown-item', this.dropdownEl)
-      item.textContent = child.config.title || child.config.componentName || 'Tab'
+      item.textContent = false
       const selectTab = () => {
         const index = this.children.indexOf(child)

[NoCoverage] BlockStatement
src/core/StackItem.js:385:31
     this.hiddenTabs.forEach(child => {
       const item = Utils.createElement('div', 'tulweb-dropdown-item', this.dropdownEl)
       item.textContent = child.config.title || child.config.componentName || 'Tab'
-      const selectTab = () => {
-        const index = this.children.indexOf(child)
-        this.layoutManager.setActiveStack(this)
-        this.setActive(index)
-        this.dropdownEl.style.display = 'none'
-      }
+      const selectTab = () => {}
       item.addEventListener('click', selectTab)
       item.addEventListener('touchstart', selectTab, { passive: true })

[NoCoverage] StringLiteral
src/core/StackItem.js:391:29
         this.setActive(index)
         this.dropdownEl.style.display = 'none'
       }
-      item.addEventListener('click', selectTab)
+      item.addEventListener("", selectTab)
       item.addEventListener('touchstart', selectTab, { passive: true })
     })

[NoCoverage] BooleanLiteral
src/core/StackItem.js:392:65
         this.dropdownEl.style.display = 'none'
       }
       item.addEventListener('click', selectTab)
-      item.addEventListener('touchstart', selectTab, { passive: true })
+      item.addEventListener('touchstart', selectTab, { passive: false })
     })
   }

[NoCoverage] ObjectLiteral
src/core/StackItem.js:392:54
         this.dropdownEl.style.display = 'none'
       }
       item.addEventListener('click', selectTab)
-      item.addEventListener('touchstart', selectTab, { passive: true })
+      item.addEventListener('touchstart', selectTab, {})
     })
   }

[Survived] ConditionalExpression
src/core/StackItem.js:397:22
   }
 
   setActive (index) {
-    const hadFocus = document.activeElement && this.tabsEl && this.tabsEl.contains(document.activeElement)
+    const hadFocus = true
     const oldIndex = this.activeChildIndex
     this.activeChildIndex = index

[Survived] ConditionalExpression
src/core/StackItem.js:397:22
   }
 
   setActive (index) {
-    const hadFocus = document.activeElement && this.tabsEl && this.tabsEl.contains(document.activeElement)
+    const hadFocus = true && this.tabsEl.contains(document.activeElement)
     const oldIndex = this.activeChildIndex
     this.activeChildIndex = index

[Survived] ConditionalExpression
src/core/StackItem.js:401:9
     const oldIndex = this.activeChildIndex
     this.activeChildIndex = index
 
-    if (this.isMinimized) {
+    if (true) {
       this.toggleMinimize()
     } else {

[Survived] ConditionalExpression
src/core/StackItem.js:401:9
     const oldIndex = this.activeChildIndex
     this.activeChildIndex = index
 
-    if (this.isMinimized) {
+    if (false) {
       this.toggleMinimize()
     } else {

[Survived] BlockStatement
src/core/StackItem.js:403:12
 
     if (this.isMinimized) {
       this.toggleMinimize()
-    } else {
-      if (this.tabPosition !== 'headless') {
-        this._updateTabActiveState()
-      }
-      this.showActiveChild()
-
-      if ((hadFocus || oldIndex !== index) && this.tabPosition !== 'headless') {
-        setTimeout(() => {
-          const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-          if (tabs[this.activeChildIndex]) {
-            tabs[this.activeChildIndex].focus()
-          }
-        }, 0)
-      }
-      // Ensure we scroll only after the browser has laid out the new content
-      if (this.tabPosition !== 'headless') {
-        setTimeout(() => {
-          this.scrollTabIntoView(index)
-        }, 50)
-      }
-    }
+    } else {}
 
     this.layoutManager.emit('stackChanged', this)

[Survived] ConditionalExpression
src/core/StackItem.js:404:11
     if (this.isMinimized) {
       this.toggleMinimize()
     } else {
-      if (this.tabPosition !== 'headless') {
+      if (false) {
         this._updateTabActiveState()
       }

[Survived] EqualityOperator
src/core/StackItem.js:404:11
     if (this.isMinimized) {
       this.toggleMinimize()
     } else {
-      if (this.tabPosition !== 'headless') {
+      if (this.tabPosition === 'headless') {
         this._updateTabActiveState()
       }

[Survived] ConditionalExpression
src/core/StackItem.js:409:12
       }
       this.showActiveChild()
 
-      if ((hadFocus || oldIndex !== index) && this.tabPosition !== 'headless') {
+      if ((true) && this.tabPosition !== 'headless') {
         setTimeout(() => {
           const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')

[NoCoverage] EqualityOperator
src/core/StackItem.js:409:47
       }
       this.showActiveChild()
 
-      if ((hadFocus || oldIndex !== index) && this.tabPosition !== 'headless') {
+      if ((hadFocus || oldIndex !== index) && this.tabPosition === 'headless') {
         setTimeout(() => {
           const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')

[NoCoverage] BlockStatement
src/core/StackItem.js:410:26
       this.showActiveChild()
 
       if ((hadFocus || oldIndex !== index) && this.tabPosition !== 'headless') {
-        setTimeout(() => {
-          const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-          if (tabs[this.activeChildIndex]) {
-            tabs[this.activeChildIndex].focus()
-          }
-        }, 0)
+        setTimeout(() => {}, 0)
       }
       // Ensure we scroll only after the browser has laid out the new content
