[NoCoverage] BlockStatement
src/core/StackItem.js:412:44
       if ((hadFocus || oldIndex !== index) && this.tabPosition !== 'headless') {
         setTimeout(() => {
           const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
-          if (tabs[this.activeChildIndex]) {
-            tabs[this.activeChildIndex].focus()
-          }
+          if (tabs[this.activeChildIndex]) {}
         }, 0)
       }

[Survived] ConditionalExpression
src/core/StackItem.js:418:11
         }, 0)
       }
       // Ensure we scroll only after the browser has laid out the new content
-      if (this.tabPosition !== 'headless') {
+      if (true) {
         setTimeout(() => {
           this.scrollTabIntoView(index)

[NoCoverage] BlockStatement
src/core/StackItem.js:418:44
         }, 0)
       }
       // Ensure we scroll only after the browser has laid out the new content
-      if (this.tabPosition !== 'headless') {
-        setTimeout(() => {
-          this.scrollTabIntoView(index)
-        }, 50)
-      }
+      if (this.tabPosition !== 'headless') {}
     }
 

[NoCoverage] BlockStatement
src/core/StackItem.js:419:26
       }
       // Ensure we scroll only after the browser has laid out the new content
       if (this.tabPosition !== 'headless') {
-        setTimeout(() => {
-          this.scrollTabIntoView(index)
-        }, 50)
+        setTimeout(() => {}, 50)
       }
     }

[Survived] StringLiteral
src/core/StackItem.js:426:29
     }
 
     this.layoutManager.emit('stackChanged', this)
-    this.layoutManager.emit('stateChanged')
+    this.layoutManager.emit("")
   }
 

[Killed] ConditionalExpression
src/core/StackItem.js:430:9
   }
 
   scrollTabIntoView (index) {
-    if (!this.tabsEl) return
+    if (true) return
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
     const tab = tabs[index]
killedBy: StackItem scrollTabIntoView calls scrollTo on tabs container
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"behavior": "smooth", "left": Any<Number>}

Number of calls: 0

[Killed] BooleanLiteral
src/core/StackItem.js:430:9
   }
 
   scrollTabIntoView (index) {
-    if (!this.tabsEl) return
+    if (this.tabsEl) return
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
     const tab = tabs[index]
killedBy: StackItem scrollTabIntoView calls scrollTo on tabs container
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"behavior": "smooth", "left": Any<Number>}

Number of calls: 0

[Killed] StringLiteral
src/core/StackItem.js:431:47
 
   scrollTabIntoView (index) {
     if (!this.tabsEl) return
-    const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
+    const tabs = this.tabsEl.querySelectorAll("")
     const tab = tabs[index]
     if (!tab) return
killedBy: StackItem scrollTabIntoView calls scrollTo on tabs container
statusReason: SyntaxError: '' is not a valid selector

[Killed] BooleanLiteral
src/core/StackItem.js:433:9
     if (!this.tabsEl) return
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
     const tab = tabs[index]
-    if (!tab) return
+    if (tab) return
 
     const containerRect = this.tabsEl.getBoundingClientRect()
killedBy: StackItem scrollTabIntoView calls scrollTo on tabs container
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"behavior": "smooth", "left": Any<Number>}

Number of calls: 0

[Killed] ConditionalExpression
src/core/StackItem.js:433:9
     if (!this.tabsEl) return
     const tabs = this.tabsEl.querySelectorAll('.tulweb-tab')
     const tab = tabs[index]
-    if (!tab) return
+    if (true) return
 
     const containerRect = this.tabsEl.getBoundingClientRect()
killedBy: StackItem scrollTabIntoView calls scrollTo on tabs container
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"behavior": "smooth", "left": Any<Number>}

Number of calls: 0

[Killed] EqualityOperator
src/core/StackItem.js:437:55
 
     const containerRect = this.tabsEl.getBoundingClientRect()
     const tabRect = tab.getBoundingClientRect()
-    const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
+    const isVertical = this.tabPosition === 'left' || this.tabPosition !== 'right'
 
     const buffer = 20 // Slightly larger buffer for better visibility
killedBy: StackItem scrollTabIntoView calls scrollTo on tabs container
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"behavior": "smooth", "left": Any<Number>}
Received: {"behavior": "smooth", "top": -20}

Number of calls: 1

[Killed] ConditionalExpression
src/core/StackItem.js:437:24
 
     const containerRect = this.tabsEl.getBoundingClientRect()
     const tabRect = tab.getBoundingClientRect()
-    const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
+    const isVertical = true
 
     const buffer = 20 // Slightly larger buffer for better visibility
killedBy: StackItem scrollTabIntoView calls scrollTo on tabs container
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"behavior": "smooth", "left": Any<Number>}
Received: {"behavior": "smooth", "top": -20}

Number of calls: 1

[Killed] ConditionalExpression
src/core/StackItem.js:441:9
 
     const buffer = 20 // Slightly larger buffer for better visibility
 
-    if (isVertical) {
+    if (true) {
       // Check top overflow
       if (tabRect.top < containerRect.top + buffer) {
killedBy: StackItem scrollTabIntoView calls scrollTo on tabs container
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"behavior": "smooth", "left": Any<Number>}
Received: {"behavior": "smooth", "top": -20}

Number of calls: 1

[NoCoverage] BlockStatement
src/core/StackItem.js:441:21
 
     const buffer = 20 // Slightly larger buffer for better visibility
 
-    if (isVertical) {
-      // Check top overflow
-      if (tabRect.top < containerRect.top + buffer) {
-        this.tabsEl.scrollBy({ top: tabRect.top - containerRect.top - buffer, behavior: 'smooth' })
-      } else if (tabRect.bottom > containerRect.bottom - buffer) {
-        this.tabsEl.scrollBy({ top: tabRect.bottom - containerRect.bottom + buffer, behavior: 'smooth' })
-      }
-    } else {
+    if (isVertical) {} else {
       // Check left overflow
       if (tabRect.left < containerRect.left + buffer) {

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:443:25
 
     if (isVertical) {
       // Check top overflow
-      if (tabRect.top < containerRect.top + buffer) {
+      if (tabRect.top < containerRect.top - buffer) {
         this.tabsEl.scrollBy({ top: tabRect.top - containerRect.top - buffer, behavior: 'smooth' })
       } else if (tabRect.bottom > containerRect.bottom - buffer) {

[NoCoverage] ConditionalExpression
src/core/StackItem.js:443:11
 
     if (isVertical) {
       // Check top overflow
-      if (tabRect.top < containerRect.top + buffer) {
+      if (false) {
         this.tabsEl.scrollBy({ top: tabRect.top - containerRect.top - buffer, behavior: 'smooth' })
       } else if (tabRect.bottom > containerRect.bottom - buffer) {

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:444:37
     if (isVertical) {
       // Check top overflow
       if (tabRect.top < containerRect.top + buffer) {
-        this.tabsEl.scrollBy({ top: tabRect.top - containerRect.top - buffer, behavior: 'smooth' })
+        this.tabsEl.scrollBy({ top: tabRect.top - containerRect.top + buffer, behavior: 'smooth' })
       } else if (tabRect.bottom > containerRect.bottom - buffer) {
         this.tabsEl.scrollBy({ top: tabRect.bottom - containerRect.bottom + buffer, behavior: 'smooth' })

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:444:37
     if (isVertical) {
       // Check top overflow
       if (tabRect.top < containerRect.top + buffer) {
-        this.tabsEl.scrollBy({ top: tabRect.top - containerRect.top - buffer, behavior: 'smooth' })
+        this.tabsEl.scrollBy({ top: tabRect.top + containerRect.top - buffer, behavior: 'smooth' })
       } else if (tabRect.bottom > containerRect.bottom - buffer) {
         this.tabsEl.scrollBy({ top: tabRect.bottom - containerRect.bottom + buffer, behavior: 'smooth' })

[NoCoverage] EqualityOperator
src/core/StackItem.js:445:18
       // Check top overflow
       if (tabRect.top < containerRect.top + buffer) {
         this.tabsEl.scrollBy({ top: tabRect.top - containerRect.top - buffer, behavior: 'smooth' })
-      } else if (tabRect.bottom > containerRect.bottom - buffer) {
+      } else if (tabRect.bottom >= containerRect.bottom - buffer) {
         this.tabsEl.scrollBy({ top: tabRect.bottom - containerRect.bottom + buffer, behavior: 'smooth' })
       }

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:445:35
       // Check top overflow
       if (tabRect.top < containerRect.top + buffer) {
         this.tabsEl.scrollBy({ top: tabRect.top - containerRect.top - buffer, behavior: 'smooth' })
-      } else if (tabRect.bottom > containerRect.bottom - buffer) {
+      } else if (tabRect.bottom > containerRect.bottom + buffer) {
         this.tabsEl.scrollBy({ top: tabRect.bottom - containerRect.bottom + buffer, behavior: 'smooth' })
       }

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:446:37
       if (tabRect.top < containerRect.top + buffer) {
         this.tabsEl.scrollBy({ top: tabRect.top - containerRect.top - buffer, behavior: 'smooth' })
       } else if (tabRect.bottom > containerRect.bottom - buffer) {
-        this.tabsEl.scrollBy({ top: tabRect.bottom - containerRect.bottom + buffer, behavior: 'smooth' })
+        this.tabsEl.scrollBy({ top: tabRect.bottom + containerRect.bottom + buffer, behavior: 'smooth' })
       }
     } else {

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:446:37
       if (tabRect.top < containerRect.top + buffer) {
         this.tabsEl.scrollBy({ top: tabRect.top - containerRect.top - buffer, behavior: 'smooth' })
       } else if (tabRect.bottom > containerRect.bottom - buffer) {
-        this.tabsEl.scrollBy({ top: tabRect.bottom - containerRect.bottom + buffer, behavior: 'smooth' })
+        this.tabsEl.scrollBy({ top: tabRect.bottom - containerRect.bottom - buffer, behavior: 'smooth' })
       }
     } else {

[Killed] BlockStatement
src/core/StackItem.js:448:12
       } else if (tabRect.bottom > containerRect.bottom - buffer) {
         this.tabsEl.scrollBy({ top: tabRect.bottom - containerRect.bottom + buffer, behavior: 'smooth' })
       }
-    } else {
-      // Check left overflow
-      if (tabRect.left < containerRect.left + buffer) {
-        this.tabsEl.scrollBy({ left: tabRect.left - containerRect.left - buffer, behavior: 'smooth' })
-      } else if (tabRect.right > containerRect.right - buffer) {
-        this.tabsEl.scrollBy({ left: tabRect.right - containerRect.right + buffer, behavior: 'smooth' })
-      }
-    }
+    } else {}
   }
 
killedBy: StackItem scrollTabIntoView calls scrollTo on tabs container
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"behavior": "smooth", "left": Any<Number>}

Number of calls: 0

[Killed] BlockStatement
src/core/StackItem.js:450:55
       }
     } else {
       // Check left overflow
-      if (tabRect.left < containerRect.left + buffer) {
-        this.tabsEl.scrollBy({ left: tabRect.left - containerRect.left - buffer, behavior: 'smooth' })
-      } else if (tabRect.right > containerRect.right - buffer) {
+      if (tabRect.left < containerRect.left + buffer) {} else if (tabRect.right > containerRect.right - buffer) {
         this.tabsEl.scrollBy({ left: tabRect.right - containerRect.right + buffer, behavior: 'smooth' })
       }
killedBy: StackItem scrollTabIntoView calls scrollTo on tabs container
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"behavior": "smooth", "left": Any<Number>}

Number of calls: 0

[Survived] ArithmeticOperator
src/core/StackItem.js:450:26
       }
     } else {
       // Check left overflow
-      if (tabRect.left < containerRect.left + buffer) {
+      if (tabRect.left < containerRect.left - buffer) {
         this.tabsEl.scrollBy({ left: tabRect.left - containerRect.left - buffer, behavior: 'smooth' })
       } else if (tabRect.right > containerRect.right - buffer) {

[Survived] ArithmeticOperator
src/core/StackItem.js:451:38
     } else {
       // Check left overflow
       if (tabRect.left < containerRect.left + buffer) {
-        this.tabsEl.scrollBy({ left: tabRect.left - containerRect.left - buffer, behavior: 'smooth' })
+        this.tabsEl.scrollBy({ left: tabRect.left + containerRect.left - buffer, behavior: 'smooth' })
       } else if (tabRect.right > containerRect.right - buffer) {
         this.tabsEl.scrollBy({ left: tabRect.right - containerRect.right + buffer, behavior: 'smooth' })

[Survived] ArithmeticOperator
src/core/StackItem.js:451:38
     } else {
       // Check left overflow
       if (tabRect.left < containerRect.left + buffer) {
-        this.tabsEl.scrollBy({ left: tabRect.left - containerRect.left - buffer, behavior: 'smooth' })
+        this.tabsEl.scrollBy({ left: tabRect.left - containerRect.left + buffer, behavior: 'smooth' })
       } else if (tabRect.right > containerRect.right - buffer) {
         this.tabsEl.scrollBy({ left: tabRect.right - containerRect.right + buffer, behavior: 'smooth' })

[NoCoverage] ConditionalExpression
src/core/StackItem.js:452:18
       // Check left overflow
       if (tabRect.left < containerRect.left + buffer) {
         this.tabsEl.scrollBy({ left: tabRect.left - containerRect.left - buffer, behavior: 'smooth' })
-      } else if (tabRect.right > containerRect.right - buffer) {
+      } else if (false) {
         this.tabsEl.scrollBy({ left: tabRect.right - containerRect.right + buffer, behavior: 'smooth' })
       }

[NoCoverage] EqualityOperator
src/core/StackItem.js:452:18
       // Check left overflow
       if (tabRect.left < containerRect.left + buffer) {
         this.tabsEl.scrollBy({ left: tabRect.left - containerRect.left - buffer, behavior: 'smooth' })
-      } else if (tabRect.right > containerRect.right - buffer) {
+      } else if (tabRect.right >= containerRect.right - buffer) {
         this.tabsEl.scrollBy({ left: tabRect.right - containerRect.right + buffer, behavior: 'smooth' })
       }

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:453:38
       if (tabRect.left < containerRect.left + buffer) {
         this.tabsEl.scrollBy({ left: tabRect.left - containerRect.left - buffer, behavior: 'smooth' })
       } else if (tabRect.right > containerRect.right - buffer) {
-        this.tabsEl.scrollBy({ left: tabRect.right - containerRect.right + buffer, behavior: 'smooth' })
+        this.tabsEl.scrollBy({ left: tabRect.right + containerRect.right + buffer, behavior: 'smooth' })
       }
     }

[NoCoverage] ArithmeticOperator
src/core/StackItem.js:453:38
       if (tabRect.left < containerRect.left + buffer) {
         this.tabsEl.scrollBy({ left: tabRect.left - containerRect.left - buffer, behavior: 'smooth' })
       } else if (tabRect.right > containerRect.right - buffer) {
-        this.tabsEl.scrollBy({ left: tabRect.right - containerRect.right + buffer, behavior: 'smooth' })
+        this.tabsEl.scrollBy({ left: tabRect.right - containerRect.right - buffer, behavior: 'smooth' })
       }
     }

[Survived] ConditionalExpression
src/core/StackItem.js:459:28
   }
 
   showActiveChild () {
-    const isStackFocused = this.layoutManager.activeStack === this
+    const isStackFocused = false
 
     this.children.forEach((child, index) => {

[Survived] EqualityOperator
src/core/StackItem.js:459:28
   }
 
   showActiveChild () {
-    const isStackFocused = this.layoutManager.activeStack === this
+    const isStackFocused = this.layoutManager.activeStack !== this
 
     this.children.forEach((child, index) => {

[Survived] EqualityOperator
src/core/StackItem.js:462:30
     const isStackFocused = this.layoutManager.activeStack === this
 
     this.children.forEach((child, index) => {
-      const shouldBeActive = index === this.activeChildIndex
+      const shouldBeActive = index !== this.activeChildIndex
       const shouldBeFocused = shouldBeActive && isStackFocused
 

[Survived] ConditionalExpression
src/core/StackItem.js:462:30
     const isStackFocused = this.layoutManager.activeStack === this
 
     this.children.forEach((child, index) => {
-      const shouldBeActive = index === this.activeChildIndex
+      const shouldBeActive = false
       const shouldBeFocused = shouldBeActive && isStackFocused
 

[Survived] LogicalOperator
src/core/StackItem.js:463:31
 
     this.children.forEach((child, index) => {
       const shouldBeActive = index === this.activeChildIndex
-      const shouldBeFocused = shouldBeActive && isStackFocused
+      const shouldBeFocused = shouldBeActive || isStackFocused
 
       if (shouldBeActive) {

[Survived] ConditionalExpression
src/core/StackItem.js:463:31
 
     this.children.forEach((child, index) => {
       const shouldBeActive = index === this.activeChildIndex
-      const shouldBeFocused = shouldBeActive && isStackFocused
+      const shouldBeFocused = true
 
       if (shouldBeActive) {

[Survived] ConditionalExpression
src/core/StackItem.js:465:11
       const shouldBeActive = index === this.activeChildIndex
       const shouldBeFocused = shouldBeActive && isStackFocused
 
-      if (shouldBeActive) {
+      if (false) {
         child.element.style.display = 'block'
       } else {

[Survived] BlockStatement
src/core/StackItem.js:465:27
       const shouldBeActive = index === this.activeChildIndex
       const shouldBeFocused = shouldBeActive && isStackFocused
 
-      if (shouldBeActive) {
-        child.element.style.display = 'block'
-      } else {
+      if (shouldBeActive) {} else {
         child.element.style.display = 'none'
       }

[Survived] BlockStatement
src/core/StackItem.js:467:14
 
       if (shouldBeActive) {
         child.element.style.display = 'block'
-      } else {
-        child.element.style.display = 'none'
-      }
+      } else {}
 
       if (shouldBeActive !== child._isActive) {

[Survived] StringLiteral
src/core/StackItem.js:468:39
       if (shouldBeActive) {
         child.element.style.display = 'block'
       } else {
-        child.element.style.display = 'none'
+        child.element.style.display = ""
       }
 

[Survived] BlockStatement
src/core/StackItem.js:471:47
         child.element.style.display = 'none'
       }
 
-      if (shouldBeActive !== child._isActive) {
-        child._isActive = shouldBeActive
-        if (shouldBeActive) {
-          child.emit('active')
-          if (this.layoutManager.settings && this.layoutManager.settings.onlyResizeActiveTabs) {
-            child.emit('resize')
-          }
-        } else child.emit('inactive')
-      }
+      if (shouldBeActive !== child._isActive) {}
 
       if (shouldBeFocused !== child._isFocused) {

[Survived] ConditionalExpression
src/core/StackItem.js:471:11
         child.element.style.display = 'none'
       }
 
-      if (shouldBeActive !== child._isActive) {
+      if (true) {
         child._isActive = shouldBeActive
         if (shouldBeActive) {

[Survived] ConditionalExpression
src/core/StackItem.js:473:13
 
       if (shouldBeActive !== child._isActive) {
         child._isActive = shouldBeActive
-        if (shouldBeActive) {
+        if (true) {
           child.emit('active')
           if (this.layoutManager.settings && this.layoutManager.settings.onlyResizeActiveTabs) {

[Survived] BlockStatement
src/core/StackItem.js:473:29
 
       if (shouldBeActive !== child._isActive) {
         child._isActive = shouldBeActive
-        if (shouldBeActive) {
-          child.emit('active')
-          if (this.layoutManager.settings && this.layoutManager.settings.onlyResizeActiveTabs) {
-            child.emit('resize')
-          }
-        } else child.emit('inactive')
+        if (shouldBeActive) {} else child.emit('inactive')
       }
 

[Survived] LogicalOperator
src/core/StackItem.js:475:15
         child._isActive = shouldBeActive
         if (shouldBeActive) {
           child.emit('active')
-          if (this.layoutManager.settings && this.layoutManager.settings.onlyResizeActiveTabs) {
+          if (this.layoutManager.settings || this.layoutManager.settings.onlyResizeActiveTabs) {
             child.emit('resize')
           }

[Survived] ConditionalExpression
src/core/StackItem.js:475:15
         child._isActive = shouldBeActive
         if (shouldBeActive) {
           child.emit('active')
-          if (this.layoutManager.settings && this.layoutManager.settings.onlyResizeActiveTabs) {
+          if (true) {
             child.emit('resize')
           }

[NoCoverage] BlockStatement
src/core/StackItem.js:481:49
         } else child.emit('inactive')
       }
 
-      if (shouldBeFocused !== child._isFocused) {
-        child._isFocused = shouldBeFocused
-        if (shouldBeFocused) child.emit('focus')
-        else child.emit('defocus')
-      }
+      if (shouldBeFocused !== child._isFocused) {}
     })
   }

[Survived] EqualityOperator
src/core/StackItem.js:481:11
         } else child.emit('inactive')
       }
 
-      if (shouldBeFocused !== child._isFocused) {
+      if (shouldBeFocused === child._isFocused) {
         child._isFocused = shouldBeFocused
         if (shouldBeFocused) child.emit('focus')

[NoCoverage] ConditionalExpression
src/core/StackItem.js:483:13
 
       if (shouldBeFocused !== child._isFocused) {
         child._isFocused = shouldBeFocused
-        if (shouldBeFocused) child.emit('focus')
+        if (true) child.emit('focus')
         else child.emit('defocus')
       }

[NoCoverage] ConditionalExpression
src/core/StackItem.js:483:13
 
       if (shouldBeFocused !== child._isFocused) {
         child._isFocused = shouldBeFocused
-        if (shouldBeFocused) child.emit('focus')
+        if (false) child.emit('focus')
         else child.emit('defocus')
       }

[NoCoverage] StringLiteral
src/core/StackItem.js:484:25
       if (shouldBeFocused !== child._isFocused) {
         child._isFocused = shouldBeFocused
         if (shouldBeFocused) child.emit('focus')
-        else child.emit('defocus')
+        else child.emit("")
       }
     })

[Survived] BlockStatement
src/core/StackItem.js:492:27
   updateFlex () {
     super.updateFlex()
 
-    if (this.isMinimized) {
-      this.element.style.flex = '0 0 auto'
-      const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
-      if (isVertical) {
-        this.element.style.width = 'calc(var(--tulweb-tab-height) + 2px)'
-        this.element.style.height = ''
-      } else {
-        this.element.style.height = 'calc(var(--tulweb-tab-height) + 2px)'
-        this.element.style.width = ''
-      }
-    } else {
+    if (this.isMinimized) {} else {
       this.element.style.width = ''
       this.element.style.height = ''

[Survived] StringLiteral
src/core/StackItem.js:493:33
     super.updateFlex()
 
     if (this.isMinimized) {
-      this.element.style.flex = '0 0 auto'
+      this.element.style.flex = ""
       const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
       if (isVertical) {

[Survived] LogicalOperator
src/core/StackItem.js:494:26
 
     if (this.isMinimized) {
       this.element.style.flex = '0 0 auto'
-      const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
+      const isVertical = this.tabPosition === 'left' && this.tabPosition === 'right'
       if (isVertical) {
         this.element.style.width = 'calc(var(--tulweb-tab-height) + 2px)'

[Survived] EqualityOperator
src/core/StackItem.js:494:26
 
     if (this.isMinimized) {
       this.element.style.flex = '0 0 auto'
-      const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
+      const isVertical = this.tabPosition !== 'left' || this.tabPosition === 'right'
       if (isVertical) {
         this.element.style.width = 'calc(var(--tulweb-tab-height) + 2px)'

[Survived] ConditionalExpression
src/core/StackItem.js:495:11
     if (this.isMinimized) {
       this.element.style.flex = '0 0 auto'
       const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
-      if (isVertical) {
+      if (true) {
         this.element.style.width = 'calc(var(--tulweb-tab-height) + 2px)'
         this.element.style.height = ''

[NoCoverage] BlockStatement
src/core/StackItem.js:495:23
     if (this.isMinimized) {
       this.element.style.flex = '0 0 auto'
       const isVertical = this.tabPosition === 'left' || this.tabPosition === 'right'
-      if (isVertical) {
-        this.element.style.width = 'calc(var(--tulweb-tab-height) + 2px)'
-        this.element.style.height = ''
-      } else {
+      if (isVertical) {} else {
         this.element.style.height = 'calc(var(--tulweb-tab-height) + 2px)'
         this.element.style.width = ''

[Survived] BlockStatement
src/core/StackItem.js:498:14
       if (isVertical) {
         this.element.style.width = 'calc(var(--tulweb-tab-height) + 2px)'
         this.element.style.height = ''
-      } else {
-        this.element.style.height = 'calc(var(--tulweb-tab-height) + 2px)'
-        this.element.style.width = ''
-      }
+      } else {}
     } else {
       this.element.style.width = ''

[Survived] StringLiteral
src/core/StackItem.js:499:37
         this.element.style.width = 'calc(var(--tulweb-tab-height) + 2px)'
         this.element.style.height = ''
       } else {
-        this.element.style.height = 'calc(var(--tulweb-tab-height) + 2px)'
+        this.element.style.height = ""
         this.element.style.width = ''
       }

[Survived] BlockStatement
src/core/StackItem.js:502:12
         this.element.style.height = 'calc(var(--tulweb-tab-height) + 2px)'
         this.element.style.width = ''
       }
-    } else {
-      this.element.style.width = ''
-      this.element.style.height = ''
-    }
+    } else {}
 
     const onlyActive = this.layoutManager.settings && this.layoutManager.settings.onlyResizeActiveTabs

[Survived] LogicalOperator
src/core/StackItem.js:507:24
       this.element.style.height = ''
     }
 
-    const onlyActive = this.layoutManager.settings && this.layoutManager.settings.onlyResizeActiveTabs
+    const onlyActive = this.layoutManager.settings || this.layoutManager.settings.onlyResizeActiveTabs
 
     // Propagate resize events to the leaf components so they can react to dimensions

[Survived] ConditionalExpression
src/core/StackItem.js:507:24
       this.element.style.height = ''
     }
 
-    const onlyActive = this.layoutManager.settings && this.layoutManager.settings.onlyResizeActiveTabs
+    const onlyActive = true
 
     // Propagate resize events to the leaf components so they can react to dimensions

[Survived] BlockStatement
src/core/StackItem.js:510:45
     const onlyActive = this.layoutManager.settings && this.layoutManager.settings.onlyResizeActiveTabs
 
     // Propagate resize events to the leaf components so they can react to dimensions
-    this.children.forEach((child, index) => {
-      if (onlyActive && index !== this.activeChildIndex) return
-      child.emit('resize')
-    })
+    this.children.forEach((child, index) => {})
   }
 

[Survived] ConditionalExpression
src/core/StackItem.js:511:11
 
     // Propagate resize events to the leaf components so they can react to dimensions
     this.children.forEach((child, index) => {
-      if (onlyActive && index !== this.activeChildIndex) return
+      if (true) return
       child.emit('resize')
     })

[Survived] LogicalOperator
src/core/StackItem.js:511:11
 
     // Propagate resize events to the leaf components so they can react to dimensions
     this.children.forEach((child, index) => {
-      if (onlyActive && index !== this.activeChildIndex) return
+      if (onlyActive || index !== this.activeChildIndex) return
       child.emit('resize')
     })

[Killed] BlockStatement
src/core/StackItem.js:516:21
     })
   }
 
-  toggleMinimize () {
-    if (this.isMaximized) {
-      this.toggleMaximize()
-    }
-    this.isMinimized = !this.isMinimized
-    if (this.isMinimized) {
-      this.element.classList.add('minimized')
-    } else {
-      this.element.classList.remove('minimized')
-      this.element.classList.remove('previewing')
-    }
-    this.updateFlex()
-    if (this.parent) this.parent.updateLayout()
-  }
+  toggleMinimize () {}
 
   toggleMaximize () {
killedBy: PopoutManager Unit Tests popped-out stack is always maximized even when previously minimized
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
src/core/StackItem.js:517:9
   }
 
   toggleMinimize () {
-    if (this.isMaximized) {
+    if (false) {
       this.toggleMaximize()
     }

[Timeout] ConditionalExpression
src/core/StackItem.js:517:9
   }
 
   toggleMinimize () {
-    if (this.isMaximized) {
+    if (true) {
       this.toggleMaximize()
     }

[Killed] BooleanLiteral
src/core/StackItem.js:520:24
     if (this.isMaximized) {
       this.toggleMaximize()
     }
-    this.isMinimized = !this.isMinimized
+    this.isMinimized = this.isMinimized
     if (this.isMinimized) {
       this.element.classList.add('minimized')
killedBy: StackItem toggles minimize state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
