[Killed] ConditionalExpression
src/core/StackItem.js:521:9
       this.toggleMaximize()
     }
     this.isMinimized = !this.isMinimized
-    if (this.isMinimized) {
+    if (true) {
       this.element.classList.add('minimized')
     } else {
killedBy: StackItem toggles minimize state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/core/StackItem.js:521:27
       this.toggleMaximize()
     }
     this.isMinimized = !this.isMinimized
-    if (this.isMinimized) {
-      this.element.classList.add('minimized')
-    } else {
+    if (this.isMinimized) {} else {
       this.element.classList.remove('minimized')
       this.element.classList.remove('previewing')
killedBy: StackItem toggles minimize state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/core/StackItem.js:523:12
     this.isMinimized = !this.isMinimized
     if (this.isMinimized) {
       this.element.classList.add('minimized')
-    } else {
-      this.element.classList.remove('minimized')
-      this.element.classList.remove('previewing')
-    }
+    } else {}
     this.updateFlex()
     if (this.parent) this.parent.updateLayout()
killedBy: StackItem toggles minimize state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/core/StackItem.js:528:9
       this.element.classList.remove('previewing')
     }
     this.updateFlex()
-    if (this.parent) this.parent.updateLayout()
+    if (true) this.parent.updateLayout()
   }
 
killedBy: StackItem toggles minimize state
statusReason: TypeError: Cannot read properties of null (reading 'updateLayout')

[Survived] ConditionalExpression
src/core/StackItem.js:528:9
       this.element.classList.remove('previewing')
     }
     this.updateFlex()
-    if (this.parent) this.parent.updateLayout()
+    if (false) this.parent.updateLayout()
   }
 

[NoCoverage] BlockStatement
src/core/StackItem.js:531:21
     if (this.parent) this.parent.updateLayout()
   }
 
-  toggleMaximize () {
-    if (this.isMinimized) {
-      this.toggleMinimize()
-    }
-    this.isMaximized = !this.isMaximized
-    if (this.isMaximized) {
-      this.element.classList.add('maximized')
-      if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
-    } else {
-      this.element.classList.remove('maximized')
-      if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
-    }
-  }
+  toggleMaximize () {}
 
   closeAll () {

[NoCoverage] BlockStatement
src/core/StackItem.js:532:27
   }
 
   toggleMaximize () {
-    if (this.isMinimized) {
-      this.toggleMinimize()
-    }
+    if (this.isMinimized) {}
     this.isMaximized = !this.isMaximized
     if (this.isMaximized) {

[NoCoverage] ConditionalExpression
src/core/StackItem.js:532:9
   }
 
   toggleMaximize () {
-    if (this.isMinimized) {
+    if (false) {
       this.toggleMinimize()
     }

[NoCoverage] BooleanLiteral
src/core/StackItem.js:535:24
     if (this.isMinimized) {
       this.toggleMinimize()
     }
-    this.isMaximized = !this.isMaximized
+    this.isMaximized = this.isMaximized
     if (this.isMaximized) {
       this.element.classList.add('maximized')

[NoCoverage] BlockStatement
src/core/StackItem.js:536:27
       this.toggleMinimize()
     }
     this.isMaximized = !this.isMaximized
-    if (this.isMaximized) {
-      this.element.classList.add('maximized')
-      if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
-    } else {
+    if (this.isMaximized) {} else {
       this.element.classList.remove('maximized')
       if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'

[NoCoverage] ConditionalExpression
src/core/StackItem.js:536:9
       this.toggleMinimize()
     }
     this.isMaximized = !this.isMaximized
-    if (this.isMaximized) {
+    if (true) {
       this.element.classList.add('maximized')
       if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'

[NoCoverage] ConditionalExpression
src/core/StackItem.js:538:11
     this.isMaximized = !this.isMaximized
     if (this.isMaximized) {
       this.element.classList.add('maximized')
-      if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
+      if (false) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
     } else {
       this.element.classList.remove('maximized')

[NoCoverage] ConditionalExpression
src/core/StackItem.js:538:11
     this.isMaximized = !this.isMaximized
     if (this.isMaximized) {
       this.element.classList.add('maximized')
-      if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
+      if (true) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
     } else {
       this.element.classList.remove('maximized')

[NoCoverage] BlockStatement
src/core/StackItem.js:539:12
     if (this.isMaximized) {
       this.element.classList.add('maximized')
       if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
-    } else {
-      this.element.classList.remove('maximized')
-      if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
-    }
+    } else {}
   }
 

[NoCoverage] StringLiteral
src/core/StackItem.js:540:37
       this.element.classList.add('maximized')
       if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
     } else {
-      this.element.classList.remove('maximized')
+      this.element.classList.remove("")
       if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
     }

[NoCoverage] ConditionalExpression
src/core/StackItem.js:541:11
       if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
     } else {
       this.element.classList.remove('maximized')
-      if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
+      if (false) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
     }
   }

[NoCoverage] ConditionalExpression
src/core/StackItem.js:541:11
       if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h4v2H6v4H4V4zm16 0h-4v2h2v4h2V4zM4 20h4v-2H6v-4H4v6zm16 0h-4v-2h2v-4h2v6z"/></svg>'
     } else {
       this.element.classList.remove('maximized')
-      if (this.maxBtn) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
+      if (true) this.maxBtn.innerHTML = '<svg viewBox="0 0 24 24"><path d="M4 4h16v16H4V4zm2 2v12h12V6H6z"/></svg>'
     }
   }

[NoCoverage] BlockStatement
src/core/StackItem.js:545:15
     }
   }
 
-  closeAll () {
-    const kids = [...this.children].filter(c => c.config.closeable !== false)
-    for (const child of kids) {
-      if (child.destroy() === false) break
-    }
-    if (this.children.length === 0) {
-      this.layoutManager._cleanupEmptyStack(this)
-    }
-  }
+  closeAll () {}
 
   toConfig () {

[NoCoverage] MethodExpression
src/core/StackItem.js:546:18
   }
 
   closeAll () {
-    const kids = [...this.children].filter(c => c.config.closeable !== false)
+    const kids = [...this.children]
     for (const child of kids) {
       if (child.destroy() === false) break

[NoCoverage] ConditionalExpression
src/core/StackItem.js:546:49
   }
 
   closeAll () {
-    const kids = [...this.children].filter(c => c.config.closeable !== false)
+    const kids = [...this.children].filter(c => true)
     for (const child of kids) {
       if (child.destroy() === false) break

[NoCoverage] BlockStatement
src/core/StackItem.js:547:31
 
   closeAll () {
     const kids = [...this.children].filter(c => c.config.closeable !== false)
-    for (const child of kids) {
-      if (child.destroy() === false) break
-    }
+    for (const child of kids) {}
     if (this.children.length === 0) {
       this.layoutManager._cleanupEmptyStack(this)

[NoCoverage] ConditionalExpression
src/core/StackItem.js:548:11
   closeAll () {
     const kids = [...this.children].filter(c => c.config.closeable !== false)
     for (const child of kids) {
-      if (child.destroy() === false) break
+      if (true) break
     }
     if (this.children.length === 0) {

[NoCoverage] EqualityOperator
src/core/StackItem.js:548:11
   closeAll () {
     const kids = [...this.children].filter(c => c.config.closeable !== false)
     for (const child of kids) {
-      if (child.destroy() === false) break
+      if (child.destroy() !== false) break
     }
     if (this.children.length === 0) {

[NoCoverage] EqualityOperator
src/core/StackItem.js:550:9
     for (const child of kids) {
       if (child.destroy() === false) break
     }
-    if (this.children.length === 0) {
+    if (this.children.length !== 0) {
       this.layoutManager._cleanupEmptyStack(this)
     }

[NoCoverage] BlockStatement
src/core/StackItem.js:550:37
     for (const child of kids) {
       if (child.destroy() === false) break
     }
-    if (this.children.length === 0) {
-      this.layoutManager._cleanupEmptyStack(this)
-    }
+    if (this.children.length === 0) {}
   }
 

[Killed] BlockStatement
src/core/StackItem.js:555:15
     }
   }
 
-  toConfig () {
-    const res = super.toConfig()
-    res.activeChildIndex = this.activeChildIndex
-    if (this.tabPosition !== 'top') {
-      res.tabPosition = this.tabPosition
-    }
-    if (this.isMinimized) {
-      res.minimized = true
-    }
-    if (this.isMaximized) {
-      res.isMaximized = true
-    }
-    if (!this.displayMinimizeButton) res.displayMinimizeButton = false
-    if (!this.displayMaximizeButton) res.displayMaximizeButton = false
-    if (!this.displayCloseButton) res.displayCloseButton = false
-    if (!this.displayPopoutButton) res.displayPopoutButton = false
-    if (this.preventEmptyClosure) res.preventEmptyClosure = true
-    res.content = this.children.map(c => c.toConfig())
-    return res
-  }
+  toConfig () {}
 }
 
killedBy: StackItem serializes to correct config
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Survived] ConditionalExpression
src/core/StackItem.js:558:9
   toConfig () {
     const res = super.toConfig()
     res.activeChildIndex = this.activeChildIndex
-    if (this.tabPosition !== 'top') {
+    if (true) {
       res.tabPosition = this.tabPosition
     }

[Survived] ConditionalExpression
src/core/StackItem.js:558:9
   toConfig () {
     const res = super.toConfig()
     res.activeChildIndex = this.activeChildIndex
-    if (this.tabPosition !== 'top') {
+    if (false) {
       res.tabPosition = this.tabPosition
     }

[Survived] ConditionalExpression
src/core/StackItem.js:561:9
     if (this.tabPosition !== 'top') {
       res.tabPosition = this.tabPosition
     }
-    if (this.isMinimized) {
+    if (true) {
       res.minimized = true
     }

[Survived] ConditionalExpression
src/core/StackItem.js:561:9
     if (this.tabPosition !== 'top') {
       res.tabPosition = this.tabPosition
     }
-    if (this.isMinimized) {
+    if (false) {
       res.minimized = true
     }

[NoCoverage] BooleanLiteral
src/core/StackItem.js:562:23
       res.tabPosition = this.tabPosition
     }
     if (this.isMinimized) {
-      res.minimized = true
+      res.minimized = false
     }
     if (this.isMaximized) {

[NoCoverage] BlockStatement
src/core/StackItem.js:564:27
     if (this.isMinimized) {
       res.minimized = true
     }
-    if (this.isMaximized) {
-      res.isMaximized = true
-    }
+    if (this.isMaximized) {}
     if (!this.displayMinimizeButton) res.displayMinimizeButton = false
     if (!this.displayMaximizeButton) res.displayMaximizeButton = false

[Survived] ConditionalExpression
src/core/StackItem.js:564:9
     if (this.isMinimized) {
       res.minimized = true
     }
-    if (this.isMaximized) {
+    if (false) {
       res.isMaximized = true
     }

[NoCoverage] BooleanLiteral
src/core/StackItem.js:565:25
       res.minimized = true
     }
     if (this.isMaximized) {
-      res.isMaximized = true
+      res.isMaximized = false
     }
     if (!this.displayMinimizeButton) res.displayMinimizeButton = false

[Survived] ConditionalExpression
src/core/StackItem.js:567:9
     if (this.isMaximized) {
       res.isMaximized = true
     }
-    if (!this.displayMinimizeButton) res.displayMinimizeButton = false
+    if (false) res.displayMinimizeButton = false
     if (!this.displayMaximizeButton) res.displayMaximizeButton = false
     if (!this.displayCloseButton) res.displayCloseButton = false

[Survived] BooleanLiteral
src/core/StackItem.js:567:9
     if (this.isMaximized) {
       res.isMaximized = true
     }
-    if (!this.displayMinimizeButton) res.displayMinimizeButton = false
+    if (this.displayMinimizeButton) res.displayMinimizeButton = false
     if (!this.displayMaximizeButton) res.displayMaximizeButton = false
     if (!this.displayCloseButton) res.displayCloseButton = false

[Survived] ConditionalExpression
src/core/StackItem.js:568:9
       res.isMaximized = true
     }
     if (!this.displayMinimizeButton) res.displayMinimizeButton = false
-    if (!this.displayMaximizeButton) res.displayMaximizeButton = false
+    if (false) res.displayMaximizeButton = false
     if (!this.displayCloseButton) res.displayCloseButton = false
     if (!this.displayPopoutButton) res.displayPopoutButton = false

[NoCoverage] BooleanLiteral
src/core/StackItem.js:568:66
       res.isMaximized = true
     }
     if (!this.displayMinimizeButton) res.displayMinimizeButton = false
-    if (!this.displayMaximizeButton) res.displayMaximizeButton = false
+    if (!this.displayMaximizeButton) res.displayMaximizeButton = true
     if (!this.displayCloseButton) res.displayCloseButton = false
     if (!this.displayPopoutButton) res.displayPopoutButton = false

[Survived] ConditionalExpression
src/core/StackItem.js:569:9
     }
     if (!this.displayMinimizeButton) res.displayMinimizeButton = false
     if (!this.displayMaximizeButton) res.displayMaximizeButton = false
-    if (!this.displayCloseButton) res.displayCloseButton = false
+    if (false) res.displayCloseButton = false
     if (!this.displayPopoutButton) res.displayPopoutButton = false
     if (this.preventEmptyClosure) res.preventEmptyClosure = true

[NoCoverage] BooleanLiteral
src/core/StackItem.js:569:60
     }
     if (!this.displayMinimizeButton) res.displayMinimizeButton = false
     if (!this.displayMaximizeButton) res.displayMaximizeButton = false
-    if (!this.displayCloseButton) res.displayCloseButton = false
+    if (!this.displayCloseButton) res.displayCloseButton = true
     if (!this.displayPopoutButton) res.displayPopoutButton = false
     if (this.preventEmptyClosure) res.preventEmptyClosure = true

[NoCoverage] BooleanLiteral
src/core/StackItem.js:570:62
     if (!this.displayMinimizeButton) res.displayMinimizeButton = false
     if (!this.displayMaximizeButton) res.displayMaximizeButton = false
     if (!this.displayCloseButton) res.displayCloseButton = false
-    if (!this.displayPopoutButton) res.displayPopoutButton = false
+    if (!this.displayPopoutButton) res.displayPopoutButton = true
     if (this.preventEmptyClosure) res.preventEmptyClosure = true
     res.content = this.children.map(c => c.toConfig())

[Survived] ConditionalExpression
src/core/StackItem.js:570:9
     if (!this.displayMinimizeButton) res.displayMinimizeButton = false
     if (!this.displayMaximizeButton) res.displayMaximizeButton = false
     if (!this.displayCloseButton) res.displayCloseButton = false
-    if (!this.displayPopoutButton) res.displayPopoutButton = false
+    if (false) res.displayPopoutButton = false
     if (this.preventEmptyClosure) res.preventEmptyClosure = true
     res.content = this.children.map(c => c.toConfig())

[NoCoverage] BooleanLiteral
src/core/StackItem.js:571:61
     if (!this.displayMaximizeButton) res.displayMaximizeButton = false
     if (!this.displayCloseButton) res.displayCloseButton = false
     if (!this.displayPopoutButton) res.displayPopoutButton = false
-    if (this.preventEmptyClosure) res.preventEmptyClosure = true
+    if (this.preventEmptyClosure) res.preventEmptyClosure = false
     res.content = this.children.map(c => c.toConfig())
     return res

[Survived] ConditionalExpression
src/core/StackItem.js:571:9
     if (!this.displayMaximizeButton) res.displayMaximizeButton = false
     if (!this.displayCloseButton) res.displayCloseButton = false
     if (!this.displayPopoutButton) res.displayPopoutButton = false
-    if (this.preventEmptyClosure) res.preventEmptyClosure = true
+    if (false) res.preventEmptyClosure = true
     res.content = this.children.map(c => c.toConfig())
     return res

[Killed] ArrowFunction
src/core/StackItem.js:572:37
     if (!this.displayCloseButton) res.displayCloseButton = false
     if (!this.displayPopoutButton) res.displayPopoutButton = false
     if (this.preventEmptyClosure) res.preventEmptyClosure = true
-    res.content = this.children.map(c => c.toConfig())
+    res.content = this.children.map(() => undefined)
     return res
   }
killedBy: StackItem serializes to correct config
statusReason: TypeError: Cannot read properties of undefined (reading 'componentName')
