[Killed] BlockStatement
src/utils/EventEmitter.js:2:18
 export class EventEmitter {
-  constructor () {
-    this._listeners = {}
-  }
+  constructor () {}
 
   on (event, callback) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: Cannot read properties of undefined (reading 'componentCreated')

[Killed] BlockStatement
src/utils/EventEmitter.js:6:24
     this._listeners = {}
   }
 
-  on (event, callback) {
-    if (!this._listeners[event]) this._listeners[event] = []
-    this._listeners[event].push(callback)
-  }
+  on (event, callback) {}
 
   off (event, callback) {
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

                <div … />
                <div class="tulweb-empty-state">
                    <svg … />
                    <div … />

[Killed] ConditionalExpression
src/utils/EventEmitter.js:7:9
   }
 
   on (event, callback) {
-    if (!this._listeners[event]) this._listeners[event] = []
+    if (false) this._listeners[event] = []
     this._listeners[event].push(callback)
   }
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BooleanLiteral
src/utils/EventEmitter.js:7:9
   }
 
   on (event, callback) {
-    if (!this._listeners[event]) this._listeners[event] = []
+    if (this._listeners[event]) this._listeners[event] = []
     this._listeners[event].push(callback)
   }
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/utils/EventEmitter.js:11:25
     this._listeners[event].push(callback)
   }
 
-  off (event, callback) {
-    if (!this._listeners[event]) return
-    this._listeners[event] = this._listeners[event].filter(cb => cb !== callback)
-  }
+  off (event, callback) {}
 
   once (event, callback) {
killedBy: LayoutManager once() listener fires only once
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BooleanLiteral
src/utils/EventEmitter.js:12:9
   }
 
   off (event, callback) {
-    if (!this._listeners[event]) return
+    if (this._listeners[event]) return
     this._listeners[event] = this._listeners[event].filter(cb => cb !== callback)
   }
killedBy: LayoutManager once() listener fires only once
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] ConditionalExpression
src/utils/EventEmitter.js:12:9
   }
 
   off (event, callback) {
-    if (!this._listeners[event]) return
+    if (true) return
     this._listeners[event] = this._listeners[event].filter(cb => cb !== callback)
   }
killedBy: LayoutManager once() listener fires only once
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] EqualityOperator
src/utils/EventEmitter.js:13:66
 
   off (event, callback) {
     if (!this._listeners[event]) return
-    this._listeners[event] = this._listeners[event].filter(cb => cb !== callback)
+    this._listeners[event] = this._listeners[event].filter(cb => cb === callback)
   }
 
killedBy: LayoutManager once() listener fires only once
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] ConditionalExpression
src/utils/EventEmitter.js:13:66
 
   off (event, callback) {
     if (!this._listeners[event]) return
-    this._listeners[event] = this._listeners[event].filter(cb => cb !== callback)
+    this._listeners[event] = this._listeners[event].filter(cb => true)
   }
 
killedBy: LayoutManager once() listener fires only once
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
src/utils/EventEmitter.js:16:26
     this._listeners[event] = this._listeners[event].filter(cb => cb !== callback)
   }
 
-  once (event, callback) {
-    const wrapper = (...args) => {
-      this.off(event, wrapper)
-      callback(...args)
-    }
-    this.on(event, wrapper)
-  }
+  once (event, callback) {}
 
   emit (event, ...args) {
killedBy: LayoutManager once() listener fires only once
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/utils/EventEmitter.js:17:34
   }
 
   once (event, callback) {
-    const wrapper = (...args) => {
-      this.off(event, wrapper)
-      callback(...args)
-    }
+    const wrapper = (...args) => {}
     this.on(event, wrapper)
   }
killedBy: LayoutManager once() listener fires only once
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/utils/EventEmitter.js:24:25
     this.on(event, wrapper)
   }
 
-  emit (event, ...args) {
-    let result = true
-    if (this._listeners[event]) {
-      const snapshot = [...this._listeners[event]]
-      for (const cb of snapshot) {
-        if (cb(...args) === false) result = false
-      }
-    }
-    return result
-  }
+  emit (event, ...args) {}
 }
 
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

                <div … />
                <div class="tulweb-empty-state">
                    <svg … />
                    <div … />

[Killed] BooleanLiteral
src/utils/EventEmitter.js:25:18
   }
 
   emit (event, ...args) {
-    let result = true
+    let result = false
     if (this._listeners[event]) {
       const snapshot = [...this._listeners[event]]
killedBy: StackItem adds and removes component children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
src/utils/EventEmitter.js:26:9
 
   emit (event, ...args) {
     let result = true
-    if (this._listeners[event]) {
+    if (false) {
       const snapshot = [...this._listeners[event]]
       for (const cb of snapshot) {
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

                <div … />
                <div class="tulweb-empty-state">
                    <svg … />
                    <div … />

[Killed] ConditionalExpression
src/utils/EventEmitter.js:26:9
 
   emit (event, ...args) {
     let result = true
-    if (this._listeners[event]) {
+    if (true) {
       const snapshot = [...this._listeners[event]]
       for (const cb of snapshot) {
killedBy: PopoutManager Unit Tests popout(stack) successfully tracking location and removing from DOM
statusReason: TypeError: this._listeners[event] is not iterable

[Killed] ArrayDeclaration
src/utils/EventEmitter.js:27:24
   emit (event, ...args) {
     let result = true
     if (this._listeners[event]) {
-      const snapshot = [...this._listeners[event]]
+      const snapshot = []
       for (const cb of snapshot) {
         if (cb(...args) === false) result = false
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

                <div … />
                <div class="tulweb-empty-state">
                    <svg … />
                    <div … />

[Killed] BlockStatement
src/utils/EventEmitter.js:28:34
     let result = true
     if (this._listeners[event]) {
       const snapshot = [...this._listeners[event]]
-      for (const cb of snapshot) {
-        if (cb(...args) === false) result = false
-      }
+      for (const cb of snapshot) {}
     }
     return result
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

                <div … />
                <div class="tulweb-empty-state">
                    <svg … />
                    <div … />

[Killed] ConditionalExpression
src/utils/EventEmitter.js:29:13
     if (this._listeners[event]) {
       const snapshot = [...this._listeners[event]]
       for (const cb of snapshot) {
-        if (cb(...args) === false) result = false
+        if (true) result = false
       }
     }
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

                <div … />
                <div class="tulweb-empty-state">
                    <svg … />
                    <div … />

[Killed] ConditionalExpression
src/utils/EventEmitter.js:29:13
     if (this._listeners[event]) {
       const snapshot = [...this._listeners[event]]
       for (const cb of snapshot) {
-        if (cb(...args) === false) result = false
+        if (false) result = false
       }
     }
killedBy: LayoutManager emits events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "payload"

Number of calls: 0
