[Killed] BlockStatement
src/utils/Utils.js:2:49
 export class Utils {
-  static createElement (tag, className, parent) {
-    const el = document.createElement(tag)
-    if (className) el.className = className
-    if (parent) parent.appendChild(el)
-    return el
-  }
+  static createElement (tag, className, parent) {}
 
   static generateId () {
killedBy: LayoutManager initializes with a container
statusReason: TypeError: Cannot read properties of undefined (reading 'style')

[Killed] ConditionalExpression
src/utils/Utils.js:4:9
 export class Utils {
   static createElement (tag, className, parent) {
     const el = document.createElement(tag)
-    if (className) el.className = className
+    if (false) el.className = className
     if (parent) parent.appendChild(el)
     return el
killedBy: StackItem renderTabs generates tab elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Survived] ConditionalExpression
src/utils/Utils.js:4:9
 export class Utils {
   static createElement (tag, className, parent) {
     const el = document.createElement(tag)
-    if (className) el.className = className
+    if (true) el.className = className
     if (parent) parent.appendChild(el)
     return el

[Killed] ConditionalExpression
src/utils/Utils.js:5:9
   static createElement (tag, className, parent) {
     const el = document.createElement(tag)
     if (className) el.className = className
-    if (parent) parent.appendChild(el)
+    if (false) parent.appendChild(el)
     return el
   }
killedBy: StackItem renderTabs generates tab elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/utils/Utils.js:5:9
   static createElement (tag, className, parent) {
     const el = document.createElement(tag)
     if (className) el.className = className
-    if (parent) parent.appendChild(el)
+    if (true) parent.appendChild(el)
     return el
   }
killedBy: StackItem updateOverflow detects horizontal overflow and shows button
statusReason: TypeError: Cannot read properties of undefined (reading 'appendChild')

[Killed] BlockStatement
src/utils/Utils.js:9:24
     return el
   }
 
-  static generateId () {
-    return Math.random().toString(36).substr(2, 9)
-  }
+  static generateId () {}
 
   static getRelativePos (evt, elem) {
killedBy: Utils generateId returns a string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: "undefined"

[Survived] MethodExpression
src/utils/Utils.js:10:12
   }
 
   static generateId () {
-    return Math.random().toString(36).substr(2, 9)
+    return Math.random().toString(36)
   }
 

[Killed] BlockStatement
src/utils/Utils.js:13:37
     return Math.random().toString(36).substr(2, 9)
   }
 
-  static getRelativePos (evt, elem) {
-    const isTouch = evt.touches && evt.touches.length > 0
-    const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
-    const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
-    const rect = elem.getBoundingClientRect()
-
-    return {
-      x: clientX - rect.left,
-      y: clientY - rect.top,
-      w: rect.width,
-      h: rect.height,
-      pointerX: clientX,
-      pointerY: clientY
-    }
-  }
+  static getRelativePos (evt, elem) {}
 
   static parseSize (size) {
killedBy: Utils getRelativePos calculates correct relative position
statusReason: TypeError: Cannot read properties of undefined (reading 'x')

[Killed] LogicalOperator
src/utils/Utils.js:14:21
   }
 
   static getRelativePos (evt, elem) {
-    const isTouch = evt.touches && evt.touches.length > 0
+    const isTouch = evt.touches || evt.touches.length > 0
     const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
     const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
killedBy: Utils getRelativePos calculates correct relative position
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/utils/Utils.js:14:21
   }
 
   static getRelativePos (evt, elem) {
-    const isTouch = evt.touches && evt.touches.length > 0
+    const isTouch = true
     const clientX = isTouch ? evt.touches[0].clientX : evt.clientX
     const clientY = isTouch ? evt.touches[0].clientY : evt.clientY
killedBy: Utils getRelativePos calculates correct relative position
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArithmeticOperator
src/utils/Utils.js:20:10
     const rect = elem.getBoundingClientRect()
 
     return {
-      x: clientX - rect.left,
+      x: clientX + rect.left,
       y: clientY - rect.top,
       w: rect.width,
killedBy: Utils getRelativePos calculates correct relative position
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 250

[Killed] ArithmeticOperator
src/utils/Utils.js:21:10
 
     return {
       x: clientX - rect.left,
-      y: clientY - rect.top,
+      y: clientY + rect.top,
       w: rect.width,
       h: rect.height,
killedBy: Utils getRelativePos calculates correct relative position
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 250

[Killed] BlockStatement
src/utils/Utils.js:29:27
     }
   }
 
-  static parseSize (size) {
-    if (typeof size === 'number') return { value: size, unit: 'weight' }
-    if (typeof size !== 'string') return { value: 0, unit: 'weight' }
-    const match = size.match(/^([\d.]+)([a-z%]*)$/)
-    if (!match) {
-      const val = parseFloat(size)
-      return isNaN(val) ? { value: 0, unit: 'weight' } : { value: val, unit: 'px' }
-    }
-    return { value: parseFloat(match[1]), unit: match[2] || 'px' }
-  }
+  static parseSize (size) {}
 
   static resolveToPixels (size, totalPixels) {
killedBy: Utils parseSize parses numbers as weight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"unit": "weight", "value": 25}
Received: undefined

[Killed] ConditionalExpression
src/utils/Utils.js:30:9
   }
 
   static parseSize (size) {
-    if (typeof size === 'number') return { value: size, unit: 'weight' }
+    if (false) return { value: size, unit: 'weight' }
     if (typeof size !== 'string') return { value: 0, unit: 'weight' }
     const match = size.match(/^([\d.]+)([a-z%]*)$/)
killedBy: Utils parseSize parses numbers as weight
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "unit": "weight",
-   "value": 25,

[Killed] ConditionalExpression
src/utils/Utils.js:30:9
   }
 
   static parseSize (size) {
-    if (typeof size === 'number') return { value: size, unit: 'weight' }
+    if (true) return { value: size, unit: 'weight' }
     if (typeof size !== 'string') return { value: 0, unit: 'weight' }
     const match = size.match(/^([\d.]+)([a-z%]*)$/)
killedBy: Utils parseSize parses weight strings
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "unit": "%",
-   "value": 50,

[Killed] ConditionalExpression
src/utils/Utils.js:31:9
 
   static parseSize (size) {
     if (typeof size === 'number') return { value: size, unit: 'weight' }
-    if (typeof size !== 'string') return { value: 0, unit: 'weight' }
+    if (true) return { value: 0, unit: 'weight' }
     const match = size.match(/^([\d.]+)([a-z%]*)$/)
     if (!match) {
killedBy: Utils parseSize parses weight strings
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "unit": "%",
-   "value": 50,

[Killed] EqualityOperator
src/utils/Utils.js:31:9
 
   static parseSize (size) {
     if (typeof size === 'number') return { value: size, unit: 'weight' }
-    if (typeof size !== 'string') return { value: 0, unit: 'weight' }
+    if (typeof size === 'string') return { value: 0, unit: 'weight' }
     const match = size.match(/^([\d.]+)([a-z%]*)$/)
     if (!match) {
killedBy: Utils parseSize parses weight strings
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "unit": "%",
-   "value": 50,

[Survived] Regex
src/utils/Utils.js:32:30
   static parseSize (size) {
     if (typeof size === 'number') return { value: size, unit: 'weight' }
     if (typeof size !== 'string') return { value: 0, unit: 'weight' }
-    const match = size.match(/^([\d.]+)([a-z%]*)$/)
+    const match = size.match(/([\d.]+)([a-z%]*)$/)
     if (!match) {
       const val = parseFloat(size)

[Killed] ConditionalExpression
src/utils/Utils.js:33:9
     if (typeof size === 'number') return { value: size, unit: 'weight' }
     if (typeof size !== 'string') return { value: 0, unit: 'weight' }
     const match = size.match(/^([\d.]+)([a-z%]*)$/)
-    if (!match) {
+    if (true) {
       const val = parseFloat(size)
       return isNaN(val) ? { value: 0, unit: 'weight' } : { value: val, unit: 'px' }
killedBy: Utils parseSize parses weight strings
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "unit": "%",
+   "unit": "px",

[Killed] BooleanLiteral
src/utils/Utils.js:33:9
     if (typeof size === 'number') return { value: size, unit: 'weight' }
     if (typeof size !== 'string') return { value: 0, unit: 'weight' }
     const match = size.match(/^([\d.]+)([a-z%]*)$/)
-    if (!match) {
+    if (match) {
       const val = parseFloat(size)
       return isNaN(val) ? { value: 0, unit: 'weight' } : { value: val, unit: 'px' }
killedBy: Utils parseSize parses weight strings
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "unit": "%",
+   "unit": "px",

[NoCoverage] StringLiteral
src/utils/Utils.js:35:78
     const match = size.match(/^([\d.]+)([a-z%]*)$/)
     if (!match) {
       const val = parseFloat(size)
-      return isNaN(val) ? { value: 0, unit: 'weight' } : { value: val, unit: 'px' }
+      return isNaN(val) ? { value: 0, unit: 'weight' } : { value: val, unit: "" }
     }
     return { value: parseFloat(match[1]), unit: match[2] || 'px' }

[Killed] ConditionalExpression
src/utils/Utils.js:37:49
       const val = parseFloat(size)
       return isNaN(val) ? { value: 0, unit: 'weight' } : { value: val, unit: 'px' }
     }
-    return { value: parseFloat(match[1]), unit: match[2] || 'px' }
+    return { value: parseFloat(match[1]), unit: false }
   }
 
killedBy: Utils parseSize parses weight strings
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "unit": "%",
+   "unit": false,

[Killed] LogicalOperator
src/utils/Utils.js:37:49
       const val = parseFloat(size)
       return isNaN(val) ? { value: 0, unit: 'weight' } : { value: val, unit: 'px' }
     }
-    return { value: parseFloat(match[1]), unit: match[2] || 'px' }
+    return { value: parseFloat(match[1]), unit: match[2] && 'px' }
   }
 
killedBy: Utils parseSize parses weight strings
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "unit": "%",
+   "unit": "px",

[Killed] BlockStatement
src/utils/Utils.js:40:46
     return { value: parseFloat(match[1]), unit: match[2] || 'px' }
   }
 
-  static resolveToPixels (size, totalPixels) {
-    if (typeof size === 'number') return size
-    const parsed = Utils.parseSize(size)
-    if (parsed.unit === 'px') return parsed.value
-    if (parsed.unit === '%') return (parsed.value / 100) * totalPixels
-    if (parsed.unit === 'weight') return (parsed.value / 100) * totalPixels // Optional but consistent
-    return parsed.value
-  }
+  static resolveToPixels (size, totalPixels) {}
 }
 
killedBy: Utils resolveToPixels resolves numbers directly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: undefined

[Killed] EqualityOperator
src/utils/Utils.js:41:9
   }
 
   static resolveToPixels (size, totalPixels) {
-    if (typeof size === 'number') return size
+    if (typeof size !== 'number') return size
     const parsed = Utils.parseSize(size)
     if (parsed.unit === 'px') return parsed.value
killedBy: Utils resolveToPixels resolves numbers directly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 500

[Killed] ConditionalExpression
src/utils/Utils.js:41:9
   }
 
   static resolveToPixels (size, totalPixels) {
-    if (typeof size === 'number') return size
+    if (true) return size
     const parsed = Utils.parseSize(size)
     if (parsed.unit === 'px') return parsed.value
killedBy: Utils resolveToPixels resolves percentage strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: "50%"

[Killed] EqualityOperator
src/utils/Utils.js:43:9
   static resolveToPixels (size, totalPixels) {
     if (typeof size === 'number') return size
     const parsed = Utils.parseSize(size)
-    if (parsed.unit === 'px') return parsed.value
+    if (parsed.unit !== 'px') return parsed.value
     if (parsed.unit === '%') return (parsed.value / 100) * totalPixels
     if (parsed.unit === 'weight') return (parsed.value / 100) * totalPixels // Optional but consistent
killedBy: Utils resolveToPixels resolves percentage strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 50

[Killed] ConditionalExpression
src/utils/Utils.js:43:9
   static resolveToPixels (size, totalPixels) {
     if (typeof size === 'number') return size
     const parsed = Utils.parseSize(size)
-    if (parsed.unit === 'px') return parsed.value
+    if (true) return parsed.value
     if (parsed.unit === '%') return (parsed.value / 100) * totalPixels
     if (parsed.unit === 'weight') return (parsed.value / 100) * totalPixels // Optional but consistent
killedBy: Utils resolveToPixels resolves percentage strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 50

[Killed] EqualityOperator
src/utils/Utils.js:44:9
     if (typeof size === 'number') return size
     const parsed = Utils.parseSize(size)
     if (parsed.unit === 'px') return parsed.value
-    if (parsed.unit === '%') return (parsed.value / 100) * totalPixels
+    if (parsed.unit !== '%') return (parsed.value / 100) * totalPixels
     if (parsed.unit === 'weight') return (parsed.value / 100) * totalPixels // Optional but consistent
     return parsed.value
killedBy: Utils resolveToPixels resolves percentage strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 50

[Killed] ArithmeticOperator
src/utils/Utils.js:44:37
     if (typeof size === 'number') return size
     const parsed = Utils.parseSize(size)
     if (parsed.unit === 'px') return parsed.value
-    if (parsed.unit === '%') return (parsed.value / 100) * totalPixels
+    if (parsed.unit === '%') return parsed.value / 100 / totalPixels
     if (parsed.unit === 'weight') return (parsed.value / 100) * totalPixels // Optional but consistent
     return parsed.value
killedBy: Utils resolveToPixels resolves percentage strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 0.0005

[NoCoverage] ConditionalExpression
src/utils/Utils.js:45:9
     const parsed = Utils.parseSize(size)
     if (parsed.unit === 'px') return parsed.value
     if (parsed.unit === '%') return (parsed.value / 100) * totalPixels
-    if (parsed.unit === 'weight') return (parsed.value / 100) * totalPixels // Optional but consistent
+    if (true) return (parsed.value / 100) * totalPixels // Optional but consistent
     return parsed.value
   }

[NoCoverage] ArithmeticOperator
src/utils/Utils.js:45:43
     const parsed = Utils.parseSize(size)
     if (parsed.unit === 'px') return parsed.value
     if (parsed.unit === '%') return (parsed.value / 100) * totalPixels
-    if (parsed.unit === 'weight') return (parsed.value / 100) * totalPixels // Optional but consistent
+    if (parsed.unit === 'weight') return (parsed.value * 100) * totalPixels // Optional but consistent
     return parsed.value
   }
