[Killed] BlockStatement
src/ui/DragSource.js:2:52
 export class DragSource {
-  constructor (element, itemConfig, layoutManager) {
-    this.element = element
-    this.itemConfig = itemConfig
-    this.layoutManager = layoutManager
-    this.element.classList.add('tulweb-drag-source')
-
-    const startHandler = (e) => {
-      // Config is cloned later in startDrag() only if the drag threshold is met
-      this.layoutManager.dragManager.pendDrag(e, this.itemConfig, 'external', null, this.itemConfig.title)
-    }
-
-    this.element.addEventListener('mousedown', startHandler)
-    this.element.addEventListener('touchstart', startHandler, { passive: true })
-  }
+  constructor (element, itemConfig, layoutManager) {}
 }
 
killedBy: DragSource Component Tests DragSource initializes and adds class
statusReason: TypeError: Cannot read properties of undefined (reading 'classList')

[Killed] BlockStatement
src/ui/DragSource.js:8:33
     this.layoutManager = layoutManager
     this.element.classList.add('tulweb-drag-source')
 
-    const startHandler = (e) => {
-      // Config is cloned later in startDrag() only if the drag threshold is met
-      this.layoutManager.dragManager.pendDrag(e, this.itemConfig, 'external', null, this.itemConfig.title)
-    }
+    const startHandler = (e) => {}
 
     this.element.addEventListener('mousedown', startHandler)
killedBy: DragSource Component Tests MouseDown triggers pendDrag on layoutManager
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, {"title": "My Component", "type": "component"}, "external", null, "My Component"

Number of calls: 0

[Survived] BooleanLiteral
src/ui/DragSource.js:14:74
     }
 
     this.element.addEventListener('mousedown', startHandler)
-    this.element.addEventListener('touchstart', startHandler, { passive: true })
+    this.element.addEventListener('touchstart', startHandler, { passive: false })
   }
 }

[Killed] StringLiteral
src/ui/DragSource.js:14:35
     }
 
     this.element.addEventListener('mousedown', startHandler)
-    this.element.addEventListener('touchstart', startHandler, { passive: true })
+    this.element.addEventListener("", startHandler, { passive: true })
   }
 }
killedBy: DragSource Component Tests TouchStart triggers pendDrag on layoutManager
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, {"title": "Touch Comp"}, "external", null, "Touch Comp"

Number of calls: 0
